#Область ПрограммныйИнтерфейс

// Возвращает сокращенное представление штрихкода маркируемой продукции.
// 
// Параметры:
// 	Штрихкод - Строка - Штрихкод строкой.
// 	ВидуУпаковки - ПеречислениеСсылка.ВидыУпаковокИС - Значение упаковки
// Возвращаемое значение:
// 	Строка - Краткое представление штрихкода маркируемой продукции.
Функция ПредставлениеШтрихкодаПоВидуУпаковки(Штрихкод, ВидуУпаковки) Экспорт
	
	Если ВидуУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская") Тогда
		ПредставлениеШтрихкода = Штрихкод;
	Иначе
		ПредставлениеШтрихкода = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ПредставлениеШтрихкода(Штрихкод);
	КонецЕсли;
	
	Возврат ПредставлениеШтрихкода;
	
КонецФункции

Функция SSCCАгрегата(Штрихкод) Экспорт
	
	ПараметрыШтрихкода = ШтрихкодыУпаковокКлиентСервер.ПараметрыШтрихкода(Штрихкод);
	Если ПараметрыШтрихкода.Результат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
	КонецЕсли;
	Если ПараметрыШтрихкода.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC")
		Или ПараметрыШтрихкода.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC18") Тогда
		КодАгрегата = ШтрихкодыУпаковокКлиентСервер.ШтрихкодSSCC(ПараметрыШтрихкода.Результат, Ложь, Ложь);
	ИначеЕсли ПараметрыШтрихкода.ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов.SSCC20") Тогда
		КодАгрегата = ШтрихкодыУпаковокКлиентСервер.ШтрихкодSSCC(ПараметрыШтрихкода.Результат, Ложь, Истина);
	Иначе
		ВызватьИсключение НСтр("ru = 'Внутренняя ошибка'");
	КонецЕсли;
	
	Возврат КодАгрегата;
	
КонецФункции

// Возвращает способ ввода в оборот СУЗ по виду операции.
// 
// Параметры:
//  ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции документа.
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС  - Вид продукции.
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыВводаВОборотСУЗ, Массив из ПеречислениеСсылка.СпособыВводаВОборотСУЗ - Способ ввода в оборот СУЗ.
Функция СпособВводаВОборотСУЗПоВидуОперации(ВидОперации, ВидПродукции = Неопределено) Экспорт
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Импорт");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля") Тогда
		ВозвращаемоеЗначение = Новый Массив();
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Импорт"));
		Возврат ВозвращаемоеЗначение;
	ИначеЕсли ВидОперации = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц") Тогда
		ВозвращаемоеЗначение = Новый Массив();
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Производство"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Комиссия"));
		Возврат ВозвращаемоеЗначение;
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору")
		Или ВидОперации = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Производство");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков") Тогда
		Если ТипЗнч(ВидПродукции) = Тип("СправочникСсылка.ТоварныеГруппыГИСМТ") Тогда
			ВозвращаемоеЗначение = Новый Массив();
			ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков"));
			ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта"));
			Возврат ВозвращаемоеЗначение;
		ИначеЕсли ЗаказНаЭмиссиюСУЗКлиентСервер.ДоступенСпособВводаВОборот(
			ВидПродукции,
			ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков")) Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков");
		Иначе
			Возврат ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта");
		КонецЕсли;
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ") Тогда
		ВозвращаемоеЗначение = Новый Массив();
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Производство"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Импорт"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка"));
		ВозвращаемоеЗначение.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Комиссия"));
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.ПустаяСсылка");
	
КонецФункции

#Область ШаблоныПараметровСканирования

// Настройки параметров сканирования документа производства, заполняемые при внедрении библиотеки.
// 
// Возвращаемое значение:
//  Структура - Настройки параметров сканирования документа производства:
//   * Организация - Неопределено, ОпределяемыйТип.Организация - организация документа производства,
//   * Склад - Неопределено, ОпределяемыйТип.Склад - склад документа производства.
Функция НастройкиПараметровСканированияДокументаПроизводства() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Организация");
	Результат.Вставить("Склад");
	Возврат Результат;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов производства товара.
//   Применимо для настроек ИСМП: весовая (молочная) продукция.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
//   Настройки - см. НастройкиПараметровСканированияДокументаПроизводства
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаПроизводства(ПараметрыСканирования, ВидПродукции, Настройки, Контекст = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВидПродукции)
		И Не КонструкторИСМПКлиентСервер.ВидПродукцииПоддерживаетПеременноеКоличествоМернойПродукции(ВидПродукции) Тогда
		Возврат Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(ВидПродукции) Тогда
		ВключенаПоддержкаИСМП = Ложь;
		ВидыПродукцииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(, Ложь);
		Для Каждого ЭлементМассива Из ВидыПродукцииИСМП Цикл
			Если КонструкторИСМПКлиентСервер.ВидПродукцииПоддерживаетПеременноеКоличествоМернойПродукции(ЭлементМассива) Тогда
				Если ВключенаПоддержкаИСМП Тогда
					ПараметрыСканирования.ДопустимыеВидыПродукции.Добавить(ЭлементМассива);
				Иначе
					ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ЭлементМассива);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если Не ВключенаПоддержкаИСМП Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидПродукции);
	КонецЕсли;
	
	ПараметрыКонтроля = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
	ДопустимыеВидыОпераций = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций();
	ОперацииРозничнойТорговли = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ОперацииРозничнойТорговли();
	ОперацииКонтроляСтатусов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ДопустимыеВидыОпераций[ПараметрыКонтроля.ПараметрыКонтроляСтатусов],
		ОперацииРозничнойТорговли);
	КонтрольСтатусов = НастройкаПараметровСканированияСлужебныйКлиентСервер.КонтролироватьСтатусыКодовМаркировки(
		ПараметрыСканирования.ДопустимыеВидыПродукции, ОперацииКонтроляСтатусов, Ложь);
	ОперацииКонтроляВладельцев = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ДопустимыеВидыОпераций[ПараметрыКонтроля.ПараметрыКонтроляВладельцев],
		ОперацииРозничнойТорговли);
	КонтрольВладельцев = КонтрольСтатусов И НастройкаПараметровСканированияСлужебныйКлиентСервер.КонтролироватьВладельцевКодовМаркировки(
		ПараметрыСканирования.ДопустимыеВидыПродукции, ОперацииКонтроляВладельцев);
	
	ЗапрашиватьДанныеНеизвестныхУпаковок = (КонтрольСтатусов Или КонтрольВладельцев);
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Неопределен"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(Неопределено);
	
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(
		ПараметрыСканирования, ЗапрашиватьДанныеНеизвестныхУпаковок);
	
	ПараметрыСканирования.КонтрольПустыхУпаковок             = Ложь;
	ПараметрыСканирования.ПоддерживаютсяОперацииАгрегации    = Истина;
	ПараметрыСканирования.ДоступнаПечатьЭтикеток             = Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(ВидПродукции);
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                = Истина;
	
	ПараметрыСканирования.Организация = Настройки.Организация;
	ПараметрыСканирования.Склад       = Настройки.Склад;
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборот");
	
	Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
		ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
		ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
	КонецЕсли;
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидПродукции);
	
	Возврат Истина;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов розничной продажи товара (например чеков).
//   Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидыПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Виды продукции ИС.
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаРозничнойПродажи(ПараметрыСканирования, ВидыПродукции, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидОперацииРозничнаяПродажа();
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ВидыПродукции,, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования);
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		
		Если Не ЗначениеЗаполнено(ВидыПродукции) И КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ПараметрыСканирования.ДопустимыеВидыПродукции)
			Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции) Тогда
			ПараметрыСканирования.КонтролироватьОкончаниеСрокаГодности = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ТребуетсяЧастичноеВыбытие       = Истина;
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП = Истина;
		ПараметрыСканирования.ДетализацияСтруктурыХранения    = ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки");
		ПараметрыСканирования.ВидОперацииИСМП                 = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов розничного возврата товара
//   (например чеков на возврат). Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаРозничногоВозврата(ПараметрыСканирования, ВидПродукции, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидОперацииРозничныйВозврат();
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ВидПродукции,, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Продан"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Продан"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования);
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ТребуетсяЧастичноеВыбытие       = Истина;
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП = Истина;
		ПараметрыСканирования.ДетализацияСтруктурыХранения    = ПредопределенноеЗначение("Перечисление.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковки");
		ПараметрыСканирования.ВидОперацииИСМП                 = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов оптовой продажи товара (например реализации).
//   Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидыПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Виды продукции ИС.
//   АнализироватьУчитываемыеВидыПродукции - Булево - Анализировать учитываемые виды продукции
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
//   
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаОптовойОтгрузки(ПараметрыСканирования, ВидыПродукции, АнализироватьУчитываемыеВидыПродукции = Истина, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидОперацииОптоваяПродажа();
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(
		ПараметрыСканирования, ВидыПродукции, АнализироватьУчитываемыеВидыПродукции, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции, АнализироватьУчитываемыеВидыПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		
		ПараметрыСканирования.ВариантПолученияМРЦ             = "Вычисление";
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП  = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		
		Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
			ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет = ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет
				Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяОбъемноСортовойУчет(ВидПродукции, ВидОперацииИСМП);
		КонецЦикла;
		
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ЗапрашиватьКоличествоМерногоТовара;
		ПараметрыСканирования.КонтролироватьРазрешительныеДокументыИСМП = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП = Истина;
		
		// Для обогащения информации об ошибке при выводе пользователю
		ПараметрыСканирования.ВидОперацииИСМП                 = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов оптовового возврата товара.
//   Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидыПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Виды продукции ИС.
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаОптовогоВозврата(ПараметрыСканирования, ВидыПродукции, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидОперацииОптовыйВозврат();
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ВидыПродукции,, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП  = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
		
		Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
			ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет = ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет
				Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяОбъемноСортовойУчет(ВидПродукции, ВидОперацииИСМП);
		КонецЦикла;
		
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ЗапрашиватьКоличествоМерногоТовара;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП = Истина;
		
		// Для обогащения информации об ошибке при выводе пользователю
		ПараметрыСканирования.ВидОперацииИСМП = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов закупки (приобретения) товара.
//   Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидыПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Виды продукции ИС.
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаЗакупки(ПараметрыСканирования, ВидыПродукции, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ВидОперацииЗакупка();
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ВидыПродукции,, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенНеОплачен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенНеОплачен"));
		
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД"));
		
		Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
			ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет = ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет
				Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяОбъемноСортовойУчет(ВидПродукции, ВидОперацииИСМП);
		КонецЦикла;
		
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ЗапрашиватьКоличествоМерногоТовара;
		ПараметрыСканирования.КонтролироватьРазрешительныеДокументыИСМП = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		// Для обогащения информации об ошибке при выводе пользователю
		ПараметрыСканирования.ВидОперацииИСМП = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

// Заполняет библиотечные настройки параметров сканирования для документов закупки (приобретения) товара.
//   Применимо для настроек МОТП, ИСМП.
//
// Параметры:
//   ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.БазовыеПараметрыСканирования
//   ВидыПродукции - Массив Из СправочникСсылка.ВидыПродукцииИС - Виды продукции ИС
//   Контекст - ФормаКлиентскогоПриложения, ДанныеФормыСтруктура - данные для дополнения параметров сканирования.
//   
// Возвращаемое значение:
//   Булево - параметры сканирования дополнены спецификой ИС МП.
Функция ЗаполнитьПараметрыСканированияДокументаВнутреннегоПеремещения(ПараметрыСканирования, ВидыПродукции, Контекст = Неопределено) Экспорт
	
	Если Не ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПеремещениеМеждуМОД");
	
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования, ВидыПродукции,, ВидОперацииИСМП);
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции);
	
	Если ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотВозвращен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокМОТП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НанесенОплачен"));
		
		ПараметрыСканирования.ВариантПолученияМРЦ             = "Вычисление";
		ПараметрыСканирования.ДопустимыПроверкиСеройЗоныМОТП  = Истина;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		
		Для Каждого ВидПродукции Из ПараметрыСканирования.ДопустимыеВидыПродукции Цикл
			ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет = ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет
				Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяОбъемноСортовойУчет(ВидПродукции, ВидОперацииИСМП);
		КонецЦикла;
		
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ЗапрашиватьКоличествоМерногоТовара;
		
	КонецЕсли;
	
	Если ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП Тогда
		
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП = Истина;
		
		// Для обогащения информации об ошибке при выводе пользователю
		ПараметрыСканирования.ВидОперацииИСМП = ВидОперацииИСМП;
		
		Если Контекст <> Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Дата") Тогда
			ПараметрыСканирования.ДатаДокумента = Контекст.Дата;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПараметрыСканирования.ДатаДокумента) Тогда
			ПараметрыСканирования.ДатаДокумента = ТекущаяДатаСУчетомКонтекста();
		КонецЕсли;
		
		НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
		
	КонецЕсли;
	
	Возврат ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Включает поддержку маркируемой продукции, дополняя базовые параметры сканирования, параметрами необходимыми для обработки
// штрихкодов ИСМП (кроме табака).
//
// Параметры:
//   ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования), дополняются параметрами:
//    * ЗапрашиватьДанныеСервисаИСМП - Булево, Строка - Истина, если требуется разрешить запрашивать данные в ГИС МТ, "ПоУмолчанию" - если проверяется по ФО с учетом исключений
//    * ДопустимыеСтатусыИСМП - Массив из ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - Статусы, которые разрешены.
//    * КонтролироватьРасхожденияСИСМП - Булево - Истина, если требуется сравнить данные, хранящиеся в справочнике
//          Штрихкоды упаковок товаров с данными сервиса ИС МП и отобразить расхождения.
//   ПараметрВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции
//                        - Массив Из СправочникСсылка.ВидыПродукцииИС
//                        - Неопределено
//   АнализироватьУчитываемыеВидыПродукции - Булево - Анализировать учитываемые виды продукции
//
// Возвращаемое значение:
//  Булево - параметры сканирования штрихкодов обуви добавлены
//
Функция ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ПараметрВидПродукции = Неопределено, АнализироватьУчитываемыеВидыПродукции = Истина) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрВидПродукции)
		И Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ПараметрВидПродукции) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если АнализироватьУчитываемыеВидыПродукции Тогда
		ВидыПродукцииИСМП = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции(, Ложь);
		Если ВидыПродукцииИСМП.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ВидыПродукцииИСМП = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Ложь);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрВидПродукции) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыСканирования.ДопустимыеВидыПродукции, ВидыПродукцииИСМП, Истина);
	Иначе
		
		Если ТипЗнч(ПараметрВидПродукции) = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
			ВидыПродукции = Новый Массив();
			ВидыПродукции.Добавить(ПараметрВидПродукции);
		Иначе
			ВидыПродукции = ПараметрВидПродукции;
		КонецЕсли;
		
		Для Каждого ВидПродукции Из ВидыПродукции Цикл
			Если ВидыПродукцииИСМП.Найти(ВидПродукции) <> Неопределено Тогда
				ПараметрыСканирования.ДопустимыеВидыПродукции.Добавить(ВидПродукции);
			КонецЕсли;
		КонецЦикла;
		
		Если ПараметрыСканирования.ДопустимыеВидыПродукции.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ШтрихкодированиеОбщегоНазначенияИСМПКлиентСервер.ДополнитьПараметрамиСканированияИСМП(ПараметрыСканирования);
	
	ПараметрыСканирования.ИСМП = Истина;
	
	Возврат Истина;
	
КонецФункции

Процедура ДополнитьПараметрыЗаполненияТабличнойЧастиТовары(ПараметрыЗаполнения) Экспорт
	
	ПараметрыЗаполнения.Вставить("ЗаполнитьGTIN", Истина);
	
КонецПроцедуры

Процедура ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст, ПараметрыСканирования, ПараметрыРежимаИсправленияОшибок) Экспорт
	
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоФормаПроверкиИПодбора(Контекст) Тогда
		НастроитьПараметрыСканированияФормыПроверки(ПараметрыСканирования, Контекст.ФормаПроверкиИПодбора);
		ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст.Контекст, ПараметрыСканирования, ПараметрыРежимаИсправленияОшибок);
		Возврат;
	ИначеЕсли ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоФормаСУказаниемСценария(Контекст) Тогда
		ЗаполнитьРасширенныеПараметрыСканированияПоДокументам(Контекст.Контекст, ПараметрыСканирования, ПараметрыРежимаИсправленияОшибок);
		Возврат;
	КонецЕсли;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.МаркировкаТоваровИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияМаркировкаТоваров(Контекст, ПараметрыСканирования, ПараметрыРежимаИсправленияОшибок);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ВыводИзОборотаИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияВыводаИзОборота(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ВозвратВОборотИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияВозвратаВОборот(Контекст, ПараметрыСканирования);
	
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.СписаниеКодовМаркировкиИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияСписанияКодовМаркировки(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ПеремаркировкаТоваровИСМП")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Обработка.РаботаСКМПриПеремаркировкеТоваровИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияПеремаркировкаТоваров(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ОтгрузкаТоваровИСМП") Тогда 
		
		ЗаполнитьПараметрыСканированияОтгрузкаТоваровИСМП(Контекст, ПараметрыСканирования);
	
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ПриемкаТоваровИСМП") Тогда 
		
		ЗаполнитьПараметрыСканированияПриемкаТоваровИСМП(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда 
		
		ЗаполнитьПараметрыСканированияЗаказНаЭмиссиюКодовМаркировкиСУЗ(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Обработка.ПроверкаИПодборПродукцииИС") Тогда 
		
		ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования);
		ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = Неопределено;
		ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = Неопределено;
		ПараметрыСканирования.ТолькоМаркируемаяПродукция = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Обработка.ПроверкаКодовМаркировкиИСМП") Тогда 
		
		ЗаполнитьПараметрыСканированияПроверкаКодовМаркировки(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.УточнениеСведенийОКодахМаркировкиИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияУточнениеСведенийОКодахМаркировкиИСМП(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ОтчетОбИмпортеЕГАИС") Тогда
		
		ЗаполнитьПараметрыСканированияОтчетОбИмпортеЕГАИС(ПараметрыСканирования, Контекст);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ОтчетОПроизводствеЕГАИС") Тогда
		
		ЗаполнитьПараметрыСканированияОтчетОПроизводствеЕГАИС(ПараметрыСканирования, Контекст);
	
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "РегистрСведений.ВскрытыеПотребительскиеУпаковкиИС") Тогда
		
		ЗаполнитьПараметрыСканированияВскрытыеПотребительскиеУпаковки(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ОтчетИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияОтчетИСМП(Контекст, ПараметрыСканирования);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.ПеремещениеМеждуМОДИСМП") Тогда
		
		ЗаполнитьПараметрыСканированияПеремещениеМеждуМОД_ИСМП(Контекст, ПараметрыСканирования);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ПараметрВидПродукции) Экспорт
	
	Если ТипЗнч(ПараметрВидПродукции) = Тип("Массив") Тогда
		ВидыПродукции = ПараметрВидПродукции;
	ИначеЕсли Не ЗначениеЗаполнено(ПараметрВидПродукции) Тогда
		ВидыПродукции = Новый Массив(Новый ФиксированныйМассив(ПараметрыСканирования.ДопустимыеВидыПродукции));
	Иначе
		ВидыПродукции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВидПродукции);
	КонецЕсли;

	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		
		ПараметрыСканирования.КонтролироватьСтатусыКодовМаркировкиИСМП = ПараметрыСканирования.КонтролироватьСтатусыКодовМаркировкиИСМП
			Или НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(
				ВидПродукции,
				ПараметрыСканирования.ВидОперацииИСМП,
				ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ);
		
		ПараметрыСканирования.КонтролироватьВладельцевКодовМаркировкиИСМП = ПараметрыСканирования.КонтролироватьВладельцевКодовМаркировкиИСМП
			Или НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьВладельцевКодовМаркировки(
				ВидПродукции,
				ПараметрыСканирования.ВидОперацииИСМП);
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует новую структуру данных описания расширенного представления ошибки.
// 
// Возвращаемое значение:
// 	Структура:
// * Статус                                          - Неопределено, ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - Ошибочный статус.
// * ОсобоеСостояние                                 - Неопределено, ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - дополнительный статус состояния
// * ВидОперацииИСМП                                 - Неопределено, ПеречислениеСсылка.ВидыОперацийИСМП           - Вид операции.
// * СпособВводаВОборот                              - Неопределено, ПеречислениеСсылка.СпособыВводаВОборотСУЗ     - Способ ввода в оборот.
// * Владелец                                        - Булево - Признак ошибки владельца.
// * ВозможноИгнорировать                            - Булево - Признак продолжения операции после подтверждения пользователя.
// * ЗаголовокПродолжить                             - Неопределено, Строка    - Заголовок кнопки игнорирования ошибки.
// * ДанныеПроверкиНаККТ                             - Неопределено, Структура - Данные проверки ККТ.
// * ОбщаяОшибка                                     - Булево                  - Признак общей ошибки.
// * ТокенАвторизацииГИСМТ                           - Булево - Признак отсутствия токена авторизации для получения идентификаторов ГИС МТ
// * ЧастичноеВыбытиеНастроитьКарточкуНоменклатуры   - Булево - Вывод подсказки настройки карточки номенклатуры.
// * ЧастичноеВыбытиеНоменклатура                    - Булево, Неопределено - Гиперссылкка настройки номенклатуры.
// * ЗагрузитьCDNПлощадки                            - Булево - Вывод подсказки загрузки CDN-площадок
// * Организация                                     - Неопределено, ОпределяемыйТип.Организация - организация
// * ВидПродукцииИС                                  - Неопределено, ПеречислениеСсылка.ВидыПродукцииИС - товарная группа
// * ПараметрыНастройкиЛМЧЗ                          - Неопределено, Структура из КлючИЗначение - структура поиска настройки ЛМ ЧЗ
// * УстановитьЛокальныйМодульЧЗ                     - Булево - вывод подсказки об отсутствии установленных ЛМ ЧЗ
// * НастроитьЛокальныйМодульЧЗ                      - Булево - вывод подсказки о ненастроенном ЛМ ЧЗ
// * НекорректныйСтатусЛокальногоМодуляЧЗ            - Булево - Истина, если ЛМ находится в статусе отсутствия синхронизации или не настроен
// * НекорректныеДанныеАвторизацииЛокальногоМодуляЧЗ - Булево - Истина, если указаны некорректные данные авторизации к ЛМ ЧЗ
// * ЗапретитьОтключениеКонтроляСтатусов             - Булево - Истина, если продукция подлежит розничному контролю и отключить контроли нельзя
// * ЗапретЛокальнойПроверкиРазрешительногоРежима    - Строка - текст сообщения запрета, если КИ или GTIN или серия заблокированы по данным ЛМ ЧЗ.
// * СписокОрганизацийБлокировкиКМ                   - Строка - список организаций, заблокировавших оборот кода маркировки.
// * ОшибкаПроверкиНаТСПИоТ                          - Булево - Истина, если произошла ошибка проверки на ТС ПИоТ.
// * ТСПИоТ                                          - Неопределено - ссылка на ТС ПИоТ
Функция ПараметрыРасширенногоОписанияОшибки() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	
	ВозвращаемоеЗначение.Вставить("Статус",                                          Неопределено);
	ВозвращаемоеЗначение.Вставить("ОсобоеСостояние",                                 Неопределено);
	ВозвращаемоеЗначение.Вставить("Владелец",                                        Ложь);
	ВозвращаемоеЗначение.Вставить("ВидОперацииИСМП",                                 Неопределено);
	ВозвращаемоеЗначение.Вставить("ОбщаяОшибка",                                     Ложь);
	ВозвращаемоеЗначение.Вставить("ВозможноИгнорировать",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ДанныеПроверкиНаККТ",                             Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗаголовокПродолжить",                             Неопределено);
	ВозвращаемоеЗначение.Вставить("СпособВводаВОборот",                              Неопределено);
	ВозвращаемоеЗначение.Вставить("ТокенАвторизацииГИСМТ",                           Ложь);
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытиеНастроитьКарточкуНоменклатуры",   Ложь);
	ВозвращаемоеЗначение.Вставить("ЧастичноеВыбытиеНоменклатура",                    Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗагрузитьCDNПлощадки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("Организация",                                     Неопределено);
	ВозвращаемоеЗначение.Вставить("ВидПродукцииИС",                                  Неопределено);
	ВозвращаемоеЗначение.Вставить("ПараметрыНастройкиЛМЧЗ",                          Неопределено);
	ВозвращаемоеЗначение.Вставить("УстановитьЛокальныйМодульЧЗ",                     Ложь);
	ВозвращаемоеЗначение.Вставить("НастроитьЛокальныйМодульЧЗ",                      Ложь);
	ВозвращаемоеЗначение.Вставить("НекорректныйСтатусЛокальногоМодуляЧЗ",            Ложь);
	ВозвращаемоеЗначение.Вставить("НекорректныеДанныеАвторизацииЛокальногоМодуляЧЗ", Ложь);
	ВозвращаемоеЗначение.Вставить("ЗапретитьОтключениеКонтроляСтатусов",             Ложь);
	ВозвращаемоеЗначение.Вставить("ЗапретЛокальнойПроверкиРазрешительногоРежима",    "");
	ВозвращаемоеЗначение.Вставить("СписокОрганизацийБлокировкиКМ",                   "");
	ВозвращаемоеЗначение.Вставить("ОшибкаПроверкиНаТСПИоТ",                          Ложь);
	ВозвращаемоеЗначение.Вставить("ТСПИоТ",                                          Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Дополняет представление ошибки расширенные данными
// 
// Параметры:
// 	СтрокаДанных  - СтрокаТаблицыЗначений, СтрокаДереваЗначений - данные для оформирование и сохранения результата.
// 	ВидДополнения - См. ШтрихкодированиеИСМПКлиентСервер.ПараметрыРасширенногоОписанияОшибки.
Процедура ДополнитьПредставлениеОшибки(СтрокаДанных, ВидДополнения) Экспорт
	
	Если СтрокаДанных.ПараметрыОшибки = Неопределено Тогда
		СтруктураПараметров = Новый Структура();
		Для Каждого КлючИЗначение Из ПараметрыРасширенногоОписанияОшибки() Цикл
			СтруктураПараметров.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		СтрокаДанных.ПараметрыОшибки = СтруктураПараметров;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ВидДополнения Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			СтрокаДанных.ПараметрыОшибки[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДопустимыеНачальныеСтатусыОтчетОНанесении(Статусы) Экспорт
	
	Статусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	
КонецПроцедуры

Процедура ЗаполнитьОжидаемыеСтатусыПослеПередачиОтчетаОНанесении(Статусы) Экспорт
	
	Статусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПараметровСканирования

Процедура НастроитьПараметрыСканированияФормыПроверки(ПараметрыСканирования, Контекст)
	
	ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок = ПараметрыСканирования.ПоддерживаютсяОперацииАгрегации;
	ПараметрыСканирования.Сценарий = Контекст.Сценарий;
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Маркировка товаров ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
//  ПараметрыРежимаИсправленияОшибок - Структура - Параметры режима исправления ошибок.
Процедура ЗаполнитьПараметрыСканированияМаркировкаТоваров(Контекст, ПараметрыСканирования, ПараметрыРежимаИсправленияОшибок = Неопределено)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	Операция      = ИсточникДанных.Операция;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	ПараметрыСканирования.СозданиеНаборов = Истина;
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.КонтролироватьРасхождениеСоставаУпаковокМеждуИБиИСМП = Ложь;
	
	ДоступнаПечатьЭтикеток = Не КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(ВидыПродукции);
	
	ПараметрыСканирования.ДоступнаПечатьЭтикеток                         = ДоступнаПечатьЭтикеток;
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ПараметрыСканирования.КонтрольПустыхУпаковок                         = Ложь;
	ПараметрыСканирования.ПоддерживаютсяОперацииАгрегации                = Истина;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность           = Ложь;
	
	ПараметрыСканирования.КонтрольРасхожденийСДокументомОснованием       = Истина;
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                            = Истина;
	ПараметрыСканирования.РазрешенаОбработкаКодовСПустойНоменклатурой    = Истина;
	
	ПараметрыСканирования.Организация       = ИсточникДанных.Организация;
	ПараметрыСканирования.Владелец          = ИсточникДанных.Организация;
	ПараметрыСканирования.ДокументОснование = ИсточникДанных.ДокументОснование;
	
	ОперацииМаркировки = ИнтеграцияИСМПСлужебныйКлиентСервер.ОперацииМаркировки(Операция);
	ЭтоВводВОборотИмпортСФТС = (Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотИмпортСФТС"));
	ЭтоЗаполнениеДекларацииПоКодамУпаковок = (ЭтоВводВОборотИмпортСФТС
		И ИсточникДанных.ВариантВыполненияАгрегации = ПредопределенноеЗначение("Перечисление.ВариантыЗаполненияДекларацииИСМП.КодыУпаковок"));
	ЭтоАгрегацияПередВводомВОборот = (Не ЭтоВводВОборотИмпортСФТС
		И ИсточникДанных.ВариантВыполненияАгрегации = ПредопределенноеЗначение("Перечисление.ВариантыВыполненияАгрегацииИСМП.ПередВводомВОборот"));
	ПрисутствуетОперацияНанесения = ОперацииМаркировки.ЭтоОперацияНанесения Или ЗначениеЗаполнено(ИсточникДанных.ОперацияНанесения);
	
	ПараметрыСканирования.ВидОперацииИСМП = Операция;
	ПараметрыСканирования.Вставить("ОперацияНанесения", ИсточникДанных.ОперацияНанесения);
	
	ПараметрыСканирования.ДопустимыйСпособВводаВОборот = СпособВводаВОборотСУЗПоВидуОперации(Операция, ВидыПродукции);
	
	ДальнейшееДействие = Неопределено;
	Если ПараметрыРежимаИсправленияОшибок <> Неопределено Тогда
		ДальнейшееДействие = ПараметрыРежимаИсправленияОшибок.ДальнейшееДействие;
	КонецЕсли;
	
	Если ОперацииМаркировки.ЭтоАгрегация Тогда
		ПараметрыСканирования.ЭтоАгрегацияКодовМаркировкиИСМП = Истина;
	КонецЕсли;
	
	Если ОперацииМаркировки.ЭтоМаркировкаОстатков Тогда
		ПараметрыСканирования.ЭтоМаркировкаОстатков = Истина;
	Иначе
		ПараметрыСканирования.ЭтоМаркировкаОстатков = Ложь;
	КонецЕсли;
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(ВидыПродукции)
		И ОперацииМаркировки.ЭтоПриемкаКИЗ Тогда
		ПараметрыСканирования.СопоставлятьНоменклатуру = Ложь;
	КонецЕсли;
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(Неопределено);
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Неопределен"));
	
	Если Не ОперацииМаркировки.ЭтоАгрегация
		И (ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ВыполнитеАгрегацию")
			Или ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ВыполнитеАгрегациюСИсправлениями")) Тогда
		
		Если ЭтоЗаполнениеДекларацииПоКодамУпаковок Или ЭтоАгрегацияПередВводомВОборот Тогда
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			
		Иначе
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
			ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
			
		КонецЕсли;
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		
	ИначеЕсли ОперацииМаркировки.ЭтоАгрегация Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		
		Если ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Неопределено Тогда
			ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Новый Массив;
		КонецЕсли;
		
		ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		
	ИначеЕсли ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеДанныеСИсправлениями") Тогда
		
		Если ИсточникДанных.ОперацияНанесенияТолькоДляНаборов Тогда
			
			Если ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Неопределено Тогда
				ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Новый Массив;
			КонецЕсли;
			
			ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
			
		Иначе
			
			Если ЭтоЗаполнениеДекларацииПоКодамУпаковок Или ЭтоАгрегацияПередВводомВОборот Тогда
				ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			КонецЕсли;
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			
		КонецЕсли;
		
	Иначе
		
		Если ИсточникДанных.ОперацияНанесенияТолькоДляНаборов Тогда
			
			Если ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Неопределено Тогда
				ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП = Новый Массив;
			КонецЕсли;
			
			ПараметрыСканирования.ДопустимыеСтатусыНаборовИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
			
		Иначе
			
			Если ПрисутствуетОперацияНанесения Или ОперацииМаркировки.ЭтоПриемкаКИЗ Тогда
				
				ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
				ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
					
				Если ОперацииМаркировки.ЭтоПриемкаКИЗ Тогда
					ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
						ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован"));
					ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
						ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Индивидуализирован"));
				КонецЕсли;
				
			Иначе
				ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
				ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
				ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
				ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
					ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОперацииМаркировки.ЭтоИмпортСФТС Тогда
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС"));
			ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ВидыПродукции) Тогда
		ИнтеграцияИСМПВЕТИСКлиентСервер.ДополнитьПараметрыСканированияМаркировкаТоваров(Операция, ПараметрыСканирования);
	КонецЕсли;
	
	Если ПрисутствуетОперацияНанесения Тогда
		
		ПараметрыСканирования.ОперацияНанесенияТолькоДляНаборов = ИсточникДанных.ОперацияНанесенияТолькоДляНаборов;
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП   = Истина;
		ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП  = Истина;
		
		Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции) Тогда
			ПараметрыСканирования.ЗаполнятьСрокГодности = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
	ПараметрыСканирования.ИндивидуализироватьКИЗ = ОперацииМаркировки.ЭтоИндивидуализацияКИЗ
		Или ИсточникДанных.ОперацияНанесения = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ИндивидуализацияКИЗ");
	
	Если ПрисутствуетОперацияНанесения Тогда
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = Истина;
	Иначе
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки().ЗапрашиватьКоличествоМерногоТовара;
	КонецЕсли;
	
	ПараметрыСканирования.ЭтоМаркировкаТоваровИСМП = Истина;
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Вывод из оборота ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования).
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
Процедура ЗаполнитьПараметрыСканированияВыводаИзОборота(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	Операция      = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборота");
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
	
	ПараметрыСканирования.ВозможнаЗагрузкаТСД = Истина;
	ПараметрыСканирования.Организация         = ИсточникДанных.Организация;
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ИсточникДанных.ТоварнаяГруппа);
	
	Если ВыводИзОборотаКлиентСервер.ДоступноУведомлениеОбОтгрузкеНаЭкспорт(
		ВидыПродукцииПоТоварнойГруппе, ИсточникДанных.Причина) Тогда
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		
		Если Не ИсточникДанных.УведомитьОбОтгрузкеНаЭкспорт Тогда
			
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД"));
			
			ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПеремещенияМеждуМОД"));
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
		
	КонецЕсли;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = Операция;
	
	Если Не ИсточникДанных.ОбъемноСортовойУчет
		И КонструкторИСОбщегоНазначенияКлиентСервер.ПоддерживаетсяЧастичноеВыбытие(ИсточникДанных.ТоварнаяГруппа, Операция)
		И КонструкторИСМПКлиентСервер.ПоддерживаетсяЧастичноеВыбытиеПриВыводеИзОборота(ИсточникДанных.ТоварнаяГруппа, ИсточникДанных.Причина) Тогда
		ПараметрыСканирования.ТребуетсяЧастичноеВыбытие = Истина;
	КонецЕсли;
	
	ПараметрыСканирования.ИмяКолонкиЧастичноеВыбытиеКоличество     = "ЧастичноеВыбытиеКоличество";
	ПараметрыСканирования.ИмяКолонкиЧастичноеВыбытиеВариантУчета   = "ЧастичноеВыбытиеВариантУчета";
	ПараметрыСканирования.ИмяКолонкиЧастичноеВыбытиеНоменклатура   = "ЧастичноеВыбытиеНоменклатура";
	ПараметрыСканирования.ИмяКолонкиЧастичноеВыбытиеХарактеристика = "ЧастичноеВыбытиеХарактеристика";
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки = (Не ИсточникДанных.ОбъемноСортовойУчет);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Списание кодов маркировки ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования).
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
Процедура ЗаполнитьПараметрыСканированияСписанияКодовМаркировки(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                  = Истина;
	ПараметрыСканирования.КонтрольПустыхУпаковок                      = Ложь;
	ПараметрыСканирования.ПоддерживаютсяОперацииАгрегации             = Ложь;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность        = Ложь;
	ПараметрыСканирования.РазрешенаОбработкаКодовСПустойНоменклатурой = Истина;
	
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
	
	ПараметрыСканирования.Организация = ИсточникДанных.Организация;
	
	Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(ВидыПродукции) Тогда
		
		ПараметрыСканирования.ВидОперацииИСМП = ИсточникДанных.Операция;
		Если ИсточникДанных.Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезСУЗМех") Тогда
			ПараметрыСканирования.СопоставлятьНоменклатуру = Ложь;
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
		Иначе
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		КонецЕсли;
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован"));
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Индивидуализирован"));
		
	Иначе
		// Для обогащения информации об ошибке при выводе пользователю
		Если ИсточникДанных.Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезГИСМТОбщийДокумент") Тогда
			ПараметрыСканирования.ВидОперацииИСМП = ИсточникДанных.Операция;
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
		Иначе
			ПараметрыСканирования.ВидОперацииИСМП = ИсточникДанных.Операция;
		КонецЕсли;
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
		
	КонецЕсли;
	
	Если ИсточникДанных.Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезСУЗ") Тогда
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП  = Истина;
		ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП = Истина;
	КонецЕсли;
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Перемаркировка ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования).
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
Процедура ЗаполнитьПараметрыСканированияПеремаркировкаТоваров(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "Товары";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "КодМаркировки, НовыйКодМаркировки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ТолькоМаркируемаяПродукция = Истина;
	
	ПараметрыСканирования.Организация = ИсточникДанных.Организация;
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Перемаркировка");
	
	ПараметрыСканирования.ИндивидуализироватьКИЗ = ИсточникДанных.ТребуетсяИндивидуализацияКИЗ;
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Уведомление об отгрузке маркированных товаровИСМП ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования).
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
Процедура ЗаполнитьПараметрыСканированияОтгрузкаТоваровИСМП(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	Операция      = ИсточникДанных.Операция;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ") Тогда
		ПараметрыСканирования.ДопустимыйСпособВводаВОборот = СпособВводаВОборотСУЗПоВидуОперации(Операция, ВидыПродукции);
	КонецЕсли;
	
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
	
	Если ЗначениеЗаполнено(ИсточникДанных.ДатаОтгрузки) Тогда
		ПараметрыСканирования.ДатаДокумента = ИсточникДанных.ДатаОтгрузки;
	Иначе
		ПараметрыСканирования.ДатаДокумента = ИсточникДанных.Дата;
	КонецЕсли;
	
	ПараметрыСканирования.ВозможнаЗагрузкаТСД = Истина;
	ПараметрыСканирования.Организация         = ИсточникДанных.Организация;
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = Операция;
	
	Если Не ЗначениеЗаполнено(ВидыПродукции) И КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(
		ПараметрыСканирования.ДопустимыеВидыПродукции)
		Или КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции) Тогда
		ПараметрыСканирования.КонтролироватьОкончаниеСрокаГодности = Истина;
	КонецЕсли;
	
	Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции,, Операция) Тогда
		ПараметрыСканирования.ЗаполнятьСрокГодности = Истина;
	КонецЕсли;
	
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки = (Операция <> ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ"));
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Уведомление об отгрузке маркированных товаровИСМП ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - (См. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования).
Процедура ЗаполнитьПараметрыСканированияПриемкаТоваровИСМП(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	Операция      = ИсточникДанных.Операция;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Истина);
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки"));
	
	ПараметрыСканирования.СопоставлятьНоменклатуру  = (Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ"));
	ПараметрыСканирования.СоздаватьШтрихкодУпаковки = Ложь;
	ПараметрыСканирования.СсылкаНаОбъект            = Неопределено;
	
	Если ИнтеграцияИСМПСлужебныйКлиентСервер.ЭтоПриемкаИзСтранЕАЭС(Операция) Тогда
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	КонецЕсли;
	
	Если КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции,, Операция) Тогда
		ПараметрыСканирования.ЗаполнятьСрокГодности = Истина;
	КонецЕсли;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП                   = Операция;
	ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет = (Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ"));
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры


// Дополняются свойства параметров сканирования и заполняются значения для документа "Возврат в оборот ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
Процедура ЗаполнитьПараметрыСканированияВозвратаВОборот(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "Товары";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "КодМаркировки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ТолькоМаркируемаяПродукция = Истина;
	
	ПараметрыСканирования.Организация = ИсточникДанных.Организация;
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС"));
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Отчет ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - См. ШтрихкодированиеИСКлиент.ПараметрыСканирования.
Процедура ЗаполнитьПараметрыСканированияОтчетИСМП(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок  = Неопределено;
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки          = Неопределено;
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.СоздаватьШтрихкодУпаковки           = Ложь;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция          = Истина;
	ПараметрыСканирования.КонтрольУникальностиКодовМаркировки = Ложь;
	ПараметрыСканирования.РазрешенаОбработкаБезУказанияМарки  = Истина;
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки   = Ложь;
	ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара  = Ложь;
	
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Ложь);
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Ложь);
	
	ПараметрыСканирования.Организация = ИсточникДанных.Организация;
	ПараметрыСканирования.Владелец    = Неопределено;
	ПараметрыСканирования.СозданиеНаборов = Ложь;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе");
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Заказ на эмиссию кодов маркировки СУЗ".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьПараметрыСканированияЗаказНаЭмиссиюКодовМаркировкиСУЗ(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок  = Неопределено;
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки          = Неопределено;
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.СоздаватьШтрихкодУпаковки           = Ложь;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция          = Истина;
	ПараметрыСканирования.КонтрольУникальностиКодовМаркировки = Ложь;
	ПараметрыСканирования.РазрешенаОбработкаБезУказанияМарки  = Истина;
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки   = Ложь;
	ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара  = Ложь;
	
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Ложь);
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Ложь);
	
	ПараметрыСканирования.Организация = ИсточникДанных.Организация;
	ПараметрыСканирования.Владелец    = Неопределено;
	ПараметрыСканирования.СозданиеНаборов = Истина;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки");
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для РМ "Проверка кодов маркировки".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
Процедура ЗаполнитьПараметрыСканированияПроверкаКодовМаркировки(Контекст, ПараметрыСканирования)
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования,, Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ДопустимыеВидыПродукции.Очистить();
	ПараметрыСканирования.РазрешенаОбработкаНеНайденныхЛогистическихУпаковок = Истина;
	ПараметрыСканирования.Владелец                                           = Неопределено;
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок                 = Неопределено;
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                                = Истина;
	ПараметрыСканирования.РазрешенаОбработкаКодовСПустойНоменклатурой        = Истина;
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции     = Истина;
	ПараметрыСканирования.СоздаватьШтрихкодУпаковки                          = Ложь;
	ПараметрыСканирования.СопоставлятьНоменклатуру                           = Ложь;
	ПараметрыСканирования.Организация                                        = Контекст.Организация;
	ПараметрыСканирования.ЗаполнятьСрокГодности                              = Истина;
	
	ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП = Истина;
	ПараметрыСканирования.ОпределениеВидаПродукцииИСМП   = Истина;
	ПараметрыСканирования.ЗаписыватьЛогЗапросовИСМП      = Истина;
	ПараметрыСканирования.ТребуетсяЧастичноеВыбытие      = Истина;
	ПараметрыСканирования.СозданиеНаборов                = Истина;
	
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеНеизвестныхУпаковокИСМП(ПараметрыСканирования, Истина);
	ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Истина);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Вывод из оборота ИСМП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС - Вид продукции ИС.
Процедура ЗаполнитьПараметрыСканированияУточнениеСведенийОКодахМаркировкиИСМП(Контекст, ПараметрыСканирования)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ИсточникДанных.ТоварнаяГруппа);
	Операция      = ИсточникДанных.Операция;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.КонтрольПустыхУпаковок               = Ложь;
	ПараметрыСканирования.ПоддерживаютсяОперацииАгрегации      = Ложь;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность = Ложь;
	
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	
	ПараметрыСканирования.ВозможнаЗагрузкаТСД = Истина;
	ПараметрыСканирования.Организация         = ИсточникДанных.Организация;
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику"));
	
	Если Операция <> ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД") Тогда
		ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
		ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(
			ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	КонецЕсли;
	
	Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ВидыПродукции) Тогда
		ИнтеграцияИСМПВЕТИСКлиентСервер.ДополнитьПараметрыСканированияУточнениеСведенийОКодах(Операция, ПараметрыСканирования);
		Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД") Тогда
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
			ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
				ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Списан"));
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП   = Ложь;
	ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП  = Ложь;
	
	Если (Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности")
		И КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоВидПродукцииСоСрокамиГодности(ВидыПродукции))
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД") Тогда
		ПараметрыСканирования.ЗаполнятьСрокГодности = Истина;
	КонецЕсли;
	
	Если Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес")
		Или Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтчетОПеревзвешивании") Тогда
		ПараметрыСканирования.ТолькоВесоваяПродукция             = Истина;
		ПараметрыСканирования.ЗапрашиватьКоличествоМерногоТовара = Истина;
		ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП    = Истина;
		ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП   = Истина;
	КонецЕсли;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = Операция;
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для регистра "Кеги на оборудовании розлива ИС МП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьПараметрыСканированияВскрытыеПотребительскиеУпаковки(Контекст, ПараметрыСканирования) Экспорт
	
	Если Контекст.ИмяПодсистемы <> "ИСМП" Тогда
		Возврат;
	КонецЕсли;
	
	Операция = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВскрытиеПотребительскойУпаковки");
	
	ВключенаПоддержкаИСМП = ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования);
	ВключенаПоддержкаМОТП = ШтрихкодированиеОбщегоНазначенияМОТПКлиентСервер.ВключитьПоддержкуТабачнойПродукции(ПараметрыСканирования,,, Операция);
	
	Если Не (ВключенаПоддержкаИСМП Или ВключенаПоддержкаМОТП) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ВидОперацииИСМП                                = Операция;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ПараметрыСканирования.СоздаватьШтрихкодУпаковки                      = Истина;
	ПараметрыСканирования.ТребоватьПолныйКодМаркировкиИСМП               = Истина;
	ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП                = Истина;
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки              = Истина;

	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(
		ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива"));
	
	ПараметрыСканирования.ДопустимыеВидыПродукции = Новый Массив(
		ИнтеграцияИСКлиентСерверПовтИсп.ВидыПродукцииИспользующиеВскрытыеПотребительскихУпаковок(Истина, Ложь, Ложь));
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоддерживающиеЧастичноеВыбытие();
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

// Дополняются свойства параметров сканирования и заполняются значения для документа "Перемещение между МОД ИС МП".
//
// Параметры:
//  Контекст - ФормаКлиентскогоПриложения, ДокументСсылка, СправочникСсылка - Контекст.
//  ПараметрыСканирования - Структура - (См. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования).
Процедура ЗаполнитьПараметрыСканированияПеремещениеМеждуМОД_ИСМП(Контекст, ПараметрыСканирования) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
	Иначе
		ИсточникДанных = Контекст;
	КонецЕсли;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок  = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки          = "ШтрихкодУпаковки";
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ДоступнаПечатьЭтикеток                         = Ложь;
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность           = Ложь;
	ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП                = Истина;
	
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                            = Истина;
	
	ПараметрыСканирования.ДокументОснование = ИсточникДанных.ДокументОснование;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ПеремещениеМеждуМОД");
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборот"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате"));
	
	ПараметрыСканирования.ПоддерживаетсяОбъемноСортовойУчет  = Истина;
	ПараметрыСканирования.ДопустимыеВидыПродукции            = КонструкторИСМПКлиентСервер.ВидыПродукцииВнутреннегоПеремещенияМеждуМОД();
	
	ПараметрыСканирования.РазрешеноЗапрашиватьКодМаркировки = Ложь;
	
	ВидыПродукции = КонструкторИСМПКлиентСервер.ВидыПродукцииВнутреннегоПеремещенияМеждуМОД();
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

#Область ПроизводствоМаркировкаПива

Процедура ЗаполнитьПараметрыСканированияОтчетОбИмпортеЕГАИС(ПараметрыСканирования, Контекст)
	
	//Форма
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
		Организация = Контекст.Организация;
	//Ссылка
	ИначеЕсли ТипЗнч(Контекст) = Тип("ДокументСсылка.ОтчетОбИмпортеЕГАИС") Тогда
		ИсточникДанных = ШтрихкодированиеИСМПВызовСервера.РеквизитыИсточникаДанныхПараметровСканирования(Контекст);
		Организация = ИсточникДанных.Организация;
	//Объект
	Иначе
		ИсточникДанных = Контекст;
		Организация = Неопределено;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМПЕГАИС();
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	ПараметрыСканирования.ДоступнаПечатьЭтикеток                         = Ложь;
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность           = Ложь;
	ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП                = Истина;
	
	ПараметрыСканирования.КонтрольРасхожденийСДокументомОснованием       = Истина;
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                            = Истина;
	
	ПараметрыСканирования.Организация       = Организация;
	ПараметрыСканирования.Владелец          = Организация;
	ПараметрыСканирования.ДокументОснование = ИсточникДанных.ДокументОснование;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля");
	
	ПараметрыСканирования.ДопустимыйСпособВводаВОборот = СпособВводаВОборотСУЗПоВидуОперации(ПараметрыСканирования.ВидОперацииИСМП, ВидыПродукции);
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСканированияОтчетОПроизводствеЕГАИС(ПараметрыСканирования, Контекст)
	
	Если ПараметрыСканирования.Сценарий = 1 Тогда
		Возврат;
	КонецЕсли;
	
	//Форма
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Объект") Тогда
		ИсточникДанных = Контекст.Объект;
		Организация = Контекст.Организация;
	//Ссылка
	ИначеЕсли ТипЗнч(Контекст) = Тип("ДокументСсылка.ОтчетОПроизводствеЕГАИС") Тогда
		ИсточникДанных = ШтрихкодированиеИСМПВызовСервера.РеквизитыИсточникаДанныхПараметровСканирования(Контекст);
		Организация = ИсточникДанных.Организация;
	//Объект
	Иначе
		ИсточникДанных = Контекст;
		Организация = Неопределено;
	КонецЕсли;
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМПЕГАИС();
	
	Если Не ВключитьПоддержкуПродукцииИСМП(ПараметрыСканирования, ВидыПродукции) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки         = "ШтрихкодУпаковки";
	
	ПараметрыСканирования.ДоступнаПечатьЭтикеток                         = Ложь;
	ПараметрыСканирования.ИспользуютсяДанныеВыбораПоМаркируемойПродукции = Истина;
	ПараметрыСканирования.ТолькоМаркируемаяПродукция                     = Истина;
	ПараметрыСканирования.КонтролироватьСтандартнуюВложенность           = Ложь;
	ПараметрыСканирования.СохранятьКодыМаркировкиВПулИСМП                = Истина;
	
	ПараметрыСканирования.КонтрольРасхожденийСДокументомОснованием       = Истина;
	ПараметрыСканирования.ВозможнаЗагрузкаТСД                            = Истина;
	
	ПараметрыСканирования.Организация       = Организация;
	ПараметрыСканирования.Владелец          = Организация;
	ПараметрыСканирования.ДокументОснование = ИсточникДанных.ДокументОснование;
	
	// Для обогащения информации об ошибке при выводе пользователю
	ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ");
	
	ПараметрыСканирования.ДопустимыйСпособВводаВОборот = СпособВводаВОборотСУЗПоВидуОперации(ПараметрыСканирования.ВидОперацииИСМП, ВидыПродукции);
	
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	ПараметрыСканирования.ДопустимыеСтатусыИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен"));
	ПараметрыСканирования.ДопустимыеСтатусыУпаковокИСМП.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Эмитирован"));
	
	НастроитьПараметрыСканированияПоРаздельномуКонтролю(ПараметрыСканирования, ВидыПродукции);
	
КонецПроцедуры

Функция ТекущаяДатаСУчетомКонтекста()
	
	// АПК:547-выкл. код обусловлен необходимостью вызова ТекущаяДатаСеанса()
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли
	// АПК:547-вкл.
	
КонецФункции

#КонецОбласти

#КонецОбласти

Функция РазрешеноЗапрашиватьСтатусыКодовЕАЭС(ПараметрыСканирования) Экспорт
	
	Если ПараметрыСканирования = Неопределено Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа")
			Или ПараметрыСканирования.ЭтоПроверкаКодовМаркировкиИСМП;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
