// идет на сервер, качает оттуда XML с PARTIN, парсит, возвращает.
Функция ПолучитьСтруктуруДанныхТорговойСети(КодСети) Экспорт
	
	Результат = ПолучитьФайл_EDI("/1c/nets/V2/" + КодСети + ".zip");
	
	Если Результат = Неопределено Тогда 
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения("Не удалось загрузить описание " + ?(КодСети = "list", "списка сетей", "сети """ + КодСети + """") + " с сервера. 
		|Возможные проблемы: отсутствует соединение с сервером или файл на сервере.");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(ОписаниеОшибки());
		
		Возврат Неопределено;
	КонецЕсли;
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
	СоздатьКаталог(ВременныйКаталог);
	
	Попытка
		ЧтениеZipФайла = Новый ЧтениеZipФайла(Результат.ОткрытьПотокДляЧтения());
		ЧтениеZipФайла.ИзвлечьВсе(ВременныйКаталог);
		ЧтениеZipФайла.Закрыть();
	Исключение
		Ошибка			= ИнформацияОбОшибке();
		ПодробнаяОшибка	= ПодробноеПредставлениеОшибки(Ошибка);
		Сообщить(ПодробнаяОшибка);
	КонецПопытки;
	
	ДанныеПоТС = ПрочитатьДанныеПоТорговойСети(ВременныйКаталог + КодСети + ".xml");
	
	УдалитьВременныйКаталог(ВременныйКаталог);
	
	Возврат ДанныеПоТС;
	
КонецФункции

Процедура УдалитьВременныйКаталог(ВременныйКаталог) 
	
	Попытка	
		
		Файлы = НайтиФайлы(ВременныйКаталог, "*", Истина);
		Для каждого ВыбФайл Из Файлы Цикл 
			Если ВыбФайл.ПолучитьТолькоЧтение() Тогда
				ВыбФайл.УстановитьТолькоЧтение(Ложь);
			КонецЕсли;	                           
		КонецЦикла;
		УдалитьФайлы(ВременныйКаталог);
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьФайл_EDI(ИмяФайла) 
	
	Перем Сервер;
	
	Сервер = "edi.kontur.ru";
	
	Попытка 
		Возврат HTTP_GetFile(Сервер, ИмяФайла);
	Исключение
		
	КонецПопытки;
	
КонецФункции

Функция HTTP_GetFile(СерверХост, ПутьКФайлуНаСервере)
	
	ПараметрыЗапроса = КонтурЛогистика_HTTPКоннекторКлиентСервер.ПараметрыHTTPЗапроса();
	ПараметрыЗапроса.Вставить("ТелоОтвета" , Новый Структура("ДвоичныеДанные"));
	ПараметрыЗапроса.Вставить("Таймаут"    , 0);
	ПараметрыЗапроса.Вставить("АдресМетода", ПреобразоватьКURL_КонтурEDI(ПутьКФайлуНаСервере));
	ПараметрыЗапроса.Вставить("ТелоОтветаКакДвоичныеДанные", Истина);
	ПараметрыЗапроса.Вставить("Заголовки", Новый Соответствие);
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика();
	ПараметрыСервиса.Вставить("АдресВебСервиса", СерверХост);
	
	НастройкиПрокси = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.НастройкиПрокси();
	
	Если НастройкиПрокси.ПроксиИспользовать Тогда
		
		Прокси = Новый Структура;
		Прокси.Вставить("host"		, НастройкиПрокси.АдресПроксиСервера + ":" + Формат(НастройкиПрокси.ПортПроксиСервера,"ЧГ=0"));
		Прокси.Вставить("username"  , НастройкиПрокси.ЛогинПроксиСервера);
		Прокси.Вставить("password"  , НастройкиПрокси.ПарольПроксиСервера);
		
		ПараметрыЗапроса.Вставить("Прокси", Прокси);
		
	КонецЕсли;
	
	Ответ = КонтурЛогистика_HTTPКоннекторКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыСервиса, ПараметрыЗапроса);
	
	Если ТипЗнч(Ответ.ТелоОтвета) = Тип("Структура") 
		Или Ответ.ТелоОтвета = Неопределено 
		Или Ответ.КодОтвета <> 200 Тогда
		
		Ответ.ТелоОтвета = Неопределено;
		
	КонецЕсли;
	
	Возврат Ответ.ТелоОтвета;
	
КонецФункции

Функция ПреобразоватьКURL_КонтурEDI(Стр)
	
	Длина = СтрДлина(Стр);
	Итог = "";
	
	Для Н = 1 По Длина Цикл
		
		Знак = Сред(Стр, Н, 1);
		Код  = КодСимвола(Знак);
		
		Если Знак = " " Тогда
			Итог = Итог + "%20";
		//ИначеЕсли Знак = "/" Тогда
		//	Итог = Итог + "%2F";
		ИначеЕсли Знак = "\" Тогда
			Итог = Итог + "%5C";
		ИначеЕсли ((Знак >= "a") И (Знак <= "z")) 
			ИЛИ	((Знак >= "A" ) И (Знак <= "Z")) 
			ИЛИ	((Знак >= "0" ) И (Знак <= "9")) Тогда
			
			Итог = Итог + Знак;
			
		Иначе
			
			Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(208, 16) + "%" + ПреобразоватьвСистему(144 + Код - КодСимвола("А"), 16);
				
			ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(128 + Код - КодСимвола("р"), 16);
				
			ИначеЕсли (Знак = "ё") Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(209, 16) + "%" + ПреобразоватьвСистему(145, 16);
				
			ИначеЕсли (Знак = "Ё") Тогда
				
				Итог = Итог + "%" + ПреобразоватьвСистему(208, 16) + "%" + ПреобразоватьвСистему(129, 16);
				
			Иначе
				Итог = Итог + Знак;
			КонецЕсли;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Итог;
	
КонецФункции

Функция ПреобразоватьвСистему(Число10, Система)
	
	Если Система > 36 ИЛИ Система < 2 Тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 Цикл
		РезДеления 			= Число10 / Система;
		ЧислоСистема 		= Цел(РезДеления);
		ОстатокОтДеления 	= Число10 - Система * (ЧислоСистема);
		СтрокаСистема 		= Сред(СтрокаЗначений, ОстатокОтДеления + 1, 1) + СтрокаСистема;
		Число10 			= ?(ЧислоСистема = 0, 0, РезДеления); 
	КонецЦикла;
	
	Нечётное = СтрДлина(СтрокаСистема) - Цел(СтрДлина(СтрокаСистема) / 2) * 2;
	Если Нечётное Тогда
		СтрокаСистема = "0" + СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
	
КонецФункции

Функция ПрочитатьДанныеПоТорговойСети(ПутьКФайлу)
	
	ЗагружаетсяСписокСетей = Ложь;
	Если Прав(ПутьКФайлу, 8) = "list.xml" Тогда 
		ЗагружаетсяСписокСетей = Истина;
	КонецЕсли;
	
	Если ЗагружаетсяСписокСетей Тогда
		
		СтруктураТС = Новый Структура("Сети");

		ТаблицаСетей = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаСетей, "Код,Наименование,GLN,Подключена,ДатаОбновления,НастройкиПоУмолчанию");//,ТребуемыеВерсии - пока не трогаем

	Иначе
		
		СтруктураТС = Новый Структура("GLN,Подразделения,ЮрФизЛица,ТочкиДоставки,НастройкиПоУмолчанию");
	
		ТаблицаПодразделений = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаПодразделений, "id,GLN,Наименование");
		
		ТаблицаЮрФизЛиц = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаЮрФизЛиц, "id,GLN,Наименование,ИНН,КПП,id_Подразделения");
		
		ТаблицаТочекДоставки = Новый ТаблицаЗначений;
		
		КС = Новый КвалификаторыСтроки(1000);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТиповСтрока = Новый ОписаниеТипов(Массив, , КС);

		ДобавитьКолонкиВТаблицуЗначений(ТаблицаТочекДоставки, "id,GLN,КодРегиона,Наименование,Адрес,id_ЮрФизЛица,id_Подразделения,Индекс,ТипЛокализации,ПолныйАдрес", ОписаниеТиповСтрока);
		
		ТаблицаНастроекПоУмолчанию = Новый ТаблицаЗначений;
		ДобавитьКолонкиВТаблицуЗначений(ТаблицаНастроекПоУмолчанию, "ИмяНастройки,Значение");
		
	КонецЕсли;

	// получаем объект XDTO из XML
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПутьКФайлу);
	
	ФабрикаXDTO_PARTIN = ФабрикаXDTO_PARTIN();
	
	СтруктураТиповФабрики = ПолучитьСтруктуруТиповФабрики(ФабрикаXDTO_PARTIN);
	
	ТипДанных = ?(ЗагружаетсяСписокСетей, СтруктураТиповФабрики.organizationList, СтруктураТиповФабрики.company);
	Данные = ФабрикаXDTO_PARTIN.ПрочитатьXML(Чтение, ТипДанных);
	
	Чтение.Закрыть();
	
	Если ЗагружаетсяСписокСетей Тогда
		
		Для Каждого ОписаниеОрганизации Из Данные.org Цикл
			
			НоваяСтрока = ТаблицаСетей.Добавить();
			
			НоваяСтрока.GLN						= ОписаниеОрганизации.gln;
			НоваяСтрока.Код						= ОписаниеОрганизации.code;
			НоваяСтрока.Наименование			= ОписаниеОрганизации.name;
			НоваяСтрока.ДатаОбновления			= ОписаниеОрганизации.dateUpd;
//			НоваяСтрока.НастройкиПоУмолчанию	= ОписаниеОрганизации.default1Csettings.SettingsItem;//пока не используем
			
		КонецЦикла;
		
		СтруктураТС.Сети			= ТаблицаСетей;

	Иначе //грузим отдельную сеть
		
		СтруктураТС.GLN				= Данные.gln;
		
		Для Каждого ОписаниеОрганизации Из Данные.org Цикл

			НоваяСтрока = ТаблицаЮрФизЛиц.Добавить();
			
			НоваяСтрока.GLN				= ОписаниеОрганизации.gln;
			НоваяСтрока.Наименование	= ОписаниеОрганизации.name;
			НоваяСтрока.ИНН				= ОписаниеОрганизации.inn;
			НоваяСтрока.КПП				= ОписаниеОрганизации.kpp;
			
		КонецЦикла;
		
		Для Каждого ОписаниеТочкиДоставки Из Данные.DP Цикл

			НоваяСтрока = ТаблицаТочекДоставки.Добавить();
			
			НоваяСтрока.GLN				= ОписаниеТочкиДоставки.gln;
			НоваяСтрока.Наименование	= ОписаниеТочкиДоставки.name;
			НоваяСтрока.КодРегиона		= ОписаниеТочкиДоставки.region;
			НоваяСтрока.Адрес			= ОписаниеТочкиДоставки.address;
			НоваяСтрока.Индекс			= ОписаниеТочкиДоставки.index;
			НоваяСтрока.ТипЛокализации  = ОписаниеТочкиДоставки.localizationType;
			НоваяСтрока.ПолныйАдрес 	= ОписаниеТочкиДоставки.index + ", " + ОписаниеТочкиДоставки.address;
			
		КонецЦикла;
		
		// настройки EDI нас на тек момент не интересуют не интересуют
		
		//ИдентификаторыНастроекСообщений = ПолучитьСтруктуруИдентификаторовНастроекСообщений();
		//
		//Для Каждого НастройкаПоУмолчанию Из Данные.default1Csettings.settingsItem Цикл
		//	
		//	НоваяСтрока = ТаблицаНастроекПоУмолчанию.Добавить();
		//	
		//	НоваяСтрока.ИмяНастройки = НастройкаПоУмолчанию.name;
		//	
		//	Если ПеременнаяСодержитСвойство(ИдентификаторыНастроекСообщений.Поставщик, НастройкаПоУмолчанию.name) Тогда     
		//		НоваяСтрока.ИмяНастройки = ИдентификаторыНастроекСообщений.Поставщик[НастройкаПоУмолчанию.name];				
		//	КонецЕсли;
		//	
		//	НоваяСтрока.Значение = НастройкаПоУмолчанию.value;
		//	
		//КонецЦикла;

		СтруктураТС.Подразделения			= ТаблицаПодразделений;
		СтруктураТС.ЮрФизЛица				= ТаблицаЮрФизЛиц;
		СтруктураТС.ТочкиДоставки			= ТаблицаТочекДоставки;
		СтруктураТС.НастройкиПоУмолчанию	= ТаблицаНастроекПоУмолчанию;
		
	КонецЕсли;
	
	Возврат СтруктураТС;
	
КонецФункции

Функция ПолучитьСтруктуруТиповФабрики(ФабрикаXDTO_EdiXml)
	
	СтруктураТипов = Новый Структура;
	
	Для Каждого Пакет Из ФабрикаXDTO_EdiXml.Пакеты Цикл
		Если Найти(ВРЕГ(Пакет.URIПространстваИмен),".KONTUR.RU")>0 Тогда //берем только наши фабрики
			Для Сч=0 По Пакет.Количество()-1 Цикл
				Свойство = Пакет.Получить(Сч);
				СтруктураТипов.Вставить(Свойство.Имя,Свойство);
			КонецЦикла;	
			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СтруктураТипов;
	
КонецФункции	

Функция ФабрикаXDTO_PARTIN()
		
	ФайлСхемы = ПолучитьИмяВременногоФайла("xsd");
	ПолучитьОбщийМакет("КонтурЛогистика_ИнтеграцияEDI_СхемыPARTIN").Записать(ФайлСхемы);
	Результат = СоздатьФабрикуXDTO(ФайлСхемы);
	УдалитьФайлы(ФайлСхемы);
	
	Возврат Результат;
	
КонецФункции

//Добавляет Колонки в Таблица.
//В Колонки допускается массив, Строка с разделителями "," или Символы.ПС
Процедура ДобавитьКолонкиВТаблицуЗначений(Таблица,Колонки,ОписаниеТипов = Неопределено)
	
	Если ТипЗнч(Колонки) = Тип("Массив") Тогда
		МассивИменКолонок = Колонки;
	Иначе
		МассивИменКолонок = EDI_РазложитьСтрокуВМассивСлов(Колонки,",;");
	КонецЕсли;
	
	НеобходимоТипизировать = ТипЗнч(ОписаниеТипов) = Тип("ОписаниеТипов");
	МассивНеТипизированныхКолонок = Новый Массив;
	
	Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
		
		Колонка = Таблица.Колонки.Найти(ИмяКолонки);
		
		Если Колонка = Неопределено Тогда
			Колонка = Таблица.Колонки.Добавить(ИмяКолонки,ОписаниеТипов);
		КонецЕсли;	
		
		Если НеобходимоТипизировать Тогда
			
			Если ОписаниеТипов.КвалификаторыСтроки.Длина <> 0
				И Колонка.ТипЗначения.КвалификаторыСтроки.Длина >= ОписаниеТипов.КвалификаторыСтроки.Длина Тогда
				
				МассивНеТипизированныхКолонок.Добавить(ИмяКолонки);
				
			Иначе
				
				Для Каждого ЭлементТип Из ОписаниеТипов.Типы() Цикл
					
					Если НЕ Колонка.ТипЗначения.СодержитТип(ЭлементТип) Тогда
						МассивНеТипизированныхКолонок.Добавить(ИмяКолонки);
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если НеобходимоТипизировать И МассивНеТипизированныхКолонок.Количество() > 0 Тогда
		
		Для Каждого НеТипизированнаяКолонка Из МассивНеТипизированныхКолонок Цикл
			
			ТипизироватьКолонкиВТаблицеЗначений(Таблица, НеТипизированнаяКолонка, ОписаниеТипов);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТипизироватьКолонкиВТаблицеЗначений(ТаблицаЗначений, ИмяКолонокДляТипизации, ОписаниеТипов)
		
	ИмяКолонокДляТипизации =  СтрЗаменить(ИмяКолонокДляТипизации, ",", Символы.ПС);
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(ИмяКолонокДляТипизации) Цикл
		
		ИмяКолонкиДляТипизации = СтрПолучитьСтроку(ИмяКолонокДляТипизации, НомерСтроки); 		
		ИмяКолонкиТипизированная = ИмяКолонкиДляТипизации + "_Типизированная"; 
		
		Колонка = ТаблицаЗначений.Колонки.Найти(ИмяКолонкиДляТипизации);
		
		Если Колонка = Неопределено Тогда
			
			Колонка = ТаблицаЗначений.Колонки.Добавить(ИмяКолонкиДляТипизации,ОписаниеТипов);
						
		Иначе
			
			Колонка = ТаблицаЗначений.Колонки.Добавить(ИмяКолонкиТипизированная,ОписаниеТипов);
									
			ТаблицаЗначений.ЗагрузитьКолонку(ТаблицаЗначений.ВыгрузитьКолонку(ИмяКолонкиДляТипизации), ИмяКолонкиТипизированная);
			
			ТаблицаЗначений.Колонки.Удалить(ИмяКолонкиДляТипизации);
			
			ТаблицаЗначений.Колонки.Найти(ИмяКолонкиТипизированная).Имя = ИмяКолонкиДляТипизации; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Разбивает строку на несколько строк, используя заданный набор разделителей.
//
// Параметры:
//  Строка          - Строка - строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - строка, содержащая символы-разделители.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - отдельные слова
//
// Пример:
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "-") возвратит массив значений: "один", "@#два2_!три";
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив значений: "один-", "два2", "три".
//
Функция EDI_РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов="", РазделительКакЕдиныйСимвол = Ложь)
	
	Слова = Новый Массив;
	
	ДлинаРазделителя = СтрДлина(РазделителиСлов);
	
	Если ДлинаРазделителя = 1 ИЛИ РазделительКакЕдиныйСимвол Тогда
		
		НайденныйСимвол = Найти(Строка,РазделителиСлов);
		Пока НайденныйСимвол>0 Цикл
			Слова.Добавить(СокрЛП(Лев(Строка,НайденныйСимвол + ДлинаРазделителя - 2)));
			Строка = Сред(Строка,НайденныйСимвол + ДлинаРазделителя);
			НайденныйСимвол = Найти(Строка,РазделителиСлов);
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Строка) Тогда
			Слова.Добавить(СокрЛП(Строка));
		КонецЕсли;
		
	Иначе
		
		Для Сч = 1 По СтрДлина(РазделителиСлов) Цикл
			Строка = СтрЗаменить(Строка,Сред(РазделителиСлов,Сч,1),Символы.ПС);
		КонецЦикла;
		
		Для Сч=1 По СтрЧислоСтрок(Строка) Цикл
			ТекСлово = СокрЛП(СтрПолучитьСтроку(Строка,Сч));
			Если ТекСлово<>"" Тогда
				Слова.Добавить(СокрЛП(ТекСлово));
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

Функция ПеременнаяСодержитСвойство(Переменная, ИмяСвойства, Свойство = Неопределено, СвойствоЗаполнено = Ложь)
	
	GUIDПроверка = Новый УникальныйИдентификатор;
	
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить(ИмяСвойства, GUIDПроверка);
	
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Переменная);

	
	Если СтруктураПроверка[ИмяСвойства] = GUIDПроверка Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Свойство = Переменная[ИмяСвойства];
		
		Если СвойствоЗаполнено = Истина Тогда
			
			Возврат ЗначениеЗаполнено(Свойство);
				
		Иначе
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецФункции
