#Область СлужебныйПрограммныйИнтерфейс

#Область ПрограммныйИнтерфейс

// Функция проверяет, доступен ли отчет о нанесении для указанного вида продукции/товарной группы.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//                               Если не указано - проверяется наличие операции в конфигурации.
// 
// Возвращаемое значение:
//  Булево - Истина, если для вида продукции доступна операция отчета о нанесении
Функция ДоступенОтчетОНанесении(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтчетОНанесенииКодовМаркировки")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияОтчетОНанесенииКодовМаркировки"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

// Функция проверяет, подлежит ли товарная группа обязательной маркировке и вводу в оборот.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
// 
// Возвращаемое значение:
//  Булево - Истина, если товарная группа подлежит обязательной маркировке и вводу в оборот
Функция ТоварнаяГруппаПодлежитВводуВОборот(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат
		МаркировкаТоваровКлиентСервер.ДоступноПроизводствоВнеЕАЭС(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияВводВОборотПроизводствоРФ(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступенИмпортСФТС(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияИмпортСФТСМех(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияПодтверждениеПоступленияКИЗ(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияВводВОборотПроизводствоРФПоДоговору(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступноПолучениеПродукцииОтФизическихЛиц(ВидПродукцииТоварнаяГруппа)
		Или МаркировкаТоваровКлиентСервер.ДоступнаОперацияВводВОборотТрансграничнаяТорговля(ВидПродукцииТоварнаяГруппа)
		Или КонструкторИСМПКлиентСервер.ВидПродукцииПодлежитМаркировкеОстатков(ВидПродукцииТоварнаяГруппа);
	
КонецФункции

#КонецОбласти

#Область ЭлементыКонструктораВидовПродукции

Функция ДоступноПолучениеПродукцииОтФизическихЛиц(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотТоваровПолученныхОтФизическихЛиц")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотТоваровПолученныхОтФизическихЛиц"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступенИмпортСФТС(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотИмпортСФТС")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотИмпортСФТС"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияИмпортСФТСМех(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотИмпортСФТСМех")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотИмпортСФТСМех"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотПроизводствоРФ(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФ")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФ"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотПроизводствоРФПоДоговору(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФПоДоговору")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФПоДоговору"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
			
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотТрансграничнаяТорговля(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотТрансграничнаяТорговля")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотТрансграничнаяТорговля"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступноПроизводствоВнеЕАЭС(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	ЭлементКонструктора = ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияВводВОборотПроизводствоВнеЕАЭС");
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Доступно = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ЭлементКонструктора).Количество();
		
	Иначе
		
		ВидыПродукции = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа);
		Доступно = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ЭлементКонструктора,
			ВидыПродукции);
		
		Если Доступно Тогда
			
			#Если Клиент Или ВебКлиент Или МобильноеПриложениеКлиент Или МобильныйКлиент Тогда
				ДатаСеанса = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
			#Иначе
				ДатаСеанса = НачалоДня(ТекущаяДатаСеанса());
			#КонецЕсли
			
			Если ТипЗнч(ВидыПродукции) = Тип("Массив") Тогда
				ВидыПродукцииПроверкиПоДате = ВидыПродукции;
			Иначе
				ВидыПродукцииПроверкиПоДате = Новый Массив;
				ВидыПродукцииПроверкиПоДате.Добавить(ВидыПродукции);
			КонецЕсли;
			
			ДоступноПоВидуПродукции = Ложь;
			Для Каждого ВидПродукции Из ВидыПродукцииПроверкиПоДате Цикл
				ДатаНачала = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначениеАтрибутаЭлементаКонструктора(
					"ДатаНачала", ЭлементКонструктора, ВидПродукции);
				ДатаОкончания = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначениеАтрибутаЭлементаКонструктора(
					"ДатаОкончания", ЭлементКонструктора, ВидПродукции);
				Если Не ЗначениеЗаполнено(ДатаНачала)
					Или Не ЗначениеЗаполнено(ДатаОкончания) Тогда
					ДоступноПоВидуПродукции = Истина;
					Прервать;
				ИначеЕсли ДатаСеанса > ДатаНачала
					И ДатаСеанса <= ДатаОкончания Тогда
					ДоступноПоВидуПродукции = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Доступно = ДоступноПоВидуПродукции;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Доступно;
	
КонецФункции

Функция ДоступнаОперацияПодтверждениеПоступленияКИЗ(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияПодтверждениеПоступленияКИЗ")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ОперацияПодтверждениеПоступленияКИЗ"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ВидыУпаковокДоступныеДляАгрегацииЧерезГИСМТ(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.АгрегацияЧерезГИСМТ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ВидыУпаковокДоступныеДляАгрегацииЧерезСУЗ(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.АгрегацияЧерезСУЗ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДопустимыеВидыУпаковокВнутриЛогистическойУпаковки(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДопустимыеВидыУпаковокВнутриЛогистическойУпаковки"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДопустимыеТипыШтрихкодовВнутриGS1(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДопустимыеТипыШтрихкодовВнутриGS1"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДопустимыеТипыШтрихкодовВнутриSSCC(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДопустимыеТипыШтрихкодовВнутриSSCC"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция КоличествоЗнаковТНВЭД(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Результат = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.КоличествоЗнаковТНВЭДДляПередачиГИСМТ"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
	Если Результат.Количество() = 0 Тогда
		Возврат 2;
	Иначе
		Возврат Результат[0];
	КонецЕсли;
	
КонецФункции

Функция ДоступнаМаркировкаОстатков(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатков")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатков"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступноПолноеОписаниеОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковПолноеОписание"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноУпрощенноеОписаниеОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковУпрощенноеОписание"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ЧастиКодовТНВЭДПоляВозрастнаяКатегорияДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковВозрастнаяКатегория"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеВозрастнаяКатегорияДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа, КодТНВЭД = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда
		ЧастиКодовТНВЭД = ЧастиКодовТНВЭДПоляВозрастнаяКатегорияДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа);
		Для Каждого ЧастьКодаТНВЭД Из ЧастиКодовТНВЭД Цикл
			Если СтрНачинаетсяС(КодТНВЭД, ЧастьКодаТНВЭД) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ДоступноПолеМодельДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковМодель"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеНаименованиеДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковНаименование"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеСпособВводаВОборотДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковСпособВводаВОборот"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеТоварныйЗнакДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковТоварныйЗнак"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеЦелевойПолДляМаркировкиОстатков(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.МаркировкаОстатковЦелевойПол"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ДоступноПолеИдентификаторПроизводственногоЗаказа(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторПроизводственногоЗаказа"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ВОтчетеОНанесенииИспользоватьОбъем(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОНанесенииИспользоватьОбъем"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ВОтчетеОНанесенииИспользоватьВес(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОНанесенииИспользоватьВес"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ВОтчетеОНанесенииПередаватьИНН(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОНанесенииПередаватьИНН"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ВОтчетеОНанесенииПередаватьКПП(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОНанесенииПередаватьКПП"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ПриВводеВОборотПередаватьКПП(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПриВводеВОборотПередаватьКПП"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

Функция ИмяПараметраГоденДо(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Значения = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ИмяПараметраГоденДо"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
	Если Значения.Количество() = 1 Тогда
		Возврат Значения[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДоступноПолеИдентификаторПроизводственнойЛинии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеИдентификаторПроизводственнойЛинии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Производственная площадка" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеПроизводственнаяПлощадкаВЕТИС(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводственнаяПлощадкаВЕТИС"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Производственная объект" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеПроизводственныйОбъект(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПроизводственныйОбъект"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Скоропортящаяся продукция" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеСкоропортящаясяПродукция(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.СкоропортящаясяПродукция"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Номер партии" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеНомерПартии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеНомерПартии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Номер серии" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеНомерСерии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеНомерСерии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Заводской серийный номер" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеЗаводскойСерийныйНомерВнутриКМ(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеЗаводскойСерийныйНомерВнутриКМ"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Сертификация" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеСертификация(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСертификация"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "GTIN" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеGTIN(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеGTIN"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Номер скважины" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеНомерСкважины(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеНомерСкважины"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Товарная группа ГИС МТ требует указание кода ФИАС в операциях нанесения КМ
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции требует указания кода ФИАС
Функция ДоступныКодыФИАС(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.КодыФИАС"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Вид продукции ИС МП с возможным, но необязательным указанием кода ФИАС в операциях нанесения КМ
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания кода ФИАС
Функция ПроверятьЗаполнениеКодовФИАС(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеКодовФИАС"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, требует ли поле "Номер серии" обязательного заполнения для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ПроверятьЗаполнениеПоляНомерСерии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляНомерСерии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, требует ли поле "Контрагент" обязательного заполнения для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ПроверятьЗаполнениеПоляКонтрагент(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКонтрагент"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Сумма" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеСумма(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСумма"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, требует ли поле "Сумма" обязательного заполнения для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ПроверятьЗаполнениеПоляСумма(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСумма"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляСуммаАкциза(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСуммаАкциза"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляТаможеннаяДекларация(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляТаможеннаяДекларация"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляПринятоеРешениеКодТаможенногоОргана(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПринятоеРешениеКодТаможенногоОргана"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляДатаИмпорта(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляДатаИмпорта"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляСтранаПроисхождения(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСтранаПроисхождения"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляСертификация(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСертификация"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляGLNОрганизации(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляGLNОрганизации"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляКодТНВЭД(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКодТНВЭД"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляНомерДатаПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляПервичныйДокументВТабличнойЧасти(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПервичныйДокументВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляСодержаниеЭтиловогоСпирта(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляСодержаниеЭтиловогоСпирта"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеНоменклатурыЕслиGTINНе029(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеНоменклатурыЕслиGTINНе029"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьЗаполнениеНоменклатурыЕслиНеЗаполненGTIN(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеНоменклатурыЕслиНеЗаполненGTIN"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Ставка НДС" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеСтавкаНДС(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСтавкаНДС"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Сумма акциза" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеСуммаАкциза(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСуммаАкциза"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Вид меха" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеВидМеха(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВидМеха"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Лицензия на пользование недрами" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеЛицензияНаПользованиеНедрами(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеЛицензияНаПользованиеНедрами"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Паспорт соответствия" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеПаспортСоответствия(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПаспортСоответствия"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "GLN организации" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступноПолеGLNОрганизации(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеGLNОрганизации"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Таможенная декларация" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - поле доступно
Функция ДоступноПолеТаможеннаяДекларация(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеТаможеннаяДекларация"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверяет, доступно ли поле "Принятое решение", "Код таможенного органа" для указанного вида продукции и операции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - поле доступно
Функция ДоступноПолеПринятоеРешениеКодТаможенногоОргана(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПринятоеРешениеКодТаможенногоОргана"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Функция проверят доступность отчета производственной линии для вида продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции не требует обязательного указания срока годности
Функция ДоступенОтчетПроизводственнойЛинии(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеОтчетПроизводственнойЛинии"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеПолеПредставлениеGTINОстатки(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПредставлениеGTINОстатки"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ПроверятьСоставУпаковокПоДаннымИСМП(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьСоставУпаковокПоДаннымИСМП"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеВариантВыполненияАгрегации(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВариантВыполненияАгрегации"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеТНВЭД(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеТНВЭД"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеВидПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеВидПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеНомерДатаПервичногоДокумента(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеНомерДатаПервичногоДокумента"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеПервичныйДокументВТабличнойЧасти(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПервичныйДокументВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеСодержаниеЭтиловогоСпирта(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСодержаниеЭтиловогоСпирта"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеКонтрагент(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеКонтрагент"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПолеСтранаПроисхождения(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеСтранаПроисхождения"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

// Вид продукции ИС МП требует указание даты производства в операциях нанесения КМ
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ - Товарная группа,
//                               СправочникСсылка.ВидыПродукцииИС - Вид продукции,
//                               Массив из СправочникСсылка.ВидыПродукцииИС.
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//           - Массив из ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Булево - вид продукции требует указания даты производства
Функция ДляТоварнойГруппыИспользуетсяДатаПроизводства(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДатаПроизводства"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДатаПроизводстваВСУЗСУказаниемЧасовогоПояса(ВидПродукцииТоварнаяГруппа, Операция = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДатаПроизводстваВСУЗСУказаниемЧасовогоПояса"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

#КонецОбласти

Функция ТекущаяОперацияПоДальнейшемуДействию(Операция, ОперацияНанесения, ДальнейшееДействие) Экспорт
	
	ТекущаяОперация = Операция;
	Если ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеОтчет")
		Или ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ПередайтеОтчетСИсправлениями") Тогда
		Если ЗначениеЗаполнено(ОперацияНанесения) Тогда
			ТекущаяОперация = ОперацияНанесения;
		КонецЕсли;
	ИначеЕсли ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ВыполнитеАгрегацию")
		Или ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ВыполнитеАгрегациюСИсправлениями") Тогда
		ТекущаяОперация = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.Агрегация");
	КонецЕсли;
	
	Возврат ТекущаяОперация;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотСырьяОстатки(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяОстатки")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяОстатки"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотСырьяПроизводствоРФ(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПроизводствоРФ")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПроизводствоРФ"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотСырьяПолучениеТовараИзЕАЭС(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПолучениеТовараИзЕАЭС")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПолучениеТовараИзЕАЭС"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаОперацияВводВОборотСырьяПолучениеТовараВнеЕАЭС(ВидПродукцииТоварнаяГруппа = Неопределено) Экспорт
	
	Если ВидПродукцииТоварнаяГруппа = Неопределено Тогда
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЭлементуКонструктора(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПолучениеТовараВнеЕАЭС")).Количество();
		
	Иначе
		
		Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВводВОборотСырьяПолучениеТовараВнеЕАЭС"),
			КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
		
	КонецЕсли;
	
КонецФункции

Функция ПриВводеВОборотПередаватьИдентификаторМОД(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПриВводеВОборотПередаватьИдентификаторМОД"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

#КонецОбласти
