#Область ПрограммныйИнтерфейс

Функция ИдетОбмен() Экспорт
	
	ТекстОшибки = "";
	Возврат ПараметрыПриложения["СтандартныеПодсистемы.ОбъектыУТКАУП.ИдентификаторФоновогоЗадания"] <> Неопределено
		И Не ОбменМобильныеАвтономныйСервер.ОбменДаннымиЗакончен(ПараметрыПриложения["СтандартныеПодсистемы.ОбъектыУТКАУП.ИдентификаторФоновогоЗадания"], ТекстОшибки);
	
КонецФункции

// Процедура выполняет синхронизацию данных
// - запрашивает у пользователя пароль доступа к основной ИБ
// - запускает фоновый процесс синхронизации
// - если не удалось запустить фоновое задание, получает текст ошибки и сообщает пользователю.
Процедура НачатьОбмен() Экспорт
	
#Если МобильныйКлиент Тогда
		
		Если Не ИдетОбмен() Тогда
			
			Если ОсновнойСерверДоступен() = Истина Тогда
				
				ПараметрыПриложения.Вставить("СтандартныеПодсистемы.ОбъектыУТКАУП.ИдентификаторФоновогоЗадания", ОбменМобильныеАвтономныйСервер.ВыполнитьОбменДаннымиВФоне());
				Оповестить("НачалсяОбмен");
				ПодключитьОбработчикОжидания("НаблюдениеЗаСинхронизацией", 2);
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru = 'Обмен невозможен. Недоступен основной сервер.'", "ru");
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
#КонецЕсли
	
КонецПроцедуры

Процедура ОтключитьОбработчикиОжидания() Экспорт
	
	ОтключитьОбработчикОжидания("КонтрольРежимаЗавершенияРаботыПользователей");
	ОтключитьОбработчикОжидания("ПредупредитьОПроблемах1СОтчетности");
	ОтключитьОбработчикОжидания("ПредупредитьОЗаявленияхЭДОПФР");
	ОтключитьОбработчикОжидания("ПредупредитьОНекорректныхСтатусахОтправки2НДФЛ");
	ОтключитьОбработчикОжидания("ПредупредитьОбАстралМ");
	ОтключитьОбработчикОжидания("ОтправкаБухОтчетовВСПАРК");
	ОтключитьОбработчикОжидания("ПоказатьПредупреждениеСПАРК");
	ОтключитьОбработчикОжидания("ОбработатьИзменившиесяКодыФСГС");
	ОтключитьОбработчикОжидания("ПолучитьИнформациюОВходящихСообщенияхДляПользователяЭДО");
	ОтключитьОбработчикОжидания("ПредупредитьОКонфликтеКриптопровайдеров");
	
КонецПроцедуры

// Процедура запускает фоновый процесс создания узла плана обмена Мобильные для автономной конфигурации
Процедура СоздатьУзелОбмена() Экспорт
	
	ПараметрыПриложения.Вставить("СтандартныеПодсистемы.ОбъектыУТКАУП.ИдентификаторФоновогоЗадания", ОбменМобильныеАвтономныйСервер.СоздатьУзелОбменаВФоне());
	
КонецПроцедуры

// Функция получает узел плана обмена Мобильные автономной конфигурации для текущего сеанса
// Возвращаемое значение:
//  Строка - Код узла плана обмена
//
Функция ТекущийУзел() Экспорт
	
	Возврат ОбменМобильныеАвтономныйСервер.ТекущийУзел();
	
КонецФункции

#КонецОбласти