#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КассовыеЧекиДата.Формат = Обработки.КассовыйЧекРаспознаваниеДокументов.ФорматнаяСтрокаДатаПокупки();
	УстановитьОтборСпискаЧековПоСтатусам(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(КассовыеЧеки, "ПодотчетноеЛицо",
		Параметры.ПодотчетноеЛицо, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.ПодотчетноеЛицо),
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКассовыеЧеки

&НаКлиенте
Процедура КассовыеЧекиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("Массив") Тогда
		ВыделенныеСтроки = ВыбраннаяСтрока;
	Иначе
		ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбраннаяСтрока);
	КонецЕсли;
	
	Загрузить(ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КассовыеЧекиПриАктивизацииСтроки(Элемент)
	
	ОтобразитьПредварительныйПросмотр(Элементы.КассовыеЧеки.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	Загрузить(Элементы.КассовыеЧеки.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбработанные(Команда)
	
	ПоказыватьОбработанные = Не ПоказыватьОбработанные;
	УстановитьОтборСпискаЧековПоСтатусам(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПредварительныйПросмотр

&НаКлиенте
Процедура ОтобразитьПредварительныйПросмотр(ДанныеСтроки)
	
	Если ДанныеСтроки = Неопределено Тогда
		ПредварительныйПросмотр = "";
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПредварительныйПросмотр", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПредварительныйПросмотр()
	
	ДанныеСтроки = Элементы.КассовыеЧеки.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредварительныйПросмотр = ПредварительныйПросмотрЧека(ДанныеСтроки.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредварительныйПросмотрЧека(Знач Ссылка)
	
	Возврат Обработки.КассовыйЧекРаспознаваниеДокументов.ПредварительныйПросмотрЧека(Ссылка);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСпискаЧековПоСтатусам(Форма)

	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(2);
	Если Форма.ПоказыватьОбработанные Тогда
		СписокСтатусов.Добавить(4);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.КассовыеЧеки, "Статус", СписокСтатусов,
		ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоСтатусам", Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
	Форма.Элементы.ПоказатьОбработанные.Пометка = Форма.ПоказыватьОбработанные;
	
КонецПроцедуры

#КонецОбласти

#Область РезультатРаботы

&НаКлиенте
Процедура Загрузить(ВыделенныеСтроки)
	
	ВыбранныеЧеки = Новый Массив;
	Для Каждого Чек Из ВыделенныеСтроки Цикл
		Если Чек = Неопределено Тогда
			// В версии платформы 8.3.15.1830 в веб-клиенте ВыделенныеСтроки может содержать значение Неопределено
			Продолжить;
		КонецЕсли;
		ВыбранныеЧеки.Добавить(Чек);
	КонецЦикла;
	
	Адрес = ДанныеКассовыхЧеков(ВыбранныеЧеки, ВладелецФормы.УникальныйИдентификатор);
	
	Закрыть(Адрес);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеКассовыхЧеков(Знач Чеки, Знач УникальныйИдентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаспознанныеДокумент.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ втРаспознанныеДокументы
	|ИЗ
	|	Документ.РаспознанныйДокумент КАК РаспознанныеДокумент
	|ГДЕ
	|	РаспознанныеДокумент.Ссылка В(&Чеки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРаспознанныеДокументы.Ссылка КАК РаспознанныйДокумент,
	|	РеквизитНомерДокумента.Значение КАК НомерВходящегоДокумента,
	|	РеквизитДатаДокумента.Значение КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(РеквизитДоговор.Значение КАК Справочник.ДоговорыКонтрагентов).СтатьяДвиженияДенежныхСредств, ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)) КАК СтатьяДвиженияДенежныхСредств
	|ПОМЕСТИТЬ втЧеки
	|ИЗ
	|	втРаспознанныеДокументы КАК втРаспознанныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыДокумента КАК РеквизитНомерДокумента
	|		ПО втРаспознанныеДокументы.Ссылка = РеквизитНомерДокумента.Ссылка
	|			И (РеквизитНомерДокумента.ИмяРеквизита = ""НомерДокумента"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыДокумента КАК РеквизитДатаДокумента
	|		ПО втРаспознанныеДокументы.Ссылка = РеквизитДатаДокумента.Ссылка
	|			И (РеквизитДатаДокумента.ИмяРеквизита = ""ДатаДокумента"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыДокумента КАК РеквизитДоговор
	|		ПО втРаспознанныеДокументы.Ссылка = РеквизитДоговор.Ссылка
	|			И (РеквизитДоговор.ИмяРеквизита = ""Договор"")
	|ГДЕ
	|	втРаспознанныеДокументы.Ссылка В(&Чеки)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспознанныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЧеки.РаспознанныйДокумент КАК РаспознанныйДокумент,
	|	втЧеки.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	втЧеки.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	втЧеки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	втЧеки КАК втЧеки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втЧеки.РаспознанныйДокумент КАК РаспознанныйДокумент,
	|	РаспознанныйДокументРеквизитыТабличныхЧастей.СтрокаУдалена КАК СтрокаУдалена,
	|	РаспознанныйДокументРеквизитыТабличныхЧастей.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	|	РаспознанныйДокументРеквизитыТабличныхЧастей.ПорядокСтроки КАК ПорядокСтроки,
	|	РаспознанныйДокументРеквизитыТабличныхЧастей.ИмяРеквизита КАК ИмяРеквизита,
	|	РаспознанныйДокументРеквизитыТабличныхЧастей.Значение КАК Значение
	|ИЗ
	|	втЧеки КАК втЧеки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспознанныйДокумент.РеквизитыТабличныхЧастей КАК РаспознанныйДокументРеквизитыТабличныхЧастей
	|		ПО втЧеки.РаспознанныйДокумент = РаспознанныйДокументРеквизитыТабличныхЧастей.Ссылка
	|ИТОГИ ПО
	|	РаспознанныйДокумент";
	
	Запрос.УстановитьПараметр("Чеки", Чеки);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЗначенияРеквизитов = РезультатЗапроса[2].Выгрузить();
	ВыборкаСсылка = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Данные = Новый СписокЗначений;
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		НоваяТаблица = НоваяТаблицаДанных(РезультатЗапроса[3].Колонки);
	
		Выборка = ВыборкаСсылка.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
		ЗаполненнаяТаблица = РаспознаваниеДокументовСлужебный.ЗаполненнаяТаблицаДокумента(
			Новый Структура("РеквизитыТабличныхЧастей", НоваяТаблица));
		
		ДополнительныеДанные = Обработки.КассовыйЧекРаспознаваниеДокументов.ДополнительныеДанныеТаблицыТоваров();
		РеквизитыРаспознанногоДокумента = ЗначенияРеквизитов.Найти(ВыборкаСсылка.РаспознанныйДокумент,
			"РаспознанныйДокумент");
		ЗаполнитьЗначенияСвойств(ДополнительныеДанные, РеквизитыРаспознанногоДокумента);
		
		Обработки.КассовыйЧекРаспознаваниеДокументов.ЗаполнитьДанныеТаблицыТоваров(ЗаполненнаяТаблица, Данные,
			ДополнительныеДанные);
			
	КонецЦикла;
	
	Адрес = ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	
	Возврат Адрес;
	
КонецФункции

&НаСервереБезКонтекста
Функция НоваяТаблицаДанных(Колонки)

	НоваяТаблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из Колонки Цикл
		Если Колонка.Имя = "РаспознанныйДокумент" Или Колонка.Имя = "КассовыйЧек" Тогда
			Продолжить;
		КонецЕсли;
		НоваяТаблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Возврат НоваяТаблица;

КонецФункции

#КонецОбласти

#КонецОбласти
