Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= УКЭП Тогда 
		Результат = "1";
	ИначеЕсли Ссылка= ПЭП Тогда 
		Результат = "2";
	ИначеЕсли Ссылка= УНЭП Тогда 
		Результат = "3";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Типа подписи: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка= "1" Тогда 
		Результат = УКЭП;
	ИначеЕсли Строка= "2" Тогда 
		Результат = ПЭП;
	ИначеЕсли Строка= "3" Тогда 
		Результат = УНЭП;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

