
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УчетнаяЗапись         = Параметры.УчетнаяЗапись;
	ИдентификаторСклада   = Параметры.ИдентификаторСклада;
	СписокМетодовДоставки = Параметры.СписокМетодовДоставки;
	ИдентификаторОтгрузки = Параметры.ИдентификаторОтгрузки;
	ДатаОтгрузки          = Параметры.ДатаОтгрузки;
		
	Для Каждого ЭлементСписка Из Параметры.СписокСкладов Цикл
		Если ПустаяСтрока(ЭлементСписка.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.СкладТорговойПлощадки.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
	Если ПустаяСтрока(ИдентификаторОтгрузки) Тогда
		ДатаОтгрузки = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПолучитьДанныеПоТорговойПлощадке(
		УчетнаяЗапись,
		ДанныеТорговойПлощадки,
		ИнформацияОбОтгрузкеШаблон,
		Элементы.Логотип.Картинка);
		
	НастроитьФормуПоВидуМаркетплейса(ДанныеТорговойПлощадки.ВидМаркетплейса);
		
	ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада = ИдентификаторСклада;
	
	ИнформацияОбОтгрузке = ОбщегоНазначения.СкопироватьРекурсивно(ИнформацияОбОтгрузкеШаблон);
	ИнформацияОбОтгрузке.ИдентификаторОтгрузки = ИдентификаторОтгрузки;
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, Список);
	СвойстваСписка.ТекстЗапроса =
		РегистрыСведений.ЗаказыТорговыхПлощадок.ТекстЗапросаДинамическогоСписка(Истина, Истина);
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтатусыЗаказовРаботе",
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовРаботе(Истина,, Истина));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтатусыЗаказовКонечные",
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовКонечные());
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ПометкаУдаления",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	ОписаниеЭлементаДоступаКФайлам = Новый Структура;
	ОписаниеЭлементаДоступаКФайлам.Вставить("ПутьКДаннымВладельца", "ТранспортнаяНакладная");
	ОписаниеЭлементаДоступаКФайлам.Вставить("ОтображатьКоличество", Истина);
	
	ОписанияЭлементовФормы = Новый Массив;
	ОписанияЭлементовФормы.Добавить(ОписаниеЭлементаДоступаКФайлам);
	
	ПараметрыРаботыСФайлами = Новый Структура("ОписанияЭлементовФормы", ОписанияЭлементовФормы);
	
	ОбновитьПодменюПечать(ЭтотОбъект);
	
	УстановитьВидимостьЭлементов();
	
	ИзменитьПоведениеФормыНаСервере();
	
	УстановитьУсловноеОформление();
	
	НавигационнаяСсылка = "";

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьПараметрыСписка();  
	ЭтоЯндексМаркет = ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет");
	ЭтоOzon = ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon");
	
	Если ЭтоOzon Тогда
		
		Если Элементы.СкладТорговойПлощадки.СписокВыбора.Количество() = 0 Тогда
			ЗаполнитьСписокСкладов();
		Иначе
			Если ПустаяСтрока(ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада) Тогда
				ОпределитьСкладПоУмолчанию();
			КонецЕсли;
			
			ЗаполнитьНастройкиСклада();
			
			ПолучитьИнформациюОбОтгрузке();
		КонецЕсли; 
		
	ИначеЕсли ЭтоЯндексМаркет Тогда
		
		ЗаполнитьНастройкиСклада();
		ПолучитьИнформациюОбОтгрузке();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "МП_ВыполненаЗагрузкаЗаказовТорговойПлощадки"
			И ЗначениеЗаполнено(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
			Если ТипЗнч(Параметр) = Тип("СправочникСсылка.УчетныеЗаписиМаркетплейсов")
				И Параметр = УчетнаяЗапись Тогда 
				Элементы.Список.Обновить();
				ВыполнитьПроверкуОтправленийВОтгрузке();
				Если ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса) Тогда
					ПолучитьИнформациюОбОтгрузке();
				КонецЕсли;
			КонецЕсли;
	ИначеЕсли ИмяСобытия = "МП_ОбновлениеСведенийПоЗаказамИОтправлениям"
			И ЗначениеЗаполнено(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		Элементы.Список.Обновить();
		
		Если Параметр = ИнформацияОбОтгрузке.ИдентификаторОтгрузки Тогда
			Если Источник = "ОтменаЗадания" Тогда
				СообщенияПользователюПоСостояниюОтгрузки(ИнформацияОбОтгрузке, ИнформацияОбОтгрузкеШаблон.МожноРедактировать);
			Иначе
				Если Не ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса) Тогда
					ОчиститьИнформациюОбОтгрузке(Истина);
				КонецЕсли;
				
				ПолучитьИнформациюОбОтгрузке();
			КонецЕсли;
		КонецЕсли; 
		
	ИначеЕсли ИмяСобытия = "МП_ИзменениеСпискаПропусков"
			И Источник = ИнформацияОбОтгрузке.ИдентификаторОтгрузки Тогда
		ИнформацияОбОтгрузке.Пропуска = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Параметр);
		ИзменитьПоведениеФормыНаСервере();
	
	ИначеЕсли ИмяСобытия = "Запись_ЗаказКлиента"
			Или ИмяСобытия = "Запись_ПередачаТоваровХранителю"
			Или ИмяСобытия = "Запись_РеализацияТоваровУслуг" Тогда
		ЗаполнитьМассыИзНакладных();
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "Запись_ТранспортнаяНакладная" Тогда
		Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
			ОбновитьТекстДокументыНаОсновании();
		ИначеЕсли ЗначениеЗаполнено(ЗаданиеНаПеревозку) И Параметр.Найти(ЗаданиеНаПеревозку) <> Неопределено Тогда
			ОбновитьТекстДокументыНаОсновании(Ложь);
		ИначеЕсли ЗначениеЗаполнено(ТранспортнаяНакладная) Тогда
			ОбработатьПараметрОповещения(Параметр);
		КонецЕсли;
		
		ОбновитьЗаголовокКомандыПрисоединенныхФайлов();
		
	ИначеЕсли ИмяСобытия = "Запись_ЗаданиеНаПеревозку" Тогда
		Если ЗначениеЗаполнено(Источник) И Источник = ЗаданиеНаПеревозку Тогда
			ОбновитьТекстДокументыНаОсновании(Ложь);
		Иначе
			ОбновитьТекстДокументыНаОсновании();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
			И (Источник = "ИспользоватьОбменБизнесСеть"
				Или Источник = "ИспользоватьУправлениеДоставкой" 
				Или Источник = "НеИспользоватьУправлениеДоставкой20"
				Или Источник = "ИспользоватьСервис1СДоставка"
				Или Источник = "ИспользоватьСервис1СКурьер"
				Или Источник = "ИспользоватьСервис1СКурьерика"
				Или Источник = "ИспользоватьТТН") Тогда
		ОбновитьТекстДокументыНаОсновании(, Истина);
		УстановитьВидимостьЭлементов();
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И (Источник = "ИспользоватьЗаказыКлиентов"
					Или Источник = "ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		УстановитьВидимостьЭлементов();
		
	ИначеЕсли ИмяСобытия = "Запись_Файл"
			И ТипЗнч(Источник) = Тип("Массив") Тогда
		Для Каждого ЭлементИсточника Из Источник Цикл
			Если ТипЗнч(ЭлементИсточника) = Тип("СправочникСсылка.ТранспортнаяНакладнаяПрисоединенныеФайлы") Тогда
				ОбновитьЗаголовокКомандыПрисоединенныхФайлов();
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)

	ОчиститьСообщения();
	
	Если ИнформацияОбОтгрузке.УчетнаяЗапись <> УчетнаяЗапись Тогда
		ИдентификаторСклада = "";
		
		ПолучитьДанныеПоТорговойПлощадке(
			УчетнаяЗапись,
			ДанныеТорговойПлощадки,
			ИнформацияОбОтгрузкеШаблон,
			Элементы.Логотип.Картинка);
		
		ОчиститьИнформациюОбОтгрузке();
		ЗаполнитьСписокСкладов();
	Иначе
		ПолучитьИнформациюОбОтгрузке();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладТорговойПлощадкиПриИзменении(Элемент)

	ОчиститьСообщения();
	
	ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада = ИдентификаторСклада;
	ИнформацияОбОтгрузке.ИдентификаторСклада = ИдентификаторСклада;
	
	ЗаполнитьНастройкиСклада();
	
	ИнформацияОбОтгрузкеШаблон.СмещениеЧасовогоПояса = 0;
	
	ОчиститьИнформациюОбОтгрузке();
	ПолучитьИнформациюОбОтгрузке();

КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)

	ОчиститьСообщения();
	
	ОчиститьИнформациюОбОтгрузке();
	ПолучитьИнформациюОбОтгрузке();

КонецПроцедуры

&НаКлиенте
Процедура КоличествоГрузовыхМестПриИзменении(Элемент)

	ОчиститьСообщения();

КонецПроцедуры

&НаКлиенте
Процедура КоличествоГрузовыхМестИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

	ОчиститьСообщения();

КонецПроцедуры

&НаКлиенте
Процедура ТекстДокументыНаОснованииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	ОткрытьКакНавигационнуюСсылку = Ложь;
	
	КомандаТТН = "ОткрытьТТН_";
	КомандаПеревозки = "ОткрытьЗаданиеНаПеревозку_";
	ДлинаКоманды = 0;
	
	ИмяОткрываемойФормы = "";
	ПараметрыОткрываемойФормы = Новый Структура("Ключ", Неопределено);
	
	Если СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, КомандаТТН) > 0 Тогда
		ДлинаКоманды = СтрДлина(КомандаТТН);
		
		ИмяОткрываемойФормы = "Документ.ТранспортнаяНакладная.ФормаОбъекта";
		ПараметрыОткрываемойФормы.Вставить("Ключ", ТранспортнаяНакладная);
	ИначеЕсли СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, КомандаПеревозки) > 0 Тогда
		ДлинаКоманды = СтрДлина(КомандаПеревозки);
		
		ИмяОткрываемойФормы = "Документ.ЗаданиеНаПеревозку.ФормаОбъекта";
		ПараметрыОткрываемойФормы.Вставить("Ключ", ЗаданиеНаПеревозку);
	ИначеЕсли СтрНайти(НавигационнаяСсылкаФорматированнойСтроки, "Оформить") > 0 Тогда
		Если Элементы.ТипТранспортногоСредства.Видимость
				И Не ЗначениеЗаполнено(ТипТранспортногоСредства) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не выбран ""%1"".'"), Элементы.ТипТранспортногоСредства.Заголовок);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "ТипТранспортногоСредства");
			Возврат;
		КонецЕсли;
		
		ОформитьДокументыПеревозки(НавигационнаяСсылкаФорматированнойСтроки);
		ОбновитьЗаголовокКомандыПрисоединенныхФайлов();
		
		Состояние(
			ДанныеТорговойПлощадки.ВидМаркетплейса,
			,
			НСтр("ru = 'Оформление документов завершено.'"),
			Элементы.Логотип.Картинка);
		Возврат;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ОткрытьКакНавигационнуюСсылку И ДлинаКоманды > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			Прав(НавигационнаяСсылкаФорматированнойСтроки, СтрДлина(НавигационнаяСсылкаФорматированнойСтроки) - ДлинаКоманды));
	ИначеЕсли Не ПустаяСтрока(ИмяОткрываемойФормы)
			И (ЗначениеЗаполнено(ПараметрыОткрываемойФормы.Ключ) Или ПараметрыОткрываемойФормы.Количество() > 1) Тогда
		ОповещениеОЗакрытииФормы = Новый ОписаниеОповещения("ЗакрытиеНавигационнойСсылки", ЭтотОбъект, ПараметрыОткрываемойФормы);
		ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыОткрываемойФормы,,,,, ОповещениеОЗакрытииФормы);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОПунктеПриемаСсылкаНажатие(Элемент)

	ОчиститьСообщения();
	
	Если ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		НавигационнаяСсылкаКоманды = "https://seller-edu.ozon.ru/fbs/punkty-priema";   
	ИначеЕсли ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет") Тогда 
		НавигационнаяСсылкаКоманды = "https://yandex.ru/support/marketplace/ru/storage/storages";
	Иначе
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаКоманды);

КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьСписокОтгрузок(Команда)
	
	ОчиститьСообщения();

	ИмяОткрываемойФормы = "Обработка.УправлениеПродажамиНаЯндексМаркет.Форма.ОтгрузкиВСервисе";

	ЗаголовокФормы = НСтр("ru = 'Отгрузки FBS'");

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗапись",               УчетнаяЗапись);
	ПараметрыФормы.Вставить("ЗаголовокФормы",              ЗаголовокФормы);

	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОформлениеПропусковЯМ(Команда)
	
	ОчиститьСообщения();
	 
	НавигационнаяСсылкаКоманды = "https://yandex.ru/support/marketplace/ru/storage/storages";
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаКоманды);

КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиСсылкаНажатие(Элемент)

	ОчиститьСообщения();
	
	Если ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		НавигационнаяСсылкаКоманды = "https://seller.ozon.ru/app/warehouse";
	ИначеЕсли ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет") Тогда
		НавигационнаяСсылкаКоманды = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									"https://partner.market.yandex.ru/business/%1/warehouses?tld=ru&campaignId=%2",
									ДанныеТорговойПлощадки.ИдентификаторКабинета,
									ДанныеТорговойПлощадки.ИдентификаторМагазина);
	Иначе
		Возврат;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаКоманды);

КонецПроцедуры

&НаКлиенте
Процедура НастройкиСпособаДоставкиСсылкаНажатие(Элемент)  
	
	ОткрытьНастройкиСкладаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ДоверительнаяПриемкаПриИзменении(Элемент)
	Если ДоверительнаяПриемка Тогда 
		Элементы.КоличествоГрузовыхМестЯМ.Видимость = Истина;
	Иначе
		Элементы.КоличествоГрузовыхМестЯМ.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокСпискаОтправленийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ЗаголовокФормы = "";
	СписокОбъектов = Новый Массив;
	
	ПараметрыЗавершенияВыбора = Новый Структура;
	ПараметрыЗавершенияВыбора.Вставить("Действие", НавигационнаяСсылкаФорматированнойСтроки);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтправленийЗагруженных" Тогда
		ЗаголовокФормы = НСтр("ru = 'Загруженные отправления'");
		СписокОбъектов = ОтправленияЗагруженные.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтправленийВОтгрузке" Тогда
		ЗаголовокФормы = НСтр("ru = 'Отправления в отгрузке'");
		СписокОбъектов = ОтправленияВОтгрузке.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтправленийНезагруженных" Тогда
		ЗаголовокФормы = НСтр("ru = 'Незагруженные отправления'");
		СписокОбъектов = ОтправленияНезагруженные.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтправленийНеВОтгрузке" Тогда
		ЗаголовокФормы = НСтр("ru = 'Исключенные отправления'");
		СписокОбъектов = ОтправленияНеВОтгрузке.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокЗаказовВОтгрузке" Тогда
		ЗаголовокФормы = НСтр("ru = 'Заказы в отгрузке'");
		СписокОбъектов = ЗаказыВОтгрузке.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокЗаказовЗагруженных" Тогда
		ЗаголовокФормы = НСтр("ru = 'Загруженные заказы'");
		СписокОбъектов = ЗаказыЗагруженные.ВыгрузитьЗначения();
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокЗаказовНезагруженных" Тогда
		ЗаголовокФормы = НСтр("ru = 'Незагруженные заказы'");
		СписокОбъектов = ЗаказыНеЗагруженные.ВыгрузитьЗначения();     
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокЗаказовНезагруженныхОтмененных" Тогда
		ЗаголовокФормы = НСтр("ru = 'Незагруженные отмененные заказы'");
		СписокОбъектов = ЗаказыНеЗагруженныеОтмененные.ВыгрузитьЗначения();  
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСписокОтгрузок" Тогда
		ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отгрузки на %1'"),
			Формат(ДатаОтгрузки, "ДЛФ=DD"));
		
		Если Отгрузки.Количество() = 1
				И ПустаяСтрока(Отгрузки[0].Значение) Тогда
			ПросмотрСпискаОбъектовЗавершение(Отгрузки[0].Значение, ПараметрыЗавершенияВыбора);
			Возврат;
		Иначе
			СписокОбъектов = Отгрузки;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(СписокОбъектов) = Тип("СписокЗначений")
			И СписокОбъектов.Количество() > 0 Тогда
		
		ОповещениеОВыборе = Новый ОписаниеОповещения(
			"ПросмотрСпискаОбъектовЗавершение",
			ЭтотОбъект,
			ПараметрыЗавершенияВыбора);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормы);
		ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокОбъектов);
		
		ОткрытьФорму(
			"ОбщаяФорма.ВыборЗначенияИзСписка",
			ПараметрыФормы,
			ЭтотОбъект,
			,,,
			ОповещениеОВыборе,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипЗнч(СписокОбъектов) = Тип("Массив")
			И СписокОбъектов.Количество() > 0 Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗаголовокФормы",   ЗаголовокФормы);
		ПараметрыФормы.Вставить("МассивДокументов", СписокОбъектов);
		
		ОткрытьФорму(
			"ОбщаяФорма.СписокПроизвольныхОбъектовУП",
			ПараметрыФормы,
			ЭтотОбъект,
			,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет данных для просмотра.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипТранспортногоСредстваПриИзменении(Элемент)

	ОчиститьСообщения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.СписокПометкаСнята Или Поле = Элементы.СписокПометкаУстановлена Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные.Пометка = Не ТекущиеДанные.Пометка;
		УстановитьПометку(ТекущиеДанные.Пометка, ТекущиеДанные.НомерОтправления);
	ИначеЕсли Поле.Имя = "СписокСостояние" Тогда
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(ТекущиеДанные.Ссылка);
		
		Если ТекущиеДанные.ЭтоЗаказКакСчет Тогда
			Возврат;
		КонецЕсли;
		
		ОткрытьФорму("Отчет.СостояниеВыполненияДокументов.Форма.ФормаОтчета",
			Новый Структура("ВходящиеДокументы", СписокДокументов),
			ЭтотОбъект,
			Ложь);
		
	Иначе
		ПоказатьСодержимоеТекущейЯчейки(ТекущиеДанные, Поле);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ) 
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройкиСклада(Команда)
	
	ОткрытьНастройкиСкладаНаКлиенте();

КонецПроцедуры  
	
&НаКлиенте
Процедура СкопироватьВБуферОбмена(Команда)

	Если ТекущийЭлемент.Имя = "СкопироватьВБуферОбменаАдресОтгрузки" Тогда
		ИнтеграцияСМаркетплейсамиКлиент.СкопироватьВБуферОбмена(Элементы.АдресДоставки.Заголовок);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)

	ОбновитьПараметрыСписка();
	ЗаполнитьМассыИзНакладных();
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКОтгрузке(Команда)

	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='У выделенных в списке заказов будет установлен статус ""К отгрузке"". Продолжить?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
	ДопПараметры.Вставить("СтатусДокументов", "КОтгрузке");
	ДопПараметры.Вставить("ЗаголовокСтатуса", НСтр("ru='К отгрузке'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусДокументовЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтгрузку(Команда)

	ОчиститьСообщения();
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса);
	ДоступнаДоставка = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20();
	
	Если ОбновляетсяИнформацияОбОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнформацияОбОтгрузке.УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана учетная запись.'"),,, "УчетнаяЗапись");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран склад.'"),,, "ИдентификаторСклада");
		Возврат;
	КонецЕсли;
		
	Если (МетодДоставки = Неопределено
			Или ПустаяСтрока(МетодДоставки.ИдентификаторМетодаДоставки)) 
			И Не ЭтоЯндексМаркет Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не удалось определить метод доставки для указанного склада. Возможно склад удален из личного кабинета.'"),
			,,
			"ИдентификаторСклада");
		Возврат;
	КонецЕсли;
	
	Если (МетодДоставки <> Неопределено И МетодДоставки.ДоверительнаяПриемка Или ДоверительнаяПриемка)
			И Не ЗначениеЗаполнено(КоличествоГрузовыхМест)
			И Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаУказание
			И Элементы.СтраницыДоступаКГрузовымМестам.Видимость Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Количество грузовых мест"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,, "КоличествоГрузовыхМест");
		
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		ВыполнитьФормированиеОтгрузки();
	ИначеЕсли ИнформацияОбОтгрузке.МожноРедактировать
		И (ИнформацияОбОтгрузке.ОтгрузкаСформирована Или ИнформацияОбОтгрузке.ОтгрузкаАктуальна) Тогда
		
		Если ДоступнаДоставка Тогда
			ОбработчикОповещения = Новый ОписаниеОповещения(
			"ПослеВопросаОбИзмененииНастроекСпособаДоставкиПередПодтверждениемОтгрузки",
			ЭтотОбъект);
			
			ЗадатьВопросОбИзмененииНастроекСпособаДоставки(ОбработчикОповещения);
		Иначе
			ПродолжитьПодтверждениеОтгрузки();
		КонецЕсли;

	Иначе
		Если ИнформацияОбОтгрузке.ОтгрузкаОтменена
				И ИнформацияОбОтгрузке.ОтправленияПривязанныеКОтгрузке.Количество() = 0 Тогда
			ОчиститьИнформациюОбОтгрузке();
		КонецЕсли;
		
		ПолучитьИнформациюОбОтгрузке(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтгрузку(Команда)

	ОчиститьСообщения();
	
	ВыполнитьОтменуОтгрузки();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОбОтгрузке(Команда)

	ОчиститьСообщения();
	
	Если ОбновляетсяИнформацияОбОтгрузке Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСвязьСОтгрузкой = ИнформацияОбОтгрузке.ОтгрузкаАктуальна
		И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована
		Или ИнформацияОбОтгрузке.ПовторитьЗапрос;
	
	ПолучитьИнформациюОбОтгрузке(ЗаполнитьСвязьСОтгрузкой);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)

	УстановитьПометку(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СброситьВсе(Команда)

	УстановитьПометку(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокДоверенностей(Команда)

	ОчиститьСообщения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДоступностьРаспоряженийТовары", Истина);
	
	СтруктураБыстрогоОтбора = Новый Структура;
	СтруктураБыстрогоОтбора.Вставить("Ответственный", ПользователиКлиент.ТекущийПользователь());
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если НастройкиСклада <> Неопределено И ЗначениеЗаполнено(НастройкиСклада.ПеревозчикПартнер) Тогда
		ЗначениеОтбора = Новый Структура("Партнер", НастройкиСклада.ПеревозчикПартнер);
	Иначе
		ЗначениеОтбора = Новый Структура("Партнер", ДанныеТорговойПлощадки.Партнер);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);
	
	ОткрытьФорму("Документ.ДоверенностьВыданная.Форма.ФормаСпискаДокументов", ПараметрыФормы,, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПропусков(Команда)

	ОчиститьСообщения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗапись",           ИнформацияОбОтгрузке.УчетнаяЗапись);
	ПараметрыФормы.Вставить("ИдентификаторСклада",     ИнформацияОбОтгрузке.ИдентификаторСклада);
	ПараметрыФормы.Вставить("ИдентификаторОтгрузки",   ИнформацияОбОтгрузке.ИдентификаторОтгрузки);
	ПараметрыФормы.Вставить("ПорядковыйНомерОтгрузки", ИнформацияОбОтгрузке.ПорядковыйНомерОтгрузки);
	ПараметрыФормы.Вставить("ДатаОтгрузки",            ДатаОтгрузки);
	ПараметрыФормы.Вставить("ИдентификаторыПропусков", ИнформацияОбОтгрузке.Пропуска);
	
	Если Не ИнформацияОбОтгрузке.ОтгрузкаАктуальна Или Не ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда
		ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершениеЗаполненияПропусков", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.ЗаказыТорговыхПлощадок.Форма.СписокПропусков",
		ПараметрыФормы,
		ЭтотОбъект,
		,,,
		ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетокГрузовыхМест(Команда)

	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьЭтикетокГрузовыхМест(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьКомплектаДокументов(Команда)

	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	
	ПодготовитьПечатьКомплектаДокументов(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛистаОтгрузки(Команда)

	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьЛистаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьШтрихкодаОтгрузки(Команда)

	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьШтрихкодаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьНакладнойАкта(Команда)

	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьНакладнойАкта(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная, Истина);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьТранспортнойНакладной(Команда)
	
	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьНакладнойАкта(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная, Ложь);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктаОРасхождениях(Команда)
	
	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьАктаОРасхождениях(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьФактическогоАктаПриемаПередачи(Команда)
	
	ОчиститьСообщения();
	
	ПечатныеДокументы = Новый Соответствие;
	ПодготовитьПечатьФактическогоАктаПриемаПередачи(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	
	ПоказатьПечатныеФормы(ПечатныеДокументы);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, ТранспортнаяНакладная);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТранспортнаяНакладная);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Показ снятой пометки.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокПометкаСнята.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Пометка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Показ установленной пометки.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокПометкаУстановлена.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Пометка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Условное оформление динамического списка "Список"
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	// Документ отгрузки не оформлен.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Документ отгрузки не оформлен'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ДокументОтгрузки");
	
	СписокДокументовОтгрузки = Новый СписокЗначений;
	СписокДокументовОтгрузки.Добавить(Неопределено);
	СписокДокументовОтгрузки.Добавить(Документы.ПередачаТоваровХранителю.ПустаяСсылка());
	СписокДокументовОтгрузки.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДокументОтгрузки");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокДокументовОтгрузки;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Требуется оформить>'"));
	
	// Представление даты сборки в прошлом.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - в прошлом'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	Если ЭтоOzon Тогда
		// Представление даты отгрузки сегодня.
		ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - сегодня'");
		
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
		ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=ЧЧ:мм'"));
		
		// Представление даты отгрузки в будущем.
		ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - в будущем'");
		
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM.yyyy ЧЧ:мм'");
		
	ИначеЕсли ЭтоЯндексМаркет Тогда
		// Представление даты сборки по умолчанию.
		ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки'");
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	КонецЕсли;
	
	// Выделение цветом просроченного заказа
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Выделение цветом просроченного отправления'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("НомерОтправления");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Выделение цветом конечного статуса
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Выделение цветом конечного статуса'");
	
	СписокКонечныхСтатусов = Новый СписокЗначений;
	СписокКонечныхСтатусов.ЗагрузитьЗначения(Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовКонечные());
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокКонечныхСтатусов;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	ЕстьДоступНаИзменение = ПравоДоступа("Изменение", Метаданные.Документы.ЗаказКлиента);
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента    = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	ИспользоватьУправлениеДоставкой                 = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20();
	
	Элементы.УстановитьСтатусКОтгрузке.Видимость = ИспользоватьРасширенныеВозможностиЗаказаКлиента
		И Не ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента;
	Элементы.СписокОтгрузитьЗаказ.Видимость = ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента
		И ЕстьДоступНаИзменение;
	
	Элементы.СтраницыИнформацияПоНастройкамСклада.Видимость = ИспользоватьУправлениеДоставкой;
	Элементы.АдресДоставкиКомментарий.Видимость             = ИспользоватьУправлениеДоставкой;
	Элементы.ИнформацияОНастройкахСклада.Видимость          = ИспользоватьУправлениеДоставкой;
	Элементы.ИнформацияОНастройкахСклада1.Видимость         = ИспользоватьУправлениеДоставкой;
	Элементы.НастройкиСпособаДоставкиСсылка1.Видимость      = ИспользоватьУправлениеДоставкой;
КонецПроцедуры

&НаСервере
Процедура ИзменитьПоведениеФормыНаСервере()

	Заголовок = ПредставлениеОтгрузки(ИнформацияОбОтгрузке); 
	
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ДанныеТорговойПлощадки.ВидМаркетплейса);
	ЭтоOzon = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ДанныеТорговойПлощадки.ВидМаркетплейса); 
	
	ЭтоСпособОтгрузкиКурьеру = (ИнформацияОбОтгрузке.СпособОтгрузки = "Курьеру");
	ЭтоСпособОтгрузкиСЦ = (ИнформацияОбОтгрузке.СпособОтгрузки = "СортировочныйЦентрИлиПунктПриемаЗаказов");
	ДоступнаДоставка = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20();
	
	Если ПустаяСтрока(Статус) Тогда  
		Если ЭтоЯндексМаркет Тогда   
			Если ЗначениеЗаполнено(ИнформацияОбОтгрузке.Ошибка.ОписаниеОшибки) Тогда
				Статус = "";
			Иначе
				Статус = НСтр("ru='Не запланирована'");
			КонецЕсли;
		Иначе
			Статус = Элементы.СтатусПустой.ПодсказкаВвода; 
		КонецЕсли;
	КонецЕсли; 
	
	Если ЭтоЯндексМаркет И ЗначениеЗаполнено(ИнформацияОбОтгрузке.Статус) Тогда 
		Статус = ВозможныеСтатусыОтгрузки[ИнформацияОбОтгрузке.Статус].Представление;	 
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиПустой;
		
		Если ЭтоЯндексМаркет Тогда
			Если ЗначениеЗаполнено(ИнформацияОбОтгрузке.Ошибка.ОписаниеОшибки) Тогда  
				Элементы.ИнформацияОбОшибке.Подсказка = НСтр("ru='Невозможно получить данные об отгрузке.'");
				Элементы.ИнформацияОПустойОтгрузке.Видимость = Ложь;
				Элементы.ИнформацияОбОшибке.Видимость = Истина;
			Иначе   
				Элементы.ИнформацияОПустойОтгрузке.Видимость = Истина;
				Элементы.ИнформацияОбОшибке.Видимость = Ложь;
			КонецЕсли;	
			Элементы.СтраницыОтправленияОтгрузки.ТекущаяСтраница = Элементы.СтраницаОтгрузкаНеЗапланирована;  
		Иначе
			Элементы.СтраницыОтправленияОтгрузки.ТекущаяСтраница = Элементы.СтраницаОтгрузкаНеСформирована; 
			Элементы.СтраницыФоновогоЗадания.ТекущаяСтраница = Элементы.СтраницаФоновогоЗаданияПустая; 
		КонецЕсли;
		
		Элементы.ОбновитьИнформациюОбОтгрузке.Видимость = Ложь;
		Элементы.КомандыПечати.Видимость = Ложь;
		Элементы.КомандыГиперссылки.Видимость = Ложь;
		
		Элементы.ТекстДокументыНаОсновании.Видимость = Ложь;
		
		Если ЭтоЯндексМаркет Тогда
			Элементы.СформироватьОтгрузку.Заголовок = НСтр("ru = 'Обновить'");
			Команды.СформироватьОтгрузку.Подсказка = НСтр("ru = 'Обновить сведения об отгрузке'");  
			Элементы.ГруппаСпособОтгрузки.Видимость = Ложь;
		Иначе
			Элементы.СформироватьОтгрузку.Заголовок = НСтр("ru = 'Сформировать'");
			Команды.СформироватьОтгрузку.Подсказка = НСтр("ru = 'Сформировать новую отгрузку'");
		КонецЕсли;
		
		ОбновитьТекстКоличествоДоступныхОтправлений();
	Иначе
		Если ИнформацияОбОтгрузке.ОтгрузкаОтменена Тогда
			Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиПустой;
		ИначеЕсли ИнформацияОбОтгрузке.ОтгрузкаСформирована
				И Не ИнформацияОбОтгрузке.ПовторитьЗапрос Тогда
			Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиЗаполнен;
		Иначе
			Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиОжидаетДействий;
		КонецЕсли;
		
		Элементы.СтраницыОтправленияОтгрузки.ТекущаяСтраница = Элементы.СтраницаИнформацияПоОтправлениям;
		
		Элементы.ОбновитьИнформациюОбОтгрузке.Видимость = Истина;
		Элементы.КомандыПечати.Видимость = Истина;
		Элементы.КомандыГиперссылки.Видимость = Истина;
		Элементы.ОткрытьСписокДоверенностей.Видимость =
			ПолучитьФункциональнуюОпцию("ИспользоватьДоверенностиНаПолучениеТМЦ")
			И ПравоДоступа("Просмотр", Метаданные.Документы.ДоверенностьВыданная);
		
		Если ИнформацияОбОтгрузке.МожноРедактировать Тогда
			Элементы.СформироватьОтгрузку.Заголовок = НСтр("ru = 'Подтвердить'");
			Команды.СформироватьОтгрузку.Подсказка = НСтр("ru = 'Подтвердить отгрузку и ее состав'");
		Иначе
			Элементы.СформироватьОтгрузку.Заголовок = НСтр("ru = 'Обновить'");
			Команды.СформироватьОтгрузку.Подсказка = НСтр("ru = 'Обновить сведения об отгрузке'");
		КонецЕсли;
		
		Элементы.ДекорацияИнформацияОСтатусеОтгрузки.Видимость = Не ИнформацияОбОтгрузке.ОтгрузкаСформирована
																 И Не ЭтоЯндексМаркет;
		
		Если ЭтоЯндексМаркет И ИнформацияОбОтгрузке.ДоступныеДействия.Найти("УказатьКоличествоПалет")<>Неопределено Тогда			 
			Элементы.ПанельДоверительнаяПриемкаЯМ.Видимость = Истина; 
			Если ЭтоСпособОтгрузкиКурьеру Тогда
				ДоверительнаяПриемка = Истина;
				Элементы.ДоверительнаяПриемка.Доступность = Ложь;
				Элементы.КоличествоГрузовыхМестЯМ.Видимость = Истина; 
			Иначе
				Если Не ДоверительнаяПриемка Тогда
					Элементы.КоличествоГрузовыхМестЯМ.Видимость = Ложь; 
				КонецЕсли;
			КонецЕсли;   
		Иначе  
			Элементы.ПанельДоверительнаяПриемкаЯМ.Видимость = Ложь;
		КонецЕсли;	
		
		Если ЭтоЯндексМаркет И ЭтоСпособОтгрузкиКурьеру Тогда
			Элементы.ГруппаДоставкаКурьером.Видимость = ДоступнаДоставка;
			Элементы.ГруппаПунктПриема.Видимость = Ложь; 
			
		ИначеЕсли ЭтоЯндексМаркет И ЭтоСпособОтгрузкиСЦ Тогда
			Элементы.ГруппаДоставкаКурьером.Видимость = Ложь;
			Элементы.ГруппаПунктПриема.Видимость = Истина;
			
		ИначеЕсли ЭтоOzon Тогда 
			Элементы.ГруппаДоставкаКурьером.Видимость = Ложь;
			Элементы.ГруппаПунктПриема.Видимость = Истина; 
		КонецЕсли;
		
		Если ЭтоЯндексМаркет И ТекущаяДатаСеанса()> ИнформацияОбОтгрузке.ВремяОтгрузкиРекомендуемое Тогда
			 Элементы.ПиктограммаПросроченнойОтгрузкиЯМ.Видимость = Истина;
		Иначе
			 Элементы.ПиктограммаПросроченнойОтгрузкиЯМ.Видимость = Ложь;
		КонецЕсли;
		ОбновитьТекстСписокОтправлений();
		
		Если Не ЭтоЯндексМаркет Тогда
			Элементы.КомандыГиперссылки.Доступность = ИнформацияОбОтгрузке.ОтгрузкаСформирована; 
		Иначе
			Элементы.КомандыГиперссылки.Доступность = Истина;
		КонецЕсли;
		
		КомандыПечати = КомандыПечатиСформированнойОтгрузки(
			ПодключенныеПечатныеФормы,
			ИнформацияОбОтгрузке.ДоступныеПечатныеФормы);
		
		УстановитьДоступностьПечатныхФорм(
			Элементы,
			КомандыПечати,
			ИнформацияОбОтгрузке.ОтгрузкаСформирована И ИнформацияОбОтгрузке.ОтгрузкаАктуальна);
			
		ИмяКоманды = "ПечатьЭтикетокГрузовыхМест";	
		Если ЭтоOzon Тогда
			Если КомандыПечати.НайтиПоЗначению(ИмяКоманды) <> Неопределено Тогда 
				Элементы[ИмяКоманды].Доступность = Элементы[ИмяКоманды].Доступность И МетодДоставки.ДоверительнаяПриемка;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоЯндексМаркет Тогда
			
			Элементы.ПечатьЭтикетокГрузовыхМест.Доступность = ДоверительнаяПриемка;
			
			Если ИнформацияОбОтгрузке.ДоступныеДействия.Найти("СкачатьАктПриемаПередачи")<>Неопределено Тогда
				Элементы.ПечатьАктаПриемаПередачи.Доступность = Истина;
			Иначе
				Элементы.ПечатьАктаПриемаПередачи.Доступность = Ложь;
			КонецЕсли;
			
			Если ИнформацияОбОтгрузке.ДоступныеДействия.Найти("СкачатьТранспортнуюНакладную")<>Неопределено Тогда
				Элементы.ПечатьТранспортнойНакладной.Доступность = Истина;
			Иначе
				Элементы.ПечатьТранспортнойНакладной.Доступность = Ложь;
			КонецЕсли;
			
			Если ИнформацияОбОтгрузке.ДоступныеДействия.Найти("СкачатьСписокПринятыхЗаказов")<>Неопределено Тогда
				Элементы.ПечатьФактическогоАктаПриемаПередачи.Доступность = Истина;
			Иначе
				Элементы.ПечатьФактическогоАктаПриемаПередачи.Доступность = Ложь;
			КонецЕсли;
		
			Если ИнформацияОбОтгрузке.ДоступныеДействия.Найти("СкачатьАктРасхождений")<>Неопределено Тогда
				Элементы.ПечатьАктаОРасхождениях.Доступность = Истина;
			Иначе
				Элементы.ПечатьАктаОРасхождениях.Доступность = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИнформацияОбОтгрузкеШаблон.МожноРедактировать Тогда
			ШаблонСтроки = "";
		Иначе
			Если ЭтоOzon Тогда
				Если ИнформацияОбОтгрузке.ОтгрузкаАктуальна Или ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузку можно отменить только <a href = ""%1"">в личном кабинете</a>.'");
				Иначе
					ШаблонСтроки = НСтр("ru = 'Отгрузку можно подтвердить или отменить только <a href = ""%1"">в личном кабинете</a>.'");
				КонецЕсли;
			ИначеЕсли ЭтоЯндексМаркет Тогда
				Если ИнформацияОбОтгрузке.Статус = "Формируется" Тогда
					ШаблонСтроки = НСтр("ru = 'Подтвердить отгрузку можно после ее формирования торговой площадкой. Для передачи товаров раньше запланированного срока <a href = ""%1"">скачайте шаблон для заполнения акт приема-передачи</a> в личном кабинете.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "Сформирована" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка доступна для подтверждения. Если используется доверительная приемка, необходимо указать количество грузомест.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "ГотоваКОтправке" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка подтверждена и готова к отправке. Электронный акт приема-передачи не подписан. Подпишите акт <a href = ""%1"">в личном кабинете</a> или распечатайте бумажные экземпляры.'");    
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "ПодписанАктПриемаПередачи" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка подтверждена и готова к отправке. Подписан электронный акт приема-передачи. Необходимо оформить документы и передать товар в доставку.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "Принята" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка принята в сортировочном центре или пункте приема.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "ПринятаСРасхождениями" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка принята торговой площадкой с расхождениями. Подробные данные в акте расхождений и акте фактического приема-передачи. Для устранения расхождений необходимо принять решение по отгрузке. Если необходимо довезти недостающие заказы - шаблон для формирования акта приема-передачи можно скачать <a href = ""%1"">в личном кабинете</a>.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "Завершена" Тогда
					ШаблонСтроки = НСтр("ru = 'Работа с отгрузкой завершена.'");
				ИначеЕсли ИнформацияОбОтгрузке.Статус = "Ошибка" Тогда
					ШаблонСтроки = НСтр("ru = 'Отгрузка отменена из-за ошибки.'");
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
			
		Если ИнформацияОбОтгрузке.ОтгрузкаАктуальна И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда
			Элементы.СтраницыДокументов.ТекущаяСтраница = Элементы.СтраницыДокументовОтгрузкаФормируется;
		Иначе
			Элементы.СтраницыДокументов.ТекущаяСтраница = Элементы.СтраницаДокументовОтгрузкаСформирована;
		КонецЕсли;
		
		Элементы.ДекорацияИнформацияОДействияхСОтгрузкой.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
																	ШаблонСтроки,
																	ПутьКОтгрузкамВЛичномКабинете(ИнформацияОбОтгрузке.ВидМаркетплейса));
			
		Элементы.ДекорацияИнформацияОДействияхСОтгрузкой1.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
																	ШаблонСтроки,
																	ПутьКОтгрузкамВЛичномКабинете(ИнформацияОбОтгрузке.ВидМаркетплейса));
		
		Элементы.ЗагрузитьЗаказы.Видимость = Не ИнформацияОбОтгрузке.ОтгрузкаОтменена
											И (ИнформацияОбОтгрузке.ОтправленияНезагруженные.Количество() > 0
												ИЛИ ИнформацияОбОтгрузке.ЗаказыНезагруженные.Количество()>0);
		
		КоличествоПропусков = ИнформацияОбОтгрузке.Пропуска.Количество();
		
		Элементы.ОткрытьСписокПропусков.Доступность = ИнформацияОбОтгрузке.ОтгрузкаСформирована
													И ИнформацияОбОтгрузке.ОтгрузкаАктуальна
													Или КоличествоПропусков > 0;
		
		Если ИнформацияОбОтгрузке.ТребуетсяПропуск И КоличествоПропусков = 0 Тогда
			Элементы.ОткрытьСписокПропусков.Отображение = ОтображениеКнопки.КартинкаИТекст;
			Элементы.ОткрытьСписокПропусков.ЦветТекста = ЦветаСтиля.ПросроченныеДанныеЦвет;
			Элементы.ОткрытьСписокПропусков.Заголовок = НСтр("ru = 'Оформить пропуск'");
		Иначе
			Элементы.ОткрытьСписокПропусков.Отображение = ОтображениеКнопки.Текст;
			Элементы.ОткрытьСписокПропусков.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
			Элементы.ОткрытьСписокПропусков.Заголовок = НСтр("ru = 'Список пропусков'");
		КонецЕсли;
		
		Элементы.ТекстДокументыНаОсновании.Видимость = Истина;
		Элементы.ТекстДокументыНаОсновании.Доступность = ИнформацияОбОтгрузке.ОтгрузкаСформирована
														И ИнформацияОбОтгрузке.ОтгрузкаАктуальна;
		
		ОбновитьТекстДокументыНаОсновании();
	КонецЕсли;
	
	Элементы.ИнформацияПоСкладу.Заголовок = ИнформацияПоСкладу;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада) Тогда
		Элементы.СтраницыИнформацияПоНастройкамСклада.ТекущаяСтраница = Элементы.ИнформацияПоНастройкамСкладаЗаполняется;
	Иначе
		Элементы.СтраницыИнформацияПоНастройкамСклада.ТекущаяСтраница = Элементы.ИнформацияПоНастройкамСклада;
	КонецЕсли;
	
	Элементы.АдресДоставки.Видимость = Не ПустаяСтрока(ИнформацияОбОтгрузке.АдресПунктаПриема);

	Если ЭтоЯндексМаркет Тогда  
		Элементы.КоманднаяПанель.Доступность = Истина;
	Иначе
		Элементы.КоманднаяПанель.Доступность = (Элементы.СкладТорговойПлощадки.СписокВыбора.Количество() > 0);
	КонецЕсли;	
	
	Элементы.СформироватьОтгрузку.Доступность = ИнформацияОбОтгрузке.ОтгрузкаСформирована
												Или ИнформацияОбОтгрузке.МожноРедактировать
												Или (ДатаОтгрузки >= НачалоДня(ТекущаяДатаСеанса()));
	
	Элементы.ОтменитьОтгрузку.Видимость = ИнформацияОбОтгрузкеШаблон.МожноРедактировать
										И (ИнформацияОбОтгрузке.ОтгрузкаСформирована Или ИнформацияОбОтгрузке.ОтгрузкаАктуальна);
	Элементы.ОтменитьОтгрузку.Доступность = Элементы.ОтменитьОтгрузку.Видимость
										И ИнформацияОбОтгрузке.МожноОтменить
										И Не ИнформацияОбОтгрузке.ПовторитьЗапрос;
	
	Элементы.СписокГруппаКомандыПометки.Видимость = ИнформацияОбОтгрузке.МожноРедактировать
													И (ИнформацияОбОтгрузке.ОтгрузкаСформирована Или ИнформацияОбОтгрузке.ОтгрузкаАктуальна)
													И Не ЭтоЯндексМаркет;
	Элементы.СписокПометкаУстановлена.Видимость = Элементы.СписокГруппаКомандыПометки.Видимость;
	Элементы.СписокПометкаСнята.Видимость = Элементы.СписокГруппаКомандыПометки.Видимость;
	
	ИзменитьОтображениеВремениОтгрузки();
	ИзменитьВидимостьДоступностьЭлементовПоНастройкамСклада();
	
	ОбновитьТекстСписокОтгрузок();

КонецПроцедуры

&НаСервере
Процедура ИзменитьОтображениеВремениОтгрузки()

	Если Не ЗначениеЗаполнено(ВремяОтгрузки)
			Или ИнформацияОбОтгрузке.ОтгрузкаСформирована И Не ИнформацияОбОтгрузке.ОтгрузкаАктуальна Тогда
		Элементы.СтраницыВремяОтгрузки.ТекущаяСтраница = Элементы.СтраницаВремяОтгрузкиНеопределено;
	Иначе
		ДатаСеанса = ТекущаяДатаСеанса();
		
		Если ЗначениеЗаполнено(ВремяОтгрузкиРекомендуемое)
				И ДатаСеанса <= (ДатаОтгрузки + (ВремяОтгрузкиРекомендуемое - Дата(1,1,1))) Тогда
			Элементы.СтраницыВремяОтгрузки.ТекущаяСтраница = Элементы.СтраницаВремяОтгрузкиАктуальное;
		Иначе
			Элементы.СтраницыВремяОтгрузки.ТекущаяСтраница = Элементы.СтраницаВремяОтгрузкиПросроченное;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьДоступностьЭлементовПоНастройкамСклада()

	Элементы.ОткрытьНастройкиСклада.Доступность = Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада)
		И (НастройкиСклада <> Неопределено)
		И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована;
	
	Элементы.СтраницыДоступаКГрузовымМестам.Видимость =
		МетодДоставки <> Неопределено
		И МетодДоставки.ДоверительнаяПриемка
		И (Не ИнформацияОбОтгрузкеШаблон.МожноРедактировать И ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки)
				Или ИнформацияОбОтгрузкеШаблон.МожноРедактировать И Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки));
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Или ОтправленияВОтгрузке.Количество() = 0 Тогда
		Если ИнформацияОбОтгрузке.МожноРедактировать Тогда
			Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаТолькоПросмотр;
		Иначе
			Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаУказание;
		КонецЕсли;
	Иначе
		Если ИнформацияОбОтгрузке.МожноРедактировать
				И (ИнформацияОбОтгрузке.ОтгрузкаСформирована Или ИнформацияОбОтгрузке.ОтгрузкаАктуальна) Тогда
			Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаУказание;
		Иначе
			Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаТолькоПросмотр;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьПараметрОповещения(Параметр, ОбновитьТекстДокументыНаОсновании = Истина)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
		|ГДЕ
		|	ТранспортнаяНакладнаяДокументыОснования.Ссылка = &ТранспортнаяНакладная
		|	И ТранспортнаяНакладнаяДокументыОснования.ДокументОснование В(&ДокументыОснования)";
	
	Запрос.УстановитьПараметр("ТранспортнаяНакладная", ТранспортнаяНакладная);
	Запрос.УстановитьПараметр("ДокументыОснования",    Параметр);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновитьТекстДокументыНаОсновании Тогда
		ОбновитьТекстДокументыНаОсновании(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеНавигационнойСсылки(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ЗначениеЗаполнено(ДополнительныеПараметры.Ключ) Тогда
		ОбновитьТекстДокументыНаОсновании();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстКоличествоДоступныхОтправлений()

	Если ИнформацияОбОтгрузке.КоличествоОтправленийВОтгрузке = 0 Тогда
		ТекстИнформацииОКоличествеОтправлений = НСтр("ru = 'Нет доступных к отгрузке отправлений.'");
	Иначе
		ПредставлениеКоличестваОтправлений = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';доступно %1 отправление;;доступны %1 отправления;доступны %1 отправлений;'"),
			ИнформацияОбОтгрузке.КоличествоОтправленийВОтгрузке);
		
		ТекстИнформацииОКоличествеОтправлений = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'К отгрузке %1.'"),
			ПредставлениеКоличестваОтправлений);
	КонецЕсли;
	
	Элементы.ИнформацияОКоличествеОтправлений.Заголовок = ТекстИнформацииОКоличествеОтправлений;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстСписокОтгрузок()

	Элементы.СтраницыСписокОтгрузок.ТекущаяСтраница = Элементы.СтраницаИнформацияОбОтгрузках;
	
	КоличествоОтгрузок = Отгрузки.Количество();
	
	Если КоличествоОтгрузок > 0 Тогда
		Если КоличествоОтгрузок = 1 И ПустаяСтрока(Отгрузки[0].Значение) Тогда
			ШаблонЗаголовка = НСтр("ru = 'Перейти к новой отгрузке'");
		Иначе
			ШаблонЗаголовка = НСтр("ru = 'Перейти к отгрузке (еще %1)'");
		КонецЕсли;
		
		ШаблонСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"<a href = ""ОткрытьСписокОтгрузок"">%1</a>",
			ШаблонЗаголовка);
	Иначе
		ШаблонСтроки = "";
	КонецЕсли;
	
	Элементы.ЗаголовокСпискаОтгрузок.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		ШаблонСтроки,
		КоличествоОтгрузок);

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстСписокОтправлений(ПоказыватьИсключенияОтправлений = Ложь)
	
	Если ИнформацияОбОтгрузке.ОтгрузкаСформирована Или ИнформацияОбОтгрузке.ОтгрузкаАктуальна Тогда
		КоличествоОтправленийВОтгрузке     = ОтправленияВОтгрузке.Количество();
		КоличествоОтправленийНезагруженных = ОтправленияНезагруженные.Количество();
		КоличествоОтправленийНеВОтгрузке   = ОтправленияНеВОтгрузке.Количество();
		КоличествоЗаказовВОтгрузке = 0;
		КоличествоЗаказовЗагруженных = 0;
		КоличествоЗаказовНеЗагруженных = 0;
		КоличествоЗаказовНеЗагруженныхОтмененных = 0;
		
		Если ЭтоЯндексМаркет Тогда 
			ЗаказыВОтгрузке.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ИдентификаторыЗаказов);
			ЗаказыЗагруженные.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ЗаказыЗагруженные);
			ЗаказыНеЗагруженные.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ЗаказыНеЗагруженные);
			ЗаказыНеЗагруженныеОтмененные.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ЗаказыНеЗагруженныеОтмененные);
			
			КоличествоЗаказовВОтгрузке = ЗаказыВОтгрузке.Количество();  
			КоличествоЗаказовЗагруженных = ЗаказыЗагруженные.Количество();
			КоличествоЗаказовНеЗагруженных = ЗаказыНеЗагруженные.Количество(); 
			КоличествоЗаказовНеЗагруженныхОтмененных = ЗаказыНеЗагруженныеОтмененные.Количество();
			
		КонецЕсли;
			
		Если ПоказыватьИсключенияОтправлений
			И ИнформацияОбОтгрузке.ОтгрузкаСформирована И КоличествоОтправленийНеВОтгрузке > 0 Тогда
			ДополнениеШаблона = ", " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'исключено %1'"),
				"<a href = ""ОткрытьСписокОтправленийНеВОтгрузке"">%4</a>");
		Иначе
			ДополнениеШаблона = "";
		КонецЕсли;
			
		Если КоличествоОтправленийНезагруженных > 0  Или КоличествоЗаказовНеЗагруженных >0 Тогда
			Если ЭтоЯндексМаркет Тогда 
				Если КоличествоЗаказовНеЗагруженныхОтмененных > 0 Тогда
					СтрокаШаблона = НСтр("ru = 'Список заказов (%2 из %1, не загружено %3, из них отменено %4):'");
				Иначе     
					СтрокаШаблона = НСтр("ru = 'Список заказов (%2 из %1, не загружено %3):'"); 
				КонецЕсли;
			Иначе 
				СтрокаШаблона = НСтр("ru = 'Список отправлений (%2 из %1, не загружено %3%4):'");
			КонецЕсли;
			
			Если ЭтоЯндексМаркет Тогда
				ШаблонСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрокаШаблона,
				"<a href = ""ОткрытьСписокЗаказовВОтгрузке"">%1</a>",
				"<a href = ""ОткрытьСписокЗаказовЗагруженных"">%2</a>",
				"<a href = ""ОткрытьСписокЗаказовНезагруженных"">%3</a>",   
				"<a href = ""ОткрытьСписокЗаказовНезагруженныхОтмененных"">%4</a>",
				ДополнениеШаблона);   			
			Иначе 		
				ШаблонСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрокаШаблона,
				"<a href = ""ОткрытьСписокОтправленийВОтгрузке"">%1</a>",
				"<a href = ""ОткрытьСписокОтправленийЗагруженных"">%2</a>",
				"<a href = ""ОткрытьСписокОтправленийНезагруженных"">%3</a>",  
				ДополнениеШаблона); 
			КонецЕсли;
		ИначеЕсли КоличествоОтправленийВОтгрузке > 0 Тогда   
			Если ЭтоЯндексМаркет Тогда
				СтрокаШаблона = НСтр("ru = 'Список заказов (%1%2):'");
			Иначе 
				СтрокаШаблона = НСтр("ru = 'Список отправлений (%1%2):'");
			КонецЕсли;
			
			Если ЭтоЯндексМаркет Тогда	
				ШаблонСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрокаШаблона,
				"<a href = ""ОткрытьСписокЗаказовВОтгрузке"">%1</a>",
				ДополнениеШаблона);  
			Иначе
				ШаблонСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				СтрокаШаблона,
				"<a href = ""ОткрытьСписокОтправленийВОтгрузке"">%1</a>",
				ДополнениеШаблона);
			КонецЕсли;
		Иначе
			Если ЭтоЯндексМаркет Тогда 
				ШаблонСтроки = НСтр("ru = 'Список заказов:'");
			Иначе 
				ШаблонСтроки = НСтр("ru = 'Список отправлений:'");
			КонецЕсли;
		КонецЕсли;   
		
		Если ЭтоЯндексМаркет Тогда
			Элементы.ЗаголовокСпискаОтправлений.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				КоличествоЗаказовВОтгрузке,
				КоличествоЗаказовЗагруженных,
				КоличествоЗаказовНеЗагруженных,
				КоличествоЗаказовНеЗагруженныхОтмененных);

		Иначе		
			Элементы.ЗаголовокСпискаОтправлений.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				КоличествоОтправленийВОтгрузке,
				КоличествоОтправленийВОтгрузке - КоличествоОтправленийНезагруженных,
				КоличествоОтправленийНезагруженных,
				КоличествоОтправленийНеВОтгрузке);
		КонецЕсли;
	Иначе  
		Если ЭтоЯндексМаркет Тогда
			Элементы.ЗаголовокСпискаОтправлений.Заголовок = НСтр("ru = 'Список заказов:'");
		Иначе
			Элементы.ЗаголовокСпискаОтправлений.Заголовок = НСтр("ru = 'Список отправлений (неутвержденный):'");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстДокументыНаОсновании(ЗаполнитьСсылки = Истина, ОбновитьПодключаемыеКоманды = Ложь)

	ДанныеДокументов = ДанныеДокументовПеревозки(
		ЗаданиеНаПеревозку,
		ТранспортнаяНакладная,
		ИнформацияОбОтгрузке.ИдентификаторОтгрузки,
		ЗаполнитьСсылки);
	
	Если ЗначениеЗаполнено(ДанныеДокументов.ТТН_ТипТС) Тогда
		ТипТранспортногоСредства = ДанныеДокументов.ТТН_ТипТС;
	ИначеЕсли ЗначениеЗаполнено(ДанныеДокументов.ЗаданиеНаПеревозку_ТипТС) Тогда
		ТипТранспортногоСредства = ДанныеДокументов.ЗаданиеНаПеревозку_ТипТС;
	КонецЕсли;
	
	ТекстыПоляДокументыНаОсновании.Очистить();
	
	Если НастройкиСклада <> Неопределено Тогда
		ТипИсполнителя =
			РегистрыСведений.ЗаказыТорговыхПлощадок.ТипИсполнителяЗаданияНаПеревозку(НастройкиСклада.СпособДоставки);
		
		ДоступнаДоставка = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20()
			И (ТипИсполнителя = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.НашаТранспортнаяСлужба
				Или ТипИсполнителя = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик
					И ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
	Иначе
		ДоступнаДоставка = Ложь;
	КонецЕсли;
	
	ДоступенПросмотрДоставки = ПравоДоступа("Просмотр", Метаданные.Документы.ЗаданиеНаПеревозку);
	ДоступнаДоставка = ДоступнаДоставка И ДоступенПросмотрДоставки;
	
	ДоступенПросмотрТТН = ПравоДоступа("Просмотр", Метаданные.Документы.ТранспортнаяНакладная);
	ИспользоватьТТН = ПолучитьФункциональнуюОпцию("ИспользоватьТТН");
	ДоступнаТТН = ИспользоватьТТН И (Не ДоступнаДоставка Или ДоступнаДоставка И ДоступенПросмотрДоставки);
	
	ДоступноДобавлениеТТН       = ДоступенПросмотрТТН И ДоступнаТТН;
	ДоступноДобавлениеПеревозки = ДоступенПросмотрДоставки И ДоступнаДоставка;
	
	Если ДоступноДобавлениеТТН И ДоступноДобавлениеПеревозки Тогда
		ПредставлениеДокументаШаблон = НСтр("ru = 'Оформить задание на перевозку и ТТН'");
		НавигационнаяСсылкаДокументаШаблон = "ОформитьЗаданиеНаПеревозку_";
	ИначеЕсли ДоступноДобавлениеТТН Тогда
		ПредставлениеДокументаШаблон = НСтр("ru = 'Оформить ТТН'");
		НавигационнаяСсылкаДокументаШаблон = "ОформитьТТН_";
	ИначеЕсли ДоступноДобавлениеПеревозки Тогда
		ПредставлениеДокументаШаблон = НСтр("ru = 'Оформить задание на перевозку'");
		НавигационнаяСсылкаДокументаШаблон = "ОформитьЗаданиеНаПеревозку_";
	Иначе
		ПредставлениеДокументаШаблон = "";
		НавигационнаяСсылкаДокументаШаблон = "";
	КонецЕсли;
	
	ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	
	Если ЗначениеЗаполнено(ТранспортнаяНакладная) И ИспользоватьТТН Тогда
		ШапкаДокумента = Новый Структура;
		ШапкаДокумента.Вставить("Дата",  ДанныеДокументов.ТТН_Дата);
		ШапкаДокумента.Вставить("Номер", ДанныеДокументов.ТТН_Номер);
		
		ПредставлениеДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
									ШапкаДокумента,
									НСтр("ru = 'ТТН'"));
			
		Если ДоступенПросмотрТТН И ДоступнаТТН Тогда
			Если Не ДанныеДокументов.ТТН_Проведен Тогда
				ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
			КонецЕсли;
			
			НавигационнаяСсылкаДокумента = "ОткрытьТТН_" + ПолучитьНавигационнуюСсылку(ТранспортнаяНакладная);
		Иначе
			НавигационнаяСсылкаДокумента = "";
		КонецЕсли;
		
	ИначеЕсли ИнформацияОбОтгрузке.ОтгрузкаСформирована
			И ИспользоватьТТН
			И Не ДанныеДокументов.ЗаданиеНаПеревозку_ПометкаУдаления Тогда
		ПредставлениеДокумента = НСтр("ru = 'ТТН не оформлена'");
		НавигационнаяСсылкаДокумента = "";
		
	Иначе
		ПредставлениеДокумента = "";
		НавигационнаяСсылкаДокумента = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеДокумента) Тогда
		ТекстДокументаТТН = "";
	Иначе
		Если ПустаяСтрока(НавигационнаяСсылкаДокумента) Тогда
			ТекстДокументаТТН = ПредставлениеДокумента;
		Иначе
			ТекстДокументаТТН = Новый ФорматированнаяСтрока(ПредставлениеДокумента,, ЦветТекста,, НавигационнаяСсылкаДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Если ДоступнаДоставка
			И ЗначениеЗаполнено(ЗаданиеНаПеревозку)
			И (Не ДанныеДокументов.ЗаданиеНаПеревозку_ПометкаУдаления
				Или Не ПустаяСтрока(ТекстДокументаТТН)) Тогда
		ШапкаДокумента = Новый Структура;
		ШапкаДокумента.Вставить("Дата",  ДанныеДокументов.ЗаданиеНаПеревозку_Дата);
		ШапкаДокумента.Вставить("Номер", ДанныеДокументов.ЗаданиеНаПеревозку_Номер);
		
		ПредставлениеДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
									ШапкаДокумента,
									НСтр("ru = 'Задание на перевозку'"));
		
		Если ДоступнаДоставка Тогда
			Если ДанныеДокументов.ЗаданиеНаПеревозку_Проведен Тогда
				ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
			Иначе
				ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
			КонецЕсли;
			
			НавигационнаяСсылкаДокумента = "ОткрытьЗаданиеНаПеревозку_" + ПолучитьНавигационнуюСсылку(ЗаданиеНаПеревозку);
			ТекстДокумента = Новый ФорматированнаяСтрока(ПредставлениеДокумента,, ЦветТекста,, НавигационнаяСсылкаДокумента);
		Иначе
			ТекстДокумента = ПредставлениеДокумента;
		КонецЕсли;
		
		ТекстыПоляДокументыНаОсновании.Добавить(ТекстДокумента);
		
	ИначеЕсли Не ПустаяСтрока(ТекстДокументаТТН) И ДоступнаДоставка Тогда
		ТекстДокумента = НСтр("ru = 'Задание на перевозку не оформлено'");
		ТекстыПоляДокументыНаОсновании.Добавить(ТекстДокумента);
		
	ИначеЕсли ПустаяСтрока(ТекстДокументаТТН) И Не ПустаяСтрока(НавигационнаяСсылкаДокументаШаблон) Тогда
		ТекстДокумента = Новый ФорматированнаяСтрока(ПредставлениеДокументаШаблон,
			,
			ЦветТекста,
			,
			НавигационнаяСсылкаДокументаШаблон);
		ТекстыПоляДокументыНаОсновании.Добавить(ТекстДокумента);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстДокументаТТН) Тогда
		ТекстыПоляДокументыНаОсновании.Добавить(ТекстДокументаТТН);
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(ТранспортнаяНакладная) Или ЗначениеЗаполнено(ЗаданиеНаПеревозку))
			И ЗначениеЗаполнено(НавигационнаяСсылкаДокументаШаблон)
			И (ДоступнаДоставка И Не ДанныеДокументов.ЗаданиеНаПеревозку_ПометкаУдаления
				Или ИспользоватьТТН И Не ДанныеДокументов.ТТН_ПометкаУдаления) Тогда
		ТекстДокумента =
			СтроковыеФункции.ФорматированнаяСтрока(НСтр("ru='<a href=""%1"" ><img src=""%2"">Перезаполнить</a>'"),
				НавигационнаяСсылкаДокументаШаблон,
				"ЗаполнитьПоОснованию");
		ТекстыПоляДокументыНаОсновании.Добавить(ТекстДокумента);
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.ОбновитьТекстДокументыНаОсновании(ЭтотОбъект);
	
	Элементы.ТипТранспортногоСредства.Видимость = ДоступноДобавлениеПеревозки
		И Элементы.ТекстДокументыНаОсновании.Видимость;
	
	Элементы.УправлениеПрисоединеннымиФайламиОткрытьСписок0.Видимость = ЗначениеЗаполнено(ТранспортнаяНакладная)
		И Не ДанныеДокументов.ТТН_ПометкаУдаления;
	
	Если ОбновитьПодключаемыеКоманды Тогда
		ОбновитьПодменюПечать(ЭтотОбъект);
	КонецЕсли;
	
	ДоступностьПечатныхФорм = ИнформацияОбОтгрузке.ОтгрузкаСформирована И ИнформацияОбОтгрузке.ОтгрузкаАктуальна;
	
	ТипПараметра = Строка(ТипЗнч(ТранспортнаяНакладная));
	
	УстановитьДоступностьПечатныхФорм(
		Элементы,
		ПодключенныеПечатныеФормы,
		ДоступностьПечатныхФорм И ЗначениеЗаполнено(ТранспортнаяНакладная),
		ТипПараметра);
	
	ТипПараметра = Строка(ТипЗнч(ЗаданиеНаПеревозку));
	
	УстановитьДоступностьПечатныхФорм(
		Элементы,
		ПодключенныеПечатныеФормы,
		ДоступностьПечатныхФорм И ЗначениеЗаполнено(ЗаданиеНаПеревозку),
		ТипПараметра);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокКомандыПрисоединенныхФайлов()

	Если Элементы.УправлениеПрисоединеннымиФайламиОткрытьСписок0.Видимость Тогда
		РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, "Запись_Файл");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоТорговойПлощадке(УчетнаяЗапись, ДанныеТорговойПлощадки,
			ИнформацияОбОтгрузкеШаблон, Логотип)

	ДанныеТорговойПлощадки = Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(УчетнаяЗапись);
	ИнформацияОбОтгрузкеШаблон = РегистрыСведений.ЗаказыТорговыхПлощадок.НовыйСписокАтрибутовИнформацииОбОтгрузке(УчетнаяЗапись);
	Логотип = ИнтеграцияСМаркетплейсамиКлиентСервер.ЛоготипТорговойПлощадки(ДанныеТорговойПлощадки.ВидМаркетплейса);

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуМаркетплейса(ВидМаркетплейса)  
	
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ДанныеТорговойПлощадки.ВидМаркетплейса);
	ЭтоOzon = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ДанныеТорговойПлощадки.ВидМаркетплейса);
	
	Если ЭтоOzon Тогда
		
		Элементы.ГруппаСкладОтключен.Видимость = Ложь;
		Элементы.ПанельДоверительнаяПриемкаЯМ.Видимость = Ложь;
		Элементы.УчетнаяЗаписьЗаголовок.Видимость = Истина;
		Элементы.ГруппаИнформацияПоСкладу.Видимость = Истина;
		Элементы.ПанельИнформацииОбОтгрузкеOzon.Видимость = Истина;
		Элементы.ПанельИнформацииОбОтгрузкеЯМ.Видимость = Ложь; 
		Элементы.ИнформацияОПунктеПриема.Заголовок = НСтр("ru = 'Найдите нужный пункт приема, проверьте режим работы, схему проезда и условия прохода на территорию (требования к пропускам и способ их оформления), а также ознакомьтесь со способом получения возвратов.'");
		
		Элементы.ГруппаПечатныеФормыОтгрузкиOzon.Видимость = Истина;
		Элементы.ГруппаПечатныеФормыОтгрузкиЯМ.Видимость = Ложь; 
		Элементы.ОткрытьОформлениеПропусковЯМ.Видимость = Ложь;
		Элементы.ОткрытьСписокОтгрузокЯМ.Видимость = Ложь;
		Элементы.СтраницаОтгрузкаНеЗапланирована.Видимость = Ложь;
		Элементы.ПеренестиЗаказы.Видимость = Ложь;
		Элементы.СписокОбновить.Заголовок = НСтр("ru='Обновить список отправлений'");
		
	ИначеЕсли ЭтоЯндексМаркет Тогда
		
		Элементы.ПанельДоверительнаяПриемкаЯМ.Видимость = Ложь; 
		Элементы.ГруппаСкладОтключен.Видимость = ИнтеграцияСЯндексМаркетСервер.СкладОтключен(УчетнаяЗапись);
		Элементы.УчетнаяЗаписьЗаголовок.Видимость = Ложь;
		Элементы.УчетнаяЗапись.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнформацияПоСкладу.Видимость = Ложь; 
		Элементы.ПанельИнформацииОбОтгрузкеOzon.Видимость = Ложь;
		Элементы.ПанельИнформацииОбОтгрузкеЯМ.Видимость = Истина;
		Элементы.ИнформацияОПунктеПриема.Заголовок = НСтр("ru = 'Перед отгрузкой проверьте режим работы нужного пункта приема, ограничения по весу и объему отгрузки, схему проезда и условия прохода на территорию (требования к пропускам и способ их оформления).'");
		Элементы.ВремяОтгрузки.Видимость = Ложь;
		Элементы.СписокГруппаКомандыПометки.Видимость = Ложь;
		
		Элементы.ГруппаПечатныеФормыОтгрузкиOzon.Видимость = Ложь;
		Элементы.ГруппаПечатныеФормыОтгрузкиЯМ.Видимость = Истина;
		
		Элементы.ГруппаДокументОтгрузки.Видимость = Ложь;
		Элементы.СписокДокументОтгрузки.Видимость = Ложь;
		Элементы.ДополнительныеСведения.Видимость = Ложь;
		Элементы.ОткрытьСписокПропусков.Видимость = Ложь;
		Элементы.СписокПометкаУстановлена.Видимость = Ложь;
		Элементы.СписокПометкаСнята.Видимость = Ложь;
		Элементы.СписокОбновить.Заголовок = НСтр("ru='Обновить список заказов'");
		
		ВозможныеСтатусыОтгрузки = ИнтеграцияСЯндексМаркетСервер.ВозможныеСтатусыОтгрузки(); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСкладаНаКлиенте()
	
	ОчиститьСообщения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗапись",       УчетнаяЗапись);
	ПараметрыФормы.Вставить("Партнер",             ДанныеТорговойПлощадки.Партнер);
	ПараметрыФормы.Вставить("ИдентификаторСклада", ИдентификаторСклада);
	
	ОбработчикЗакрытияФормы = Новый ОписаниеОповещения("ЗавершениеЗаполненияНастроекСпособаДоставки", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.СоответствияОбъектовМаркетплейсов.Форма.НастройкиСклада",
		ПараметрыФормы,
		ЭтотОбъект,
		,,,
		ОбработчикЗакрытияФормы);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСодержимоеТекущейЯчейки(ТекущиеДанные, Поле)

	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтгрузки)
			И (Поле.Имя = "СписокНомерОтправления"
				Или Поле.Имя = "СписокСтатус"
				Или Поле.Имя = "СписокДокументОтгрузки") Тогда
		ПоказатьЗначение(, ТекущиеДанные.ДокументОтгрузки);
		
	Иначе
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыСписка()
	
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УчетнаяЗапись",
		ИнформацияОбОтгрузке.УчетнаяЗапись); 
	Если ЭтоЯндексМаркет Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ИдентификаторСклада",
		ИдентификаторСклада);
	Иначе  
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ИдентификаторСклада",
		ИнформацияОбОтгрузке.ИдентификаторСклада);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ОтправленияВОтгрузке",
		ОтправленияВОтгрузке);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ЭтоУстановкаПометокДляВсехПозиций",
		ЭтоУстановкаПометокДляВсехПозиций);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НомераОтправленийВыбранные",
		ОтправленияДляФлаговВыбранные.ВыгрузитьЗначения());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НомераОтправленийИсключенные",
		ОтправленияДляФлаговИсключенные.ВыгрузитьЗначения());

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Пометка, НомерОтправления = "")

	ОчиститьСообщения();
	
	Если ПустаяСтрока(НомерОтправления) Тогда
		ОтправленияДляФлаговВыбранные.Очистить();
		ОтправленияДляФлаговИсключенные.Очистить();
		ЭтоУстановкаПометокДляВсехПозиций = Пометка;
		
		ОбновитьПараметрыСписка();
		Элементы.Список.Обновить();
	Иначе
		ПараметрыНомераОтправленийВыбранные =
			Список.Параметры.Элементы.Найти("НомераОтправленийВыбранные").Значение;
		ПараметрыНомераОтправленийИсключенные =
			Список.Параметры.Элементы.Найти("НомераОтправленийИсключенные").Значение;
		
		Если Пометка Тогда
			ПозицияУдаления = ОтправленияДляФлаговИсключенные.НайтиПоЗначению(НомерОтправления);
			ИндексПозицииУдаления = ПараметрыНомераОтправленийИсключенные.Найти(НомерОтправления);
			
			Если ПозицияУдаления <> Неопределено Тогда
				ОтправленияДляФлаговИсключенные.Удалить(ПозицияУдаления);
				ПараметрыНомераОтправленийИсключенные.Удалить(ИндексПозицииУдаления);
			Иначе
				ОтправленияДляФлаговВыбранные.Добавить(НомерОтправления);
				ПараметрыНомераОтправленийВыбранные.Добавить(НомерОтправления);
			КонецЕсли;
		Иначе
			ПозицияУдаления = ОтправленияДляФлаговВыбранные.НайтиПоЗначению(НомерОтправления);
			ИндексПозицииУдаления = ПараметрыНомераОтправленийВыбранные.Найти(НомерОтправления);
			
			Если ПозицияУдаления <> Неопределено Тогда
				ОтправленияДляФлаговВыбранные.Удалить(ПозицияУдаления);
				ПараметрыНомераОтправленийВыбранные.Удалить(ИндексПозицииУдаления);
			Иначе
				ОтправленияДляФлаговИсключенные.Добавить(НомерОтправления);
				ПараметрыНомераОтправленийИсключенные.Добавить(НомерОтправления);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам()

	ОбеспечениеВДокументахКлиент.ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам(ЭтотОбъект, Элементы.Список);

КонецПроцедуры

#Область СкладыСлужебные

&НаКлиенте
Процедура ЗаполнитьСписокСкладов()

	Элементы.СкладТорговойПлощадки.СписокВыбора.Очистить();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ЗаполнитьНастройкиСклада();
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыИнформацияПоНастройкамСклада.ТекущаяСтраница = Элементы.ИнформацияПоНастройкамСкладаЗаполняется;
	Элементы.СтраницыВремяОтгрузки.ТекущаяСтраница = Элементы.СтраницаВремяОтгрузкиНеопределено;
	Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиПроверяется;
	Элементы.СтраницыСписокОтгрузок.ТекущаяСтраница = Элементы.СтраницаОбновлениеОтгрузки;
	Элементы.СтраницыОтправленияОтгрузки.ТекущаяСтраница = Элементы.СтраницаОтгрузкаНеСформирована;
	Элементы.СтраницыФоновогоЗадания.ТекущаяСтраница = Элементы.СтраницаФоновогоЗаданияОбновляетсяСписокСкладов;
	
	Элементы.ОбновитьИнформациюОбОтгрузке.Видимость = Ложь;
	Элементы.КомандыГиперссылки.Видимость = Ложь;
	Элементы.ОткрытьНастройкиСклада.Доступность = Ложь;
	Элементы.КоманднаяПанель.Доступность = Ложь;
	
	Элементы.СкладТорговойПлощадки.ПодсказкаВвода = НСтр("ru = '<Заполняется список...>'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучениеСпискаСкладовЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = ЗапуститьПолучениеСпискаСкладов(
		УчетнаяЗапись,
		ДанныеТорговойПлощадки.ВидМаркетплейса,
		УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьПолучениеСпискаСкладов(УчетнаяЗапись, ВидМаркетплейса, Знач УникальныйИдентификатор = Неопределено)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне              = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1. Получение списка складов.'"),
		ИнтеграцияСМаркетплейсамиПовтИсп.ПредставлениеВидаТорговойПлощадки(ВидМаркетплейса));
	
	ИмяМетода = "ИнтеграцияСМаркетплейсамиСервер.ПолучитьСкладыСервиса";
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		ИмяМетода,
		ВидМаркетплейса,
		УчетнаяЗапись);

КонецФункции

&НаКлиенте
Процедура ПолучениеСпискаСкладовЗавершение(РезультатЗадания, ДополнительныеПараметры = Неопределено) Экспорт

	ОчиститьСообщения();
	
	Элементы.СкладТорговойПлощадки.СписокВыбора.Очистить();
	СписокМетодовДоставки = Неопределено;
	
	Если РезультатЗадания <> Неопределено
			И РезультатЗадания.Статус = "Выполнено" Тогда
		Ошибка = ЗаполнитьСписокСкладовИМетодовДоставки(РезультатЗадания.АдресРезультата);
		
		ИнтеграцияСМаркетплейсамиКлиент.ВывестиСостояние(Ошибка, Неопределено, Истина, Элементы.Логотип.Картинка);
		
	Иначе
		ШаблонОшибки = НСтр("ru = 'Не удалось получить склады учетной записи ""%1"" по причине: %2'");
		ПредставлениеНеизвестнойОшибки = НСтр("ru = 'Неизвестная ошибка выполнения операции'");
		ПодробноеПредставлениеОшибки = ?(РезультатЗадания = Неопределено,
			ПредставлениеНеизвестнойОшибки,
			РезультатЗадания.ПодробноеПредставлениеОшибки);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			УчетнаяЗапись,
			ПодробноеПредставлениеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		ОпределитьСкладПоУмолчанию();
	КонецЕсли;
	
	Если Элементы.СкладТорговойПлощадки.СписокВыбора.Количество() = 0 Тогда
		Элементы.СкладТорговойПлощадки.ПодсказкаВвода = НСтр("ru = '<Не удалось получить список складов>'");
	Иначе
		Элементы.СкладТорговойПлощадки.ПодсказкаВвода = НСтр("ru = '<Необходимо выбрать склад>'");
	КонецЕсли;
	
	ЗаполнитьНастройкиСклада();
	
	ПолучитьИнформациюОбОтгрузке();

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокСкладовИМетодовДоставки(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат = Неопределено Тогда
		Возврат ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка();
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСервер.ЗаполнитьСписокСкладовИМетодовДоставки(
		ДанныеТорговойПлощадки.ВидМаркетплейса,
		Результат.ТаблицаСкладов,
		Элементы.СкладТорговойПлощадки.СписокВыбора,
		СписокМетодовДоставки);
	
	Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада)
			И Элементы.СкладТорговойПлощадки.СписокВыбора.НайтиПоЗначению(ИнформацияОбОтгрузке.ИдентификаторСклада) = Неопределено Тогда
		Элементы.СкладТорговойПлощадки.СписокВыбора.Вставить(
			0,
			ИнформацияОбОтгрузке.ИдентификаторСклада,
			НСтр("ru = '<Неизвестный склад>'"));
	КонецЕсли;
	
	Возврат Результат.Ошибка; // ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка

КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияНастроекСпособаДоставки(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	ЗаполнитьНастройкиСклада();

КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСкладПоУмолчанию()

	Если ПустаяСтрока(ИдентификаторСклада) Тогда
		Если Элементы.СкладТорговойПлощадки.СписокВыбора.Количество() > 1 Тогда
			КоличествоАктивныхСкладов = 0;
			
			Если СписокМетодовДоставки <> Неопределено Тогда
				Для Каждого МетодДоставки Из СписокМетодовДоставки Цикл
					Если МетодДоставки.Значение.АктивныйСклад Тогда
						ИдентификаторСклада = СтрЗаменить(МетодДоставки.Ключ, "Склад_", "");
						КоличествоАктивныхСкладов = КоличествоАктивныхСкладов + 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если КоличествоАктивныхСкладов > 1 Тогда
				ИдентификаторСклада = "";
			КонецЕсли;
		ИначеЕсли Элементы.СкладТорговойПлощадки.СписокВыбора.Количество() > 0 Тогда
			ИдентификаторСклада = Элементы.СкладТорговойПлощадки.СписокВыбора[0];
		КонецЕсли;
	КонецЕсли;
	
	ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада = ИдентификаторСклада;
	ИнформацияОбОтгрузке.ИдентификаторСклада = ИдентификаторСклада;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиСклада()

	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Или ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада) Тогда
		ВремяОтгрузки = Дата(1,1,1);
		
		НастройкиСклада = Неопределено;
		МетодДоставки = Неопределено;
		ИнформацияОбОтгрузкеШаблон.ИдентификаторМетодаДоставки = "";
		
		ИнформацияПоСкладу = НСтр("ru = 'Настройки способа доставки не определены, т.к не выбран склад.'");
		ИнформацияОбАктуальностиНастроекСклада = "";
	Иначе
		НастройкиСклада = НастройкиСклада(УчетнаяЗапись, ИнформацияОбОтгрузке.ИдентификаторСклада);
		
		Если ПустаяСтрока(НастройкиСклада.ПредставлениеСпособаДоставки) Тогда
			ИнформацияПоСкладу = НСтр("ru = 'Не заданы настройки способа доставки.'");
			ИнформацияОбАктуальностиНастроекСклада = "";
		Иначе
			Если ЗначениеЗаполнено(НастройкиСклада.ПеревозчикПартнер)
					И Не ПустаяСтрока(НастройкиСклада.АдресДоставкиПеревозчика) Тогда
				Шаблон = НСтр("ru = '%1 %2 по адресу: %3.'");
			Иначе
				Шаблон = НСтр("ru = '%1 %2.'");
			КонецЕсли;
			
			ИнформацияПоСкладу = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				Шаблон,
				НастройкиСклада.ПредставлениеСпособаДоставки,
				НастройкиСклада.ПеревозчикПартнер,
				НастройкиСклада.АдресДоставкиПеревозчика);
			
			ИнформацияОбАктуальностиНастроекСклада = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Настройки способа доставки установлены %1.'"),
				НастройкиСклада.ДатаАктуальности) + " ";
		КонецЕсли;
		
		МетодДоставки = Неопределено;
		
		Если СписокМетодовДоставки <> Неопределено Тогда
			КлючСклада = "Склад_" + ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада;
			ИскомыйМетодДоставки = Новый Структура(КлючСклада, Неопределено);
			ЗаполнитьЗначенияСвойств(ИскомыйМетодДоставки, СписокМетодовДоставки);
			
			МетодДоставки = ИскомыйМетодДоставки[КлючСклада];
		КонецЕсли;
		
		Если МетодДоставки <> Неопределено Тогда
			Если ПустаяСтрока(МетодДоставки.ИдентификаторМетодаДоставки) Тогда
				МетодДоставки.ИдентификаторМетодаДоставки = ИнформацияОбОтгрузкеШаблон.ИдентификаторСклада;
			КонецЕсли;
			
			ИнформацияОбОтгрузкеШаблон.ИдентификаторМетодаДоставки = МетодДоставки.ИдентификаторМетодаДоставки;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИнформацияОбОтгрузке.ИдентификаторОтгрузки)
				И МетодДоставки <> Неопределено Тогда
			ВремяОтгрузки = МетодДоставки.ВремяОтгрузки;
			ВремяОтгрузкиРекомендуемое = МетодДоставки.ВремяОтгрузкиРекомендуемое;
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбАктуальностиНастроекСклада) Тогда
		Элементы.ИнформацияОНастройкахСклада.Подсказка =
			НСтр("ru = 'Перед формированием отгрузки заполните настройки способа доставки (способ доставки, перевозчик, адрес пункта приема) в соответствии с настройками склада в личном кабинете.'");
	Иначе
		Элементы.ИнформацияОНастройкахСклада.Подсказка = ИнформацияОбАктуальностиНастроекСклада
			+ НСтр("ru = 'Перед формированием отгрузки проверьте, что установленные настройки (способ доставки, перевозчик, адрес пункта приема) соответствуют настройкам склада в личном кабинете.'");
	КонецЕсли;
	
	ИзменитьПоведениеФормыНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиСклада(УчетнаяЗапись, ИдентификаторСклада)

	Возврат ИнтеграцияСМаркетплейсамиСервер.НастройкиСклада(УчетнаяЗапись, ИдентификаторСклада);

КонецФункции

#КонецОбласти

#Область ФормированиеОтгрузкиСлужебные

&НаКлиенте
Процедура ОчиститьИнформациюОбОтгрузке(ОбновитьДатуОтгрузки = Ложь)

	ДатаСеанса = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	
	Если ОбновитьДатуОтгрузки Тогда
		ДатаОтгрузки = ДатаСеанса;
	КонецЕсли;
	
	Статус = "";
	КоличествоГрузовыхМест = 0;
	ИдентификаторОтгрузки = "";
	НачалоПлановогоИнтервала = Дата(1,1,1);
	ВремяОтгрузкиРекомендуемое = Дата(1,1,1);
	
	Если МетодДоставки <> Неопределено Тогда
		ВремяОтгрузки = МетодДоставки.ВремяОтгрузки;
		ВремяОтгрузкиРекомендуемое = МетодДоставки.ВремяОтгрузкиРекомендуемое;
	КонецЕсли;
	
	ИнформацияОбОтгрузке = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ИнформацияОбОтгрузкеШаблон);
	
	Отгрузки.Очистить();
	ОтправленияВОтгрузке.Очистить();
	ОтправленияЗагруженные.Очистить();
	ОтправленияНеВОтгрузке.Очистить();
	ОтправленияНезагруженные.Очистить();
	ЗаказыВОтгрузке.Очистить();
	ЗаказыЗагруженные.Очистить();
	ЗаказыНеЗагруженные.Очистить();
	ЗаказыНеЗагруженныеОтмененные.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИнформациюОбОтгрузке(ЗаполнитьСвязьСОтгрузкой = Ложь)

	ДоступнаДоставка = ДоставкаТоваровКлиентСервер.ИспользуетсяДоставка20();
	
	Если ЗаполнитьСвязьСОтгрузкой
			И Не ИнформацияОбОтгрузке.МожноРедактировать
			И ОтправленияВОтгрузке.Количество() > 0
			И ДоступнаДоставка Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ЗаполнитьСвязьСОтгрузкой", ЗаполнитьСвязьСОтгрузкой);
		
		ОбработчикОповещения = Новый ОписаниеОповещения(
			"ОбработкаОтветаПродолженияПолученияИнформацииОбОтгрузке",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		ЗадатьВопросОбИзмененииНастроекСпособаДоставки(ОбработчикОповещения);
	Иначе
		ПродолжитьПолучениеИнформацииОбОтгрузке(ЗаполнитьСвязьСОтгрузкой);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросОбИзмененииНастроекСпособаДоставки(ОповещениеПослеВопроса)
	
	ОтветНаВопрос = КодВозвратаДиалога.Да;
	
	Если ОтправленияВОтгрузке.Количество() > 0 Тогда
		НомераОтправлений = ПолучитьОтправленияДляПерезаполненияНастроекДоставки(ИнформацияОбОтгрузке, НастройкиСклада);
		
		Если ЗначениеЗаполнено(НомераОтправлений) Тогда
			ШаблонСообщения = НСтр("ru = ';%1 номер отправления;;%1 номера отправления;%1 номеров отправлений;'");
			
			НомераОтправленийДляВывода = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭлементыМассиваДляВыводаСообщений(
				НомераОтправлений,
				ШаблонСообщения);
			
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В соответствии с текущими настройками склада будут изменены настройки способа доставки для документов отправлений: %1, если не отменены.
							|
							|Продолжить?'"),
				СтрСоединить(НомераОтправленийДляВывода, ", "));
				
			ОтветНаВопрос = Ждать ВопросАсинх(
				ТекстВопроса,
				РежимДиалогаВопрос.ДаНет,
				60,
				КодВозвратаДиалога.Да, ,
				КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеПослеВопроса, ОтветНаВопрос);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтправленияДляПерезаполненияНастроекДоставки(ИнформацияОбОтгрузке, НастройкиСклада)

	НомераОтправленийДляЗаменыНастроекСклада = Новый Массив;
	
	ПерезаполняемыеОтправления =
		РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьОтправленияДляПерезаполненияНастроекДоставки(
			ИнформацияОбОтгрузке,
			НастройкиСклада,
			Не ИнформацияОбОтгрузке.МожноРедактировать);
	
	Для Каждого ПерезаполняемоеОтправление Из ПерезаполняемыеОтправления Цикл
		НомераОтправленийДляЗаменыНастроекСклада.Добавить(ПерезаполняемоеОтправление.Ключ);
	КонецЦикла;
	
	Возврат НомераОтправленийДляЗаменыНастроекСклада;

КонецФункции

// Обработка ответа на вопрос.
// 
// Параметры:
//   Ответ - КодВозвратаДиалога
//   ДополнительныеПараметры - Структура:
//     * ЗаполнитьСвязьСОтгрузкой - Булево
//
&НаКлиенте
Процедура ОбработкаОтветаПродолженияПолученияИнформацииОбОтгрузке(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПродолжитьПолучениеИнформацииОбОтгрузке(ДополнительныеПараметры.ЗаполнитьСвязьСОтгрузкой);
	КонецЕсли;

КонецПроцедуры

// Обработка ответа на вопрос.
// 
// Параметры:
//   Ответ - КодВозвратаДиалога
//   ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Процедура ПослеВопросаОбИзмененииНастроекСпособаДоставкиПередПодтверждениемОтгрузки(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПодтвердитьОтгрузку();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеИнформацииОбОтгрузке(ЗаполнитьСвязьСОтгрузкой = Ложь)

	ДлительнаяОперация = ЗапуститьЗаданиеПоОтгрузке("ИнформацияОбОтгрузке", ЗаполнитьСвязьСОтгрузкой);
	
	ОчиститьИнформациюОбОтгрузке();
	
	ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, "ПолучениеИнформацииОбОтгрузкеЗавершение");

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФормированиеОтгрузки()

	ДлительнаяОперация = ЗапуститьЗаданиеПоОтгрузке("СформироватьОтгрузку");
	
	ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, "ПолучениеИнформацииОбОтгрузкеЗавершение");

КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтгрузку()

	КоличествоОтправленийВОтгрузке = ОтправленияВОтгрузке.Количество();
	КоличествоОтправленийНезагруженных = ОтправленияНезагруженные.Количество();
	
	Если КоличествоОтправленийВОтгрузке = КоличествоОтправленийНезагруженных Тогда
		ОбработчикОповещения = Новый ОписаниеОповещения("ОбработкаОтветаПродолженияПодтвержденияОтгрузки", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'В состав отгрузки войдут все незагруженные отправления.
								|
								|Продолжить подтверждение отгрузки?'");
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	Иначе
		ПродолжитьПодтверждениеОтгрузки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработка ответа на вопрос.
// 
// Параметры:
//   Ответ                   - КодВозвратаДиалога - ответ.
//   ДополнительныеПараметры - Неопределено, Структура из КлючИЗначение - дополнительные параметры.
//
Процедура ОбработкаОтветаПродолженияПодтвержденияОтгрузки(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		СписокНезагруженныхОтправлений =
			ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ИнформацияОбОтгрузке.ОтправленияНезагруженные);
		ИнформацияОбОтгрузке.ОтправленияНезагруженные = Новый Массив;
		
		ПродолжитьПодтверждениеОтгрузки();
		
		ИнформацияОбОтгрузке.ОтправленияНезагруженные = СписокНезагруженныхОтправлений;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПодтверждениеОтгрузки()

	ДлительнаяОперация = ЗапуститьЗаданиеПоОтгрузке("ПодтвердитьОтгрузку");
	
	ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, "ПолучениеИнформацииОбОтгрузкеЗавершение");

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтменуОтгрузки()

	ДлительнаяОперация = ЗапуститьЗаданиеПоОтгрузке("ОтменитьОтгрузку");
	
	ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, "ПолучениеИнформацииОбОтгрузкеЗавершение");

КонецПроцедуры

&НаСервере
Функция ЗапуститьЗаданиеПоОтгрузке(ИмяЗадания, ЗаполнитьСвязьСОтгрузкой = Истина)

	ДлительнаяОперация = Неопределено;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись)
			Или ((МетодДоставки = Неопределено
					Или ПустаяСтрока(МетодДоставки.ИдентификаторМетодаДоставки))
						И ДанныеТорговойПлощадки.ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon")) Тогда
		ИзменитьПоведениеФормыНаСервере();
		Возврат ДлительнаяОперация;
	КонецЕсли;
	
	ОбновляетсяИнформацияОбОтгрузке = Истина;
	
	ИнформацияОбОтгрузке.ДатаВыполнения = НачалоДня(ДатаОтгрузки);
	
	Заголовок = ПредставлениеОтгрузки(ИнформацияОбОтгрузке);
	Элементы.ЗаголовокСпискаОтгрузок.Заголовок = "";
	
	Элементы.СтраницыВремяОтгрузки.ТекущаяСтраница = Элементы.СтраницаВремяОтгрузкиНеопределено;
	Элементы.СтраницыСтатусОтгрузки.ТекущаяСтраница = Элементы.СтраницаСтатусОтгрузкиПроверяется;
	Элементы.СтраницыОтправленияОтгрузки.ТекущаяСтраница = Элементы.СтраницаОтгрузкаНеСформирована;
	Элементы.СтраницыСписокОтгрузок.ТекущаяСтраница = Элементы.СтраницаОбновлениеОтгрузки;
	Элементы.СтраницыФоновогоЗадания.ТекущаяСтраница = Элементы.СтраницаФоновогоЗаданияОбновляетсяОтгрузка;
	Элементы.СтраницыДоступаКГрузовымМестам.ТекущаяСтраница = Элементы.СтраницаГрузовыеМестаТолькоПросмотр;
	
	Элементы.ОбновитьИнформациюОбОтгрузке.Видимость = Ложь;
	Элементы.КомандыГиперссылки.Видимость = Ложь;
	Элементы.ОткрытьНастройкиСклада.Доступность = Ложь;
	Элементы.КоманднаяПанель.Доступность = Ложь;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПредставлениеВидаТорговойПлощадки =
		ИнтеграцияСМаркетплейсамиПовтИсп.ПредставлениеВидаТорговойПлощадки(ДанныеТорговойПлощадки.ВидМаркетплейса);
	
	Если ИмяЗадания = "СформироватьОтгрузку" Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1. Формирование отгрузки.'"),
			ПредставлениеВидаТорговойПлощадки);
		
		ИмяМетода = "РегистрыСведений.ЗаказыТорговыхПлощадок.СформироватьОтгрузку";
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяМетода,
			ИнформацияОбОтгрузке.УчетнаяЗапись,
			МетодДоставки,
			ИнформацияОбОтгрузке.ДатаВыполнения,
			КоличествоГрузовыхМест);
		
	ИначеЕсли ИмяЗадания = "ИнформацияОбОтгрузке" Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1. Получение информации об отгрузке.'"),
			ПредставлениеВидаТорговойПлощадки);
		
		ИмяМетода = "РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьИнформациюОбОтгрузке";
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяМетода,
			ИнформацияОбОтгрузке.УчетнаяЗапись,
			МетодДоставки,
			ИнформацияОбОтгрузке.ДатаВыполнения,
			ИнформацияОбОтгрузке.ИдентификаторОтгрузки,
			Истина,
			ЗаполнитьСвязьСОтгрузкой);
		
	ИначеЕсли ИмяЗадания = "ПодтвердитьОтгрузку" Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1. Подтверждение отгрузки и ее состава.'"),
			ПредставлениеВидаТорговойПлощадки);
		
		ИмяМетода = "РегистрыСведений.ЗаказыТорговыхПлощадок.ПодтвердитьОтгрузку";
		
		СписокОтправленийВОтгрузке = СписокОтправленийДляПодтвержденияОтгрузки(
			ИнформацияОбОтгрузке,
			ЭтоУстановкаПометокДляВсехПозиций,
			ОтправленияДляФлаговВыбранные,
			ОтправленияДляФлаговИсключенные);
		
		Если СписокОтправленийВОтгрузке.Количество() = 0 Тогда
			ИзменитьПоведениеФормыНаСервере();
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбраны отправления для подтверждения отгрузки.'"));
			Возврат ДлительнаяОперация;
		КонецЕсли;
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяМетода,
			ИнформацияОбОтгрузке.УчетнаяЗапись,
			МетодДоставки,
			ИнформацияОбОтгрузке.ИдентификаторОтгрузки,
			СписокОтправленийВОтгрузке,
			КоличествоГрузовыхМест);
		
	ИначеЕсли ИмяЗадания = "ОтменитьОтгрузку" Тогда
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1. Отмена отгрузки.'"),
			ПредставлениеВидаТорговойПлощадки);
		
		ИмяМетода = "РегистрыСведений.ЗаказыТорговыхПлощадок.ОтменитьОтгрузку";
		
		ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(
			ПараметрыВыполнения,
			ИмяМетода,
			ИнформацияОбОтгрузке.УчетнаяЗапись,
			МетодДоставки,
			ИнформацияОбОтгрузке.ИдентификаторОтгрузки);
		
	КонецЕсли;
	
	Возврат ДлительнаяОперация;

КонецФункции

&НаКлиенте
Процедура ОжидатьЗавершениеДлительнойОперации(ДлительнаяОперация, ИмяПроцедурыЗавершения)

	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения(ИмяПроцедурыЗавершения, ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		ОбновляетсяИнформацияОбОтгрузке = Ложь;
	КонецЕсли;
	
	ОбновитьПараметрыСписка();

КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокОтправленийДляПодтвержденияОтгрузки(ИнформацияОбОтгрузке, ЭтоУстановкаПометокДляВсехПозиций,
			ОтправленияДляФлаговВыбранные, ОтправленияДляФлаговИсключенные)

	Если ОтправленияДляФлаговВыбранные.Количество() > 0 Тогда
		СписокОтправленийВОтгрузке = ОтправленияДляФлаговВыбранные.ВыгрузитьЗначения();
	ИначеЕсли ЭтоУстановкаПометокДляВсехПозиций Тогда
		СписокОтправленийВОтгрузке = ОбщегоНазначения.СкопироватьРекурсивно(ИнформацияОбОтгрузке.ОтправленияВОтгрузке);
		Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки)
				И ИнформацияОбОтгрузке.ОтправленияВПланеОтгрузки.Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				СписокОтправленийВОтгрузке,
				ИнформацияОбОтгрузке.ОтправленияВПланеОтгрузки,
				Истина);
		КонецЕсли;
		
		Если ОтправленияДляФлаговИсключенные.Количество() > 0 Тогда
			СписокОтправленийВОтгрузке = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
				СписокОтправленийВОтгрузке,
				ОтправленияДляФлаговИсключенные.ВыгрузитьЗначения());
		КонецЕсли;
	Иначе
		СписокОтправленийВОтгрузке = Новый Массив;
	КонецЕсли;
	
	СписокОтправленийВОтгрузке = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СписокОтправленийВОтгрузке);
	
	Если ИнформацияОбОтгрузке.ОтправленияОтмененные.Количество() > 0 Тогда
		СписокОтправленийВОтгрузке = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			СписокОтправленийВОтгрузке,
			ИнформацияОбОтгрузке.ОтправленияОтмененные);
	КонецЕсли;
	
	Если ИнформацияОбОтгрузке.ОтправленияНезагруженные.Количество() > 0 Тогда
		СписокОтправленийВОтгрузке = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			СписокОтправленийВОтгрузке,
			ИнформацияОбОтгрузке.ОтправленияНезагруженные);
	КонецЕсли;
	
	Возврат СписокОтправленийВОтгрузке;

КонецФункции

&НаКлиенте
// Обработка результата выполнения фонового задания.
// 
// Параметры:
//   РезультатЗадания        - Неопределено, Структура из см. ДлительныеОперации.ВыполнитьФункцию.ИмяФункции
//   ДополнительныеПараметры - Неопределено, Структура из КлючИЗначение - дополнительные параметры.
//
Процедура ПолучениеИнформацииОбОтгрузкеЗавершение(РезультатЗадания, ДополнительныеПараметры = Неопределено) Экспорт

	Если РезультатЗадания <> Неопределено
			И РезультатЗадания.Статус = "Выполнено" Тогда
		ОбработатьПолучениеИнформацииОбОтгрузке(РезультатЗадания.АдресРезультата);
		
		ИнтеграцияСМаркетплейсамиКлиент.ВывестиСостояние(ИнформацияОбОтгрузке.Ошибка, Неопределено, Истина);
		
		Оповестить("МП_ОбновлениеСведенийПоЗаказамИОтправлениям");
	Иначе
		ИзменитьПоведениеФормыНаСервере();
	КонецЕсли;
	
	ОбновитьПараметрыСписка();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаАктуальности",
		ОбщегоНазначенияКлиент.ДатаСеанса());
	
	ОбновитьЗаголовокКомандыПрисоединенныхФайлов();
	
	ОбновляетсяИнформацияОбОтгрузке = Ложь;

КонецПроцедуры

&НаСервере
Процедура ОбработатьПолучениеИнформацииОбОтгрузке(АдресРезультата = "")

	Если Не ПустаяСтрока(АдресРезультата) Тогда
		ИнформацияОбОтгрузке = ПолучитьИзВременногоХранилища(АдресРезультата);
		УдалитьИзВременногоХранилища(АдресРезультата);
	КонецЕсли;
	
	Если ИнформацияОбОтгрузке.ОтгрузкаОтменена
			И ИнформацияОбОтгрузке.ОтправленияПривязанныеКОтгрузке.Количество() = 0 Тогда
		Результат = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			ИнформацияОбОтгрузке.ОтправленияВОтгрузке,
			ИнформацияОбОтгрузке.ОтправленияНезагруженные);
		
		Если Результат.Количество() = 0 И Не ЭтоПовторныйЗапрос Тогда
			ПоляЗаполнения = "АдресПунктаПриема, ВремяОтгрузкиРекомендуемое, ВремяПриемаНачало, ВремяПриемаОкончание,
							|КоличествоОтправленийВОтгрузке, КоличествоОтправленийВСборке, КоличествоСобранныхОтправлений";
			
			ИнформацияОбОтгрузкеНов = ОбщегоНазначения.СкопироватьРекурсивно(ИнформацияОбОтгрузкеШаблон);
			ЗаполнитьЗначенияСвойств(ИнформацияОбОтгрузкеНов, ИнформацияОбОтгрузке, ПоляЗаполнения);
			
			ИнформацияОбОтгрузке = ИнформацияОбОтгрузкеНов;
		КонецЕсли;
	КонецЕсли;
	
	Если ИнформацияОбОтгрузкеШаблон.ИдентификаторМетодаДоставки = ИнформацияОбОтгрузке.ИдентификаторМетодаДоставки Тогда
		ИнформацияОбОтгрузкеШаблон.СмещениеЧасовогоПояса = ИнформацияОбОтгрузке.СмещениеЧасовогоПояса;
	КонецЕсли;
	
	ЭтоПовторныйЗапрос     = ИнформацияОбОтгрузке.ПовторитьЗапрос;
	КоличествоГрузовыхМест = ИнформацияОбОтгрузке.КоличествоГрузовыхМест;
	МассаБрутто            = ИнформацияОбОтгрузке.МассаБрутто;
	МассаНетто             = ИнформацияОбОтгрузке.МассаНетто;
	Статус                 = ИнформацияОбОтгрузке.Статус; 
	ИдентификаторОтгрузки  = ИнформацияОбОтгрузке.ИдентификаторОтгрузки;
	
	Если ИнформацияОбОтгрузке.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
		НачалоПлановогоИнтервала = ИнформацияОбОтгрузке.ВремяПриемаНачало;
		ВремяОтгрузкиРекомендуемое = ИнформацияОбОтгрузке.ВремяПриемаОкончание;
	КонецЕсли;
	
	Если ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторСклада) Тогда
		ЗаполнитьЗначенияСвойств(ИнформацияОбОтгрузке, ИнформацияОбОтгрузкеШаблон,
			"ИдентификаторСклада");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОтгрузке.ДатаВыполнения) Тогда
		ДатаОтгрузки = ИнформацияОбОтгрузке.ДатаВыполнения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОтгрузке.СрокОтгрузки)
			Или ЗначениеЗаполнено(ИнформацияОбОтгрузке.ВремяОтгрузкиРекомендуемое) Тогда
		ВремяОтгрузки = Дата(1,1,1) + (ИнформацияОбОтгрузке.СрокОтгрузки - НачалоДня(ИнформацияОбОтгрузке.СрокОтгрузки));
		ВремяОтгрузкиРекомендуемое = ИнформацияОбОтгрузке.ВремяОтгрузкиРекомендуемое;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИнформацияОбОтгрузке.АдресПунктаПриема) Тогда
		Шаблон = НСтр("ru = 'Отгрузка в пункт приема %1 по адресу: %3'");
		
		Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ВремяПриемаНачало)
				И Не ПустаяСтрока(ИнформацияОбОтгрузке.ВремяПриемаОкончание) Тогда
			ШаблонВремени = " " +НСтр("ru = 'с %1 до %2'");
		ИначеЕсли Не ПустаяСтрока(ИнформацияОбОтгрузке.ВремяПриемаНачало) Тогда
			ШаблонВремени = " " +НСтр("ru = 'с %1'");
		ИначеЕсли Не ПустаяСтрока(ИнформацияОбОтгрузке.ВремяПриемаОкончание) Тогда
			ШаблонВремени = " " +НСтр("ru = 'до %2'");
		Иначе
			ШаблонВремени = "";
		КонецЕсли;
		
		Шаблон = СтрЗаменить(Шаблон, " %1", ШаблонВремени);
	Иначе
		Шаблон = "";
	КонецЕсли;
	
	Элементы.АдресДоставки.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон,
		ИнформацияОбОтгрузке.ВремяПриемаНачало,
		ИнформацияОбОтгрузке.ВремяПриемаОкончание,
		ИнформацияОбОтгрузке.АдресПунктаПриема);
	
	СписокОтправленийВОтгрузке = ОбщегоНазначения.СкопироватьРекурсивно(ИнформацияОбОтгрузке.ОтправленияВОтгрузке);
	Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки)
			И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			СписокОтправленийВОтгрузке,
			ИнформацияОбОтгрузке.ОтправленияВПланеОтгрузки,
			Истина);
		
		Если ИнформацияОбОтгрузке.ОтгрузкаАктуальна И Не ИнформацияОбОтгрузке.ПовторитьЗапрос Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				СписокОтправленийВОтгрузке,
				ИнформацияОбОтгрузке.ОтправленияНеВОтгрузке,
				Истина);
		КонецЕсли;
	КонецЕсли;
	
	ОтправленияВОтгрузке.ЗагрузитьЗначения(СписокОтправленийВОтгрузке);
	ОтправленияНезагруженные.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ОтправленияНезагруженные);
	ОтправленияЗагруженные.ЗагрузитьЗначения(ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ИнформацияОбОтгрузке.ОтправленияВОтгрузке,
		ИнформацияОбОтгрузке.ОтправленияНезагруженные));
	ОтправленияНеВОтгрузке.ЗагрузитьЗначения(ИнформацияОбОтгрузке.ОтправленияНеВОтгрузке);
	
	СписокОтправленийИсключенных = ОбщегоНазначения.СкопироватьРекурсивно(ИнформацияОбОтгрузке.ОтправленияОтмененные);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		СписокОтправленийИсключенных,
		ИнформацияОбОтгрузке.ОтправленияНеВОтгрузке,
		Истина);
	
	ЗаполнитьСписокОтгрузок(Отгрузки, ИнформацияОбОтгрузке);
	
	ЭтоУстановкаПометокДляВсехПозиций = Истина;
	ОтправленияДляФлаговВыбранные.Очистить();
	ОтправленияДляФлаговИсключенные.Очистить();
	
	ОтправленияДляФлаговИсключенные.ЗагрузитьЗначения(СписокОтправленийИсключенных);
	
	СообщенияПользователюПоСостояниюОтгрузки(ИнформацияОбОтгрузке, ИнформацияОбОтгрузкеШаблон.МожноРедактировать);
	
	ИзменитьПоведениеФормыНаСервере();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщенияПользователюПоСостояниюОтгрузки(ИнформацияОбОтгрузке, ТребуетсяПодтверждениеОтгрузки)

	СписокСообщений = Новый Массив;
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса);
	Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		Если ИнформацияОбОтгрузке.ОтгрузкаАктуальна Тогда
			Если Не ИнформацияОбОтгрузке.МожноРедактировать И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда
				Если ЭтоЯндексМаркет Тогда
					ТекстСообщения = НСтр("ru = 'Отгрузка еще не сформирована на торговой площадке. Обновите информацию после окончания срока приема заказов в отгрузку.'");
				Иначе 
					ТекстСообщения = НСтр("ru = 'Отгрузка обрабатывается на торговой площадке. Обновите информацию через некоторое время.'");
				КонецЕсли;
				СписокСообщений.Добавить(ТекстСообщения);
			ИначеЕсли ИнформацияОбОтгрузке.ОтгрузкаСформирована
					И ИнформацияОбОтгрузке.ОтправленияНезагруженные.Количество() = 0
					И ИнформацияОбОтгрузке.ОтправленияВОтгрузке.Количество() <> ИнформацияОбОтгрузке.ОтправленияПривязанныеКОтгрузке.Количество()
					И Не ЭтоЯндексМаркет Тогда
				СписокСообщений.Добавить(НСтр("ru = 'Обнаружены не связанные с отгрузкой отправления. Обновите информацию для заполнения связи отправлений с текущей отгрузкой.'"));
			КонецЕсли;
		ИначеЕсли ИнформацияОбОтгрузке.ОтгрузкаОтменена Тогда
			Если ИнформацияОбОтгрузке.ОтправленияПривязанныеКОтгрузке.Количество() > 0 Тогда
				СписокСообщений.Добавить(НСтр("ru = 'Отгрузка отменена. Обновите статусы заказов (в подменю ""Действия""), т.к. они могли быть переданы в доставку другой отгрузкой.'"));
			ИначеЕсли ИнформацияОбОтгрузке.ОтправленияВОтгрузке.Количество() <> ИнформацияОбОтгрузке.ОтправленияНезагруженные.Количество() Тогда
				Если ТребуетсяПодтверждениеОтгрузки Тогда
					СписокСообщений.Добавить(НСтр("ru = 'Отгрузка отменена. Доступно формирование новой отгрузки.'"));
				Иначе
					СписокСообщений.Добавить(НСтр("ru = 'Отгрузка отменена. Для возможности формирования новой отгрузки обновите информацию.'"));
				КонецЕсли;
			ИначеЕсли ИнформацияОбОтгрузке.ОтправленияВОтгрузке.Количество() > 0 Тогда
				СписокСообщений.Добавить(НСтр("ru = 'Отгрузка отменена. Доступно формирование новой отгрузки.'"));
			КонецЕсли;
		ИначеЕсли ИнформацияОбОтгрузке.ПовторитьЗапрос Тогда
			СписокСообщений.Добавить(НСтр("ru = 'Отгрузка обрабатывается на торговой площадке. Обновите информацию через некоторое время.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) И Не ИнформацияОбОтгрузке.ОтгрузкаСформирована Тогда 		
		Если Не ЭтоЯндексМаркет Тогда
			Если ИнформацияОбОтгрузке.ПовторитьЗапрос Тогда
				Если Не ТребуетсяПодтверждениеОтгрузки Тогда
					СписокСообщений.Добавить(НСтр("ru = 'Список отправлений не утвержден. Необходимо проверить формирование отгрузки.'"));
				КонецЕсли;
			Иначе
				СписокСообщений.Добавить(НСтр("ru = 'Список отправлений не утвержден. Необходимо завершить формирование отгрузки.'"));
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ТекстСообщения Из СписокСообщений Цикл
		#Если Сервер Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		#Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		#КонецЕсли
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуОтправленийВОтгрузке()

	РегистрыСведений.ЗаказыТорговыхПлощадок.ВыполнитьПроверкуОтправленийВОтгрузке(ИнформацияОбОтгрузке);
	ЗаполнитьМассыИзНакладныхНаСервере(ИнформацияОбОтгрузке);
	ОбработатьПолучениеИнформацииОбОтгрузке();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПутьКОтгрузкамВЛичномКабинете(ВидМаркетплейса)

	ПутьКОтгрузкамВЛичномКабинете = "";
	
	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		ПутьКОтгрузкамВЛичномКабинете = "https://seller.ozon.ru/app/postings/fbs?tab=awaiting_deliver&show=postings"; 
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда	
		ПутьКОтгрузкамВЛичномКабинете = "https://doc-binary.s3.yandex.net/src/support/market/ru/delivery-acceptance-act.xlsx"; 		
	КонецЕсли;
	
	Возврат ПутьКОтгрузкамВЛичномКабинете;

КонецФункции

&НаКлиенте
// Обработка результата открытия формы просмотра значений.
// 
// Параметры:
//   РезультатЗадания        - Неопределено, Структура из см. ДлительныеОперации.ВыполнитьФункцию.ИмяФункции
//   ДополнительныеПараметры - Неопределено, Структура из КлючИЗначение - дополнительные параметры.
//
Процедура ПросмотрСпискаОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ДополнительныеПараметры.Действие = "ОткрытьСписокОтгрузок" Тогда
		ОчиститьИнформациюОбОтгрузке(ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки));
		ИнформацияОбОтгрузке.ИдентификаторОтгрузки = Результат;
		ПолучитьИнформациюОбОтгрузке();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокОтгрузок(Отгрузки, ИнформацияОбОтгрузке)

	Отгрузки.Очистить();
	
	Для Каждого Отгрузка Из ИнформацияОбОтгрузке.СписокОтгрузок Цикл
		Если ПустаяСтрока(Отгрузка.ИдентификаторОтгрузки) Тогда
			Если ЗначениеЗаполнено(Отгрузка.КоличествоОтправленийВОтгрузке) Тогда
				ПредставлениеОтгрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Новая отгрузка (%1)'"),
					КоличествоОтправленийСтрокой(Отгрузка.КоличествоОтправленийВОтгрузке));
			Иначе
				ПредставлениеОтгрузки = НСтр("ru = 'Новая отгрузка'");
			КонецЕсли;
		Иначе
			ПредставлениеОтгрузки = ПредставлениеОтгрузки(Отгрузка, Истина);
		КонецЕсли;
		
		Отгрузки.Добавить(Отгрузка.ИдентификаторОтгрузки, ПредставлениеОтгрузки);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеОтгрузки(ИнформацияОбОтгрузке, ДополнительнаяИнформация = Ложь,
			ВыводитьИдентификаторОтгрузки = Ложь)

	ЧастиНомераОтгрузки = Новый Массив;
	
	Если ИнформацияОбОтгрузке.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда
		НомерОтгрузки = ИнформацияОбОтгрузке.ПорядковыйНомерОтгрузки;
	Иначе
		НомерОтгрузки = ИнформацияОбОтгрузке.НомерОтгрузки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерОтгрузки) Тогда
		ЧастиНомераОтгрузки.Добавить(НомерОтгрузки);
	КонецЕсли;
	
	Если ВыводитьИдентификаторОтгрузки
			И Не ПустаяСтрока(ИнформацияОбОтгрузке.ИдентификаторОтгрузки) Тогда
		ЧастиНомераОтгрузки.Добавить("(id " + ИнформацияОбОтгрузке.ИдентификаторОтгрузки + ")");
	КонецЕсли;
	
	Если ЧастиНомераОтгрузки.Количество() > 0 Тогда
		ШаблонЗаголовка = НСтр("ru = 'Отгрузка %1 на %2'");
	Иначе
		ШаблонЗаголовка = НСтр("ru = 'Отгрузка на %2'");
	КонецЕсли;
	
	ПредставлениеОтгрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовка,
		СтрСоединить(ЧастиНомераОтгрузки, " "),
		Формат(ИнформацияОбОтгрузке.ДатаВыполнения, "ДЛФ=DD"));
	
	Если ДополнительнаяИнформация Тогда
		ПредставлениеДопИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'в статусе ""%1"", создана %2, %3'"),
			ИнформацияОбОтгрузке.Статус,
			ИнформацияОбОтгрузке.ДатаСоздания,
			КоличествоОтправленийСтрокой(ИнформацияОбОтгрузке.КоличествоОтправленийВОтгрузке));
		
		ПредставлениеОтгрузки = ПредставлениеОтгрузки + " " + ПредставлениеДопИнформации;
	КонецЕсли;
	
	Возврат ПредставлениеОтгрузки;

КонецФункции

&НаСервереБезКонтекста
Функция КоличествоОтправленийСтрокой(КоличествоОтправлений = 0);

	Если КоличествоОтправлений = 0 Тогда
		Шаблон = НСтр("ru = 'нет отправлений'");
	ИначеЕсли Число(Прав(КоличествоОтправлений, 1)) = 1 Тогда
		Шаблон = НСтр("ru = '1 отправление'");
	ИначеЕсли Число(Прав(КоличествоОтправлений, 1)) <= 4 Тогда
		Шаблон = НСтр("ru = '%1 отправления'");
	Иначе
		Шаблон = НСтр("ru = '%1 отправлений'");
	КонецЕсли;
	
	КоличествоОтправленийСтрокой = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Шаблон,
		КоличествоОтправлений);
		
	Возврат КоличествоОтправленийСтрокой;

КонецФункции

#КонецОбласти

#Область ЗаполнениеМассСлужебные

&НаКлиенте
Процедура ЗаполнитьМассыИзНакладных()

	ЗаполнитьМассыИзНакладныхНаСервере(ИнформацияОбОтгрузке);
	МассаБрутто = ИнформацияОбОтгрузке.МассаБрутто;
	МассаНетто  = ИнформацияОбОтгрузке.МассаНетто;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьМассыИзНакладныхНаСервере(ИнформацияОбОтгрузке)

	РегистрыСведений.ЗаказыТорговыхПлощадок.ЗаполнитьМассыИзНакладных(ИнформацияОбОтгрузке);

КонецПроцедуры

#КонецОбласти

#Область РаботаСДокументамиСлужебные

&НаКлиенте
Процедура УстановитьСтатусДокументовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	СтатусДокументов = ДополнительныеПараметры.СтатусДокументов;
	ЗаголовокСтатуса = ДополнительныеПараметры.ЗаголовокСтатуса;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	КоличествоОбработанных = УстановитьСтатусДокументовНаСервере(ВыделенныеСтроки, СтатусДокументов);
	ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(
		Элементы.Список,
		КоличествоОбработанных,
		ВыделенныеСтроки.Количество(),
		ЗаголовокСтатуса);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСтатусДокументовНаСервере(ВыделенныеСтроки, СтатусДокументов)

	МассивДокументов = ВыделенныеЗаказы(ВыделенныеСтроки);
	КоличествоОбработанных =
		ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивДокументов, СтатусДокументов);
	
	Возврат КоличествоОбработанных;

КонецФункции

&НаСервереБезКонтекста
Функция ВыделенныеЗаказы(ВыделенныеСтроки)

	МассивДокументов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		МассивДокументов.Добавить(ВыделеннаяСтрока.Заказ);
	КонецЦикла;

	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДокументов);

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДокументовПеревозки(ЗаданиеНаПеревозку, ТранспортнаяНакладная, ИдентификаторОтгрузки, ЗаполнитьСсылки = Истина)

	ДанныеДокументовПеревозки = Новый Структура;
	
	ДанныеДокументовПеревозки.Вставить("ТТН_Дата", Дата(1,1,1));
	ДанныеДокументовПеревозки.Вставить("ТТН_Номер", "");
	ДанныеДокументовПеревозки.Вставить("ТТН_Проведен", Ложь);
	ДанныеДокументовПеревозки.Вставить("ТТН_ПометкаУдаления", Истина);
	ДанныеДокументовПеревозки.Вставить("ТТН_ТипТС", Справочники.ТипыТранспортныхСредств.ПустаяСсылка());
	
	ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_Дата", Дата(1,1,1));
	ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_Номер", "");
	ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_Проведен", Ложь);
	ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_ПометкаУдаления", Истина);
	ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_ТипТС", Справочники.ТипыТранспортныхСредств.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Если ЗаполнитьСсылки Тогда
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТранспортныеНакладные.Ссылка КАК ТранспортнаяНакладная,
			|	ТранспортныеНакладные.Дата КАК Дата,
			|	ТранспортныеНакладные.Номер КАК Номер,
			|	ТранспортныеНакладные.Проведен КАК Проведен,
			|	ТранспортныеНакладные.ПометкаУдаления КАК ПометкаУдаления,
			|	ЕСТЬNULL(ТипыТранспортныхСредств.Ссылка, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка)) КАК ТипТранспортногоСредства,
			|	ТранспортныеНакладные.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
			|ПОМЕСТИТЬ ДанныеТТН
			|ИЗ
			|	Документ.ТранспортнаяНакладная КАК ТранспортныеНакладные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыТранспортныхСредств КАК ТипыТранспортныхСредств
			|		ПО ТранспортныеНакладные.АвтомобильТип = ТипыТранспортныхСредств.Наименование
			|ГДЕ
			|	ТранспортныеНакладные.Идентификатор = &ИдентификаторОтгрузки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданияНаПеревозку.Ссылка КАК Ссылка,
			|	ЗаданияНаПеревозку.Дата КАК Дата,
			|	ЗаданияНаПеревозку.Номер КАК Номер,
			|	ЗаданияНаПеревозку.Проведен КАК Проведен,
			|	ЗаданияНаПеревозку.ПометкаУдаления КАК ПометкаУдаления,
			|	ВЫБОР
			|		КОГДА ЗаданияНаПеревозку.ТранспортноеСредство ССЫЛКА Справочник.ТипыТранспортныхСредств
			|			ТОГДА ЗаданияНаПеревозку.ТранспортноеСредство
			|		ИНАЧЕ ЕСТЬNULL(ТранспортныеСредства.Тип, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка))
			|	КОНЕЦ КАК ТипТранспортногоСредства
			|ИЗ
			|	Документ.ЗаданиеНаПеревозку КАК ЗаданияНаПеревозку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеТТН КАК ДанныеТТН
			|		ПО ЗаданияНаПеревозку.Ссылка = ДанныеТТН.ЗаданиеНаПеревозку
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
			|		ПО ЗаданияНаПеревозку.ТранспортноеСредство = ТранспортныеСредства.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеТТН.ТранспортнаяНакладная КАК Ссылка,
			|	ДанныеТТН.Дата КАК Дата,
			|	ДанныеТТН.Номер КАК Номер,
			|	ДанныеТТН.Проведен КАК Проведен,
			|	ДанныеТТН.ПометкаУдаления КАК ПометкаУдаления,
			|	ДанныеТТН.ТипТранспортногоСредства КАК ТипТранспортногоСредства
			|ИЗ
			|	ДанныеТТН КАК ДанныеТТН
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ДанныеТТН";
		
		ПозицияЗаданияНаПеревозку = 1;
		ПозицияТТН = 2;
	Иначе
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТранспортныеНакладные.Ссылка КАК Ссылка,
			|	ТранспортныеНакладные.Дата КАК Дата,
			|	ТранспортныеНакладные.Номер КАК Номер,
			|	ТранспортныеНакладные.Проведен КАК Проведен,
			|	ТранспортныеНакладные.ПометкаУдаления КАК ПометкаУдаления,
			|	ЕСТЬNULL(ТипыТранспортныхСредств.Ссылка, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка)) КАК ТипТранспортногоСредства
			|ИЗ
			|	Документ.ТранспортнаяНакладная КАК ТранспортныеНакладные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыТранспортныхСредств КАК ТипыТранспортныхСредств
			|		ПО ТранспортныеНакладные.АвтомобильТип = ТипыТранспортныхСредств.Наименование
			|ГДЕ
			|	ТранспортныеНакладные.Ссылка = &ТранспортнаяНакладная
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданияНаПеревозку.Ссылка КАК Ссылка,
			|	ЗаданияНаПеревозку.Дата КАК Дата,
			|	ЗаданияНаПеревозку.Номер КАК Номер,
			|	ЗаданияНаПеревозку.Проведен КАК Проведен,
			|	ЗаданияНаПеревозку.ПометкаУдаления КАК ПометкаУдаления,
			|	ВЫБОР
			|		КОГДА ЗаданияНаПеревозку.ТранспортноеСредство ССЫЛКА Справочник.ТипыТранспортныхСредств
			|			ТОГДА ЗаданияНаПеревозку.ТранспортноеСредство
			|		ИНАЧЕ ЕСТЬNULL(ТранспортныеСредства.Тип, ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка))
			|	КОНЕЦ КАК ТипТранспортногоСредства
			|ИЗ
			|	Документ.ЗаданиеНаПеревозку КАК ЗаданияНаПеревозку
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТранспортныеСредства КАК ТранспортныеСредства
			|		ПО ЗаданияНаПеревозку.ТранспортноеСредство = ТранспортныеСредства.Ссылка
			|ГДЕ
			|	ЗаданияНаПеревозку.Ссылка = &ЗаданиеНаПеревозку";
		
		ПозицияЗаданияНаПеревозку = 1;
		ПозицияТТН = 0;
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ИдентификаторОтгрузки", ИдентификаторОтгрузки);
	Запрос.УстановитьПараметр("ЗаданиеНаПеревозку",    ЗаданиеНаПеревозку);
	Запрос.УстановитьПараметр("ТранспортнаяНакладная", ТранспортнаяНакладная);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТранспортнаяНакладная = Документы.ТранспортнаяНакладная.ПустаяСсылка();
	ДанныеТранспортнойНакладной = Новый Структура;
	ТранспортнаяНакладнаяПометкаУдаления = Истина;
	
	ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
	ДанныеЗаданияНаПеревозку = Новый Структура;
	ЗаданиеНаПеревозкуПометкаУдаления = Истина;
	
	ВыборкаТТН = Результат[ПозицияТТН].Выбрать();
	Если ВыборкаТТН.Следующий() И ЗначениеЗаполнено(ВыборкаТТН.Ссылка) Тогда
		ТранспортнаяНакладная = ВыборкаТТН.Ссылка;
		ТранспортнаяНакладнаяПометкаУдаления = ВыборкаТТН.ПометкаУдаления;
		
		ДанныеТранспортнойНакладной.Вставить("ТТН_Дата",            ВыборкаТТН.Дата);
		ДанныеТранспортнойНакладной.Вставить("ТТН_Номер",           ВыборкаТТН.Номер);
		ДанныеТранспортнойНакладной.Вставить("ТТН_Проведен",        ВыборкаТТН.Проведен);
		ДанныеТранспортнойНакладной.Вставить("ТТН_ПометкаУдаления", ВыборкаТТН.ПометкаУдаления);
		
		ДанныеДокументовПеревозки.Вставить("ТТН_ТипТС", ВыборкаТТН.ТипТранспортногоСредства);
	КонецЕсли;
	
	ВыборкаЗаданийНаПеревозку = Результат[ПозицияЗаданияНаПеревозку].Выбрать();
	Если ВыборкаЗаданийНаПеревозку.Следующий() И ЗначениеЗаполнено(ВыборкаЗаданийНаПеревозку.Ссылка) Тогда
		ЗаданиеНаПеревозку = ВыборкаЗаданийНаПеревозку.Ссылка;
		ЗаданиеНаПеревозкуПометкаУдаления = ВыборкаЗаданийНаПеревозку.ПометкаУдаления;
		
		ДанныеЗаданияНаПеревозку.Вставить("ЗаданиеНаПеревозку_Дата",            ВыборкаЗаданийНаПеревозку.Дата);
		ДанныеЗаданияНаПеревозку.Вставить("ЗаданиеНаПеревозку_Номер",           ВыборкаЗаданийНаПеревозку.Номер);
		ДанныеЗаданияНаПеревозку.Вставить("ЗаданиеНаПеревозку_Проведен",        ВыборкаЗаданийНаПеревозку.Проведен);
		ДанныеЗаданияНаПеревозку.Вставить("ЗаданиеНаПеревозку_ПометкаУдаления", ВыборкаЗаданийНаПеревозку.ПометкаУдаления);
		
		ДанныеДокументовПеревозки.Вставить("ЗаданиеНаПеревозку_ТипТС", ВыборкаЗаданийНаПеревозку.ТипТранспортногоСредства);
	КонецЕсли;
	
	Если Не ТранспортнаяНакладнаяПометкаУдаления Или Не ЗаданиеНаПеревозкуПометкаУдаления Тогда
		ЗаполнитьЗначенияСвойств(ДанныеДокументовПеревозки, ДанныеТранспортнойНакладной);
		ЗаполнитьЗначенияСвойств(ДанныеДокументовПеревозки, ДанныеЗаданияНаПеревозку);
	ИначеЕсли ТранспортнаяНакладнаяПометкаУдаления И ЗаданиеНаПеревозкуПометкаУдаления Тогда
		ТранспортнаяНакладная = Документы.ТранспортнаяНакладная.ПустаяСсылка();
		ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
	ИначеЕсли ТранспортнаяНакладнаяПометкаУдаления Тогда
		ТранспортнаяНакладная = Документы.ТранспортнаяНакладная.ПустаяСсылка();
	ИначеЕсли ЗаданиеНаПеревозкуПометкаУдаления Тогда
		ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ДанныеДокументовПеревозки;

КонецФункции

&НаСервере
Процедура ОформитьДокументыПеревозки(НавигационнаяСсылкаКоманды)

	ИнформацияОбОтгрузке.ТипТранспортногоСредства = ТипТранспортногоСредства;
	
	Если НавигационнаяСсылкаКоманды = "ОформитьТТН_" Тогда
		ТранспортнаяНакладная = ОформитьТТН(ИнформацияОбОтгрузке, НастройкиСклада);
	ИначеЕсли НавигационнаяСсылкаКоманды = "ОформитьЗаданиеНаПеревозку_" Тогда
		ЗаданиеНаПеревозку = ОформитьЗаданиеНаПеревозку(ИнформацияОбОтгрузке, НастройкиСклада);
		
		Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
			ТранспортнаяНакладная = ОформитьТТН(ИнформацияОбОтгрузке, НастройкиСклада, ЗаданиеНаПеревозку);
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОбновитьТекстДокументыНаОсновании(Ложь);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОформитьЗаданиеНаПеревозку(ИнформацияОбОтгрузке, НастройкиСклада = Неопределено)

	ЗаданиеНаПеревозку = РегистрыСведений.ЗаказыТорговыхПлощадок.СформироватьЗаданиеНаПеревозку(
		ИнформацияОбОтгрузке,
		НастройкиСклада); // ДокументСсылка.ЗаданиеНаПеревозку
	
	Возврат ЗаданиеНаПеревозку;

КонецФункции

&НаСервереБезКонтекста
Функция ОформитьТТН(ИнформацияОбОтгрузке, НастройкиСклада = Неопределено, ЗаданиеНаПеревозку = Неопределено)

	ТранспортнаяНакладная = РегистрыСведений.ЗаказыТорговыхПлощадок.СформироватьТранспортнуюНакладную(
		ИнформацияОбОтгрузке,
		НастройкиСклада,
		ЗаданиеНаПеревозку); // ДокументСсылка.ТранспортнаяНакладная
	
	Возврат ТранспортнаяНакладная;

КонецФункции

#КонецОбласти

#Область РаботаСПропускамиСлужебные

&НаКлиенте
Процедура ЗавершениеЗаполненияПропусков(РезультатЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		ИнформацияОбОтгрузке.Пропуска = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(РезультатЗакрытия);
		ИзменитьПоведениеФормыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатныеФормыСлужебные

&НаСервереБезКонтекста
Процедура ОбновитьПодменюПечать(Объект)

	ПанельПодключаемыхКоманд = Объект.Элементы.ПодключаемыеКоманды;
	
	ИсточникиКоманд = Новый Массив;
	ИсточникиКоманд.Добавить(Метаданные.Документы.ТранспортнаяНакладная);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = ПанельПодключаемыхКоманд;
	ПараметрыРазмещения.Источники = ИсточникиКоманд;
	ПодключаемыеКоманды.ПриСозданииНаСервере(Объект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СкорректироватьСписокПодключаемыхКоманд(
		Объект,
		Объект.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд,
		ПанельПодключаемыхКоманд);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкорректироватьСписокПодключаемыхКоманд(Форма, АдресТаблицыКоманд, ПанельПодключаемыхКоманд)

	Форма.ПодключенныеПечатныеФормы.Очистить();
	
	ТребуемыеКоманды = Новый Массив;
	ТребуемыеКоманды.Добавить("ТранспортнаяНакладная");
	
	ТаблицаКоманд = ПолучитьИзВременногоХранилища(АдресТаблицыКоманд); // ТаблицаЗначений
	
	Для Каждого СтрокаКоманды Из ТаблицаКоманд Цикл
		ЭлементФормы = Форма.Элементы.Найти(СтрокаКоманды.ИмяВФорме);
		Если ЭлементФормы <> Неопределено Тогда
			Если ТребуемыеКоманды.Найти(СтрокаКоманды.Вид) = Неопределено
					И ТребуемыеКоманды.Найти(СтрокаКоманды.Идентификатор) = Неопределено Тогда
				ЭлементФормы.Видимость = Ложь;
			ИначеЕсли СтрокаКоманды.Вид = "Печать" Тогда
				ЗаполнитьПодключенныеПечатныеФормы(
					Форма.ПодключенныеПечатныеФормы,
					СтрокаКоманды.ТипПараметра,
					СтрокаКоманды.ИмяВФорме);
				
				УстановитьВидЭлемента(ЭлементФормы.Родитель, ВидГруппыФормы.ГруппаКнопок, ПанельПодключаемыхКоманд);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВидЭлемента(Элемент, ВидЭлемента, КонечныйРодитель = Неопределено)

	ИмяТипаПодменюФормы = "ПодменюФормы";
	ИмяТипаГруппаФормы = "ГруппаФормы";
	ИмяТипаГруппаКнопокФормы = "ГруппаКнопокФормы";
	
	Если Элемент <> Неопределено
			И Элемент <> КонечныйРодитель
			И (ТипЗнч(Элемент) = Тип(ИмяТипаПодменюФормы)
				Или ТипЗнч(Элемент) = Тип(ИмяТипаГруппаФормы)
				Или ТипЗнч(Элемент) = Тип(ИмяТипаГруппаКнопокФормы)) Тогда
		Элемент.Вид = ВидЭлемента;
		
		УстановитьВидЭлемента(Элемент.Родитель, ВидЭлемента, КонечныйРодитель);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПодключенныеПечатныеФормы(ПодключенныеПечатныеФормы, Знач ТипПараметра, Знач ИмяКомандыНаФорме)

	Если ТипЗнч(ТипПараметра) = Тип("ОписаниеТипов") Тогда
		МассивТипов = ТипПараметра.Типы();
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипПараметра);
	КонецЕсли;
	
	Для Каждого ТипПараметра Из МассивТипов Цикл
		ПодключенныеПечатныеФормы.Добавить(ИмяКомандыНаФорме, Строка(ТипПараметра));
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандыПечатиСформированнойОтгрузки(ПодключенныеПечатныеФормы, ДоступныеПечатныеФормы)

	КомандыПечати = Новый СписокЗначений;
	
	КомандыПечати.ЗагрузитьЗначения(ДоступныеПечатныеФормы);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСписок(КомандыПечати, ПодключенныеПечатныеФормы);
	
	Возврат КомандыПечати;

КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьДоступностьПечатныхФорм(Элементы, ПодключенныеПечатныеФормы, Доступность, ТипПараметра = Неопределено)

	Для Каждого КомандаНаФорме Из ПодключенныеПечатныеФормы Цикл
		Если ТипПараметра <> Неопределено И ТипПараметра <> КомандаНаФорме.Представление Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы[КомандаНаФорме.Значение].Доступность = Доступность;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПечатныеФормы(ПечатныеДокументы, ПечатьСразуНаПринтер = Ложь)

	МассивУдаляемыхДокументов = Новый Массив;
	
	Для Каждого ПечатнаяФорма Из ПечатныеДокументы Цикл
		Если ПустаяСтрока(ПечатнаяФорма.Значение.АдресДвоичныхДанных) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Нет данных для отображения печатной формы ""%1"".'"),
					ПечатнаяФорма.Ключ));
			
			МассивУдаляемыхДокументов.Добавить(ПечатнаяФорма.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Ключ Из МассивУдаляемыхДокументов Цикл
		ПечатныеДокументы.Удалить(Ключ);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПечатныеДокументы", ПечатныеДокументы);
	ПараметрыОткрытия.Вставить("ПечатьСразу",       ПечатьСразуНаПринтер);
	
	ОткрытьФорму("Справочник.УчетныеЗаписиМаркетплейсов.Форма.ПредварительныйПросмотрПечатныхФорм",
		ПараметрыОткрытия,
		ЭтотОбъект);
	
	ОбновитьЗаголовокКомандыПрисоединенныхФайлов();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьЭтикетокГрузовыхМест(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	НаименованиеФайла = НСтр("ru = 'Этикетки грузовых мест отгрузки'");
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлЭтикетокГрузовыхМестОтгрузки(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьКомплектаДокументов(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	Если ИнформацияОбОтгрузке.ДоступныеПечатныеФормы.Найти("ПечатьНакладнойАкта") <> Неопределено Тогда
		ПодготовитьПечатьНакладнойАкта(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная, Истина);
	КонецЕсли;
	
	Если ИнформацияОбОтгрузке.ДоступныеПечатныеФормы.Найти("ПечатьЛистаОтгрузки") <> Неопределено Тогда
		ПодготовитьПечатьЛистаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	КонецЕсли;
	
	Если ИнформацияОбОтгрузке.ДоступныеПечатныеФормы.Найти("ПечатьШтрихкодаОтгрузки") <> Неопределено Тогда
		ПодготовитьПечатьШтрихкодаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьЛистаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	НаименованиеФайла = НСтр("ru = 'Лист отгрузки'");
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлЛистаОтгрузки(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьШтрихкодаОтгрузки(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	НаименованиеФайла = НСтр("ru = 'Штрихкод отгрузки'");
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлШтрихкодаОтгрузки(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьНакладнойАкта(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная, ПолучитьАкт)
	
	НаименованиеФайла = "";  
	ЭтоЯндексМаркет = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоЯндексМаркет(ИнформацияОбОтгрузке.ВидМаркетплейса);
	ЭтоOzon = ИнтеграцияСМаркетплейсамиКлиентСервер.ЭтоOzon(ИнформацияОбОтгрузке.ВидМаркетплейса);
	Если ЭтоOzon Тогда
		НаименованиеФайла = НСтр("ru = 'Транспортная накладная или акт'");
		
	ИначеЕсли ЭтоЯндексМаркет Тогда
		Если ПолучитьАкт Тогда
			НаименованиеФайла = НСтр("ru = 'Акт приема-передачи'");
		Иначе
			НаименованиеФайла = НСтр("ru = 'Транспортная накладная'");
		КонецЕсли;
	КонецЕсли;
	
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлНакладнойАкта(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес,
		ПолучитьАкт);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьАктаОРасхождениях(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	НаименованиеФайла = НСтр("ru = 'Акт о расхождениях'");
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлАктаОРасхождениях(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьПечатьФактическогоАктаПриемаПередачи(ПечатныеДокументы, ИнформацияОбОтгрузке, ТранспортнаяНакладная)

	НаименованиеФайла = НСтр("ru = 'Акт фактического приема-передачи'");
	Адрес = Новый УникальныйИдентификатор();
	
	ДанныеФайла = РегистрыСведений.ЗаказыТорговыхПлощадок.ПолучитьФайлФактическогоАктаПриемаПередачи(
		ИнформацияОбОтгрузке,
		ТранспортнаяНакладная,
		НаименованиеФайла,
		Адрес);
	
	ПечатныеДокументы.Вставить(НаименованиеФайла, ДанныеФайла);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
