#Область ПрограммныйИнтерфейс

// Проверяет наличие новой версии, и если она есть, то обновляет установленное расширение
//
Функция ОбновитьРасширениеКонтурДиадок() Экспорт
	
	Результат = Ложь;
	
	Если НЕ ЕстьПраваДляОбновленияРасширения()
		Или РасширениеКонфигурацииКонтурДиадок() = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОтключеноАвтоматическоеОбновление = КонтурДиадокОбновлениеСерверПовтИсп.ОтключеноАвтоматическоеОбновлениеМодуля();
	РасширениеТиповое = КонтурДиадокОбновлениеСерверПовтИсп.УстановленноеРасширениеТиповое();
	НужноПроверитьНаличиеНовойВерсии = НужноПроверитьНаличиеНовойВерсии();
	
	Если ОтключеноАвтоматическоеОбновление
		Или НЕ РасширениеТиповое
		Или НЕ НужноПроверитьНаличиеНовойВерсии Тогда
		Возврат Результат;
	КонецЕсли;
	
	КонтекстВерсии = КонтекстВерсии();
	
	АпдейтКлиент = КонтурДиадокОбновлениеСерверПовтИсп.АпдейтКлиент();
	
	Статус = АпдейтКлиент.ПроверитьОбновление(
		ИмяПродукта(),
		КонтекстВерсии
	);
	
	УстановитьВремяПоследнейПроверкиОбновлений();
	
	Если Статус.ЕстьОбновление Тогда
		
		ТипПоставки = ТипПоставки();
		ФайлПоставки = АпдейтКлиент.СкачатьОбновление(Статус, ТипПоставки);
		
		Результат = ВыполнитьОбновлениеРасширения(ФайлПоставки);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция АдресСервисаОбновлений() Экспорт
	
	ПараметрыКонфигурационногоФайла = ПараметрыСеанса.КонтурДиадокПараметрыКонфигурационногоФайла;
	
	Результат = ПараметрыКонфигурационногоФайла.Получить("АдресUpdateServiceAPI");
	
	Если Результат = Неопределено Тогда
		Результат = АдресСервисаОбновленийПоУмолчанию();
	КонецЕсли;
	
	Возврат Результат + "/1c";
	
КонецФункции

Функция КонтрольнаяСуммаРасширенияИзСервисаОбновлений() Экспорт
	
	ИмяПродукта = ИмяПродукта();
	ВерсияРасширения = УстановленнаяВерсия();
	ТипПоставки = ТипПоставки();
	
	СервисОбновлений = КонтурДиадокОбновлениеСерверПовтИсп.АпдейтКлиент();
	
	Попытка
		КонтентВерсии = СервисОбновлений.ПолучитьКонтент(ИмяПродукта, ВерсияРасширения, ТипПоставки);
	Исключение
		ИнформацияОбОшибкеЛок = ИнформацияОбОшибке();
		КонтурДиадокСервер.ЗаписатьОшибкуВЖурналРегистрации(
			"ОбновлениеРасширения",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибкеЛок)
		);
		КонтентВерсии = Неопределено;
	КонецПопытки;
	
	Если КонтентВерсии <> Неопределено Тогда
		Результат = КонтентВерсии.КонтрольнаяСумма;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольнаяСуммаУстановленногоРасширения() Экспорт
	
	РасширениеКонфигурации = РасширениеКонфигурацииКонтурДиадок();
	
	Результат = Base64Строка(РасширениеКонфигурации.ХешСумма);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НужноПроверитьНаличиеНовойВерсии()
	
	ВремяПоследнейПроверки = ПараметрыСеанса.КонтурДиадокВремяПоследнейПроверкиОбновлений;
	
	Результат = (ВремяПоследнейПроверки + ИнтервалПроверкиОбновлений() <= ТекущаяДатаСеанса());
	
	Возврат Результат;
	
КонецФункции

Функция КонтекстВерсии()
	
	АпдейтКлиент = КонтурДиадокОбновлениеСерверПовтИсп.АпдейтКлиент();
	
	Результат = АпдейтКлиент.КонтекстВерсии();
	Результат.Версия = УстановленнаяВерсия();
	Результат.ИдБазы = ИдентификаторБазы();
	Результат.ПроизвольныеДанные.Вставить("storage_subsystem", ПодсистемаХранения());
	Результат.ПроизвольныеДанные.Вставить("application_launch_mode", "Управляемое приложение");
	Результат.ПроизвольныеДанные.Вставить("conf_name", Метаданные.Имя);
	Результат.ПроизвольныеДанные.Вставить("conf_version", Метаданные.Версия);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьВремяПоследнейПроверкиОбновлений()
	
	ПараметрыСеанса.КонтурДиадокВремяПоследнейПроверкиОбновлений = ТекущаяДатаСеанса();
	
КонецПроцедуры

Функция ЕстьПраваДляОбновленияРасширения()
	
	Результат = Истина;
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	Если НЕ ПравоДоступа("Администрирование", Метаданные)
		И НЕ ПривилегированныйРежим() Тогда
		Результат = Ложь;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ВыполнитьОбновлениеРасширения(ДвоичныеДанныеОбновления)
	
	Результат = Истина;
	
	РасширениеКонфигурации = РасширениеКонфигурацииКонтурДиадок();
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	РезультатПроверки = РасширениеКонфигурации.ПроверитьВозможностьПрименения(ДвоичныеДанныеОбновления, Ложь);
	
	Если РезультатПроверки.Количество() = 0 Тогда
		РасширениеКонфигурации.Записать(ДвоичныеДанныеОбновления);
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УстановленнаяВерсия()
	
	РасширениеКонфигурации = РасширениеКонфигурацииКонтурДиадок();
	ВерсияРасширения = РасширениеКонфигурации.Версия;
	
	РазделительВерсии = "+";
	
	Результат = КонтурДиадокСтдСтрКлиентСервер.РазложитьСтрокуВМассивПодстрокЛок(ВерсияРасширения, РазделительВерсии);
	
	Возврат Результат[0];
	
КонецФункции

Функция РасширениеКонфигурацииКонтурДиадок()
	
	Результат = Неопределено;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Имя", "КонтурДиадок");
	
	МенеджерРасширений = Вычислить("РасширенияКонфигурации");
	
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	
	ОтобранныеРасширения = МенеджерРасширений.Получить(Отбор);
	
	Если ОтобранныеРасширения.Количество() = 0
		Или ОтобранныеРасширения[0].Активно = Ложь Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОтобранныеРасширения[0];
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторБазы()
	
	ХранениеДанных = КонтурДиадокСерверПовтИсп.МодульХранениеДанных();
	ОбщиеНастройкиЛок = ХранениеДанных.Настройки_ОбщиеНастройки();
	
	Результат = ОбщиеНастройкиЛок.ИдентификаторБазы1С;
	
	Возврат Результат;
	
КонецФункции

Функция ПодсистемаХранения()
	
	ХранениеДанных = КонтурДиадокСерверПовтИсп.МодульХранениеДанных();
	
	ТехИнфо = ХранениеДанных.ТехническаяИнформация();
	
	ТипыСХ1 = Новый Массив;
	ТипыСХ1.Добавить(ХранениеДанных.ТипыХранения.ОбъектыДиадокаРасширение);
	ТипыСХ1.Добавить(ХранениеДанных.ТипыХранения.ОбъектыДиадокаПодсистема);
	
	Результат = "ТиповаяПодсистема1С";
	
	Если ТипыСХ1.Найти(ТехИнфо.Тип) <> Неопределено Тогда
		Результат = "ПодсистемаДиадок";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИнтервалПроверкиОбновлений()
	Возврат 3600;
КонецФункции

Функция ИмяПродукта()
	Возврат "diadoc_um";
КонецФункции

Функция ТипПоставки()
	Возврат "extension";
КонецФункции

Функция АдресСервисаОбновленийПоУмолчанию()
	
	Возврат "https://update.kontur.ru";
	
КонецФункции

#КонецОбласти
