#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Период", Период);
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период.ДатаНачала = НачалоДня(ТекущаяДатаСеанса() - 1 * 24 * 3600);
		Период.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ИспользуютсяПутевыеЛисты = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
	СвойМедик = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("Медик");
	Если Не СвойМедик Тогда
		Элементы.ФормаМедосмотр.Видимость = Ложь;
	КонецЕсли;
	
	СвойТехОсмотр = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьНашаРольВОрганизациях("ТехОсмотр");
	Если Не СвойТехОсмотр Тогда
		Элементы.ФормаТехКонтроль.Видимость = Ложь;
	КонецЕсли;
	
	Если ИспользуютсяПутевыеЛисты Тогда
		ПодготовитьСписки();
		ПодготовитьЭлементыДанныхУчетногоДокумента();
	КонецЕсли;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		
		Элементы.ОтборДиспетчер.ОдинаковаяШиринаКолонок = Истина;
		Элементы.ОтборМедосмотр.ОдинаковаяШиринаКолонок = Истина;
		Элементы.ОтборТехКонтроль.ОдинаковаяШиринаКолонок = Истина;
		Элементы.ОтборПоказанияОдометра.ОдинаковаяШиринаКолонок = Истина;
		Элементы.ДекорацияЗадачиДиспетчерСменаВодителя.Высота = 2;
		Элементы.ГруппаЗадачиДиспетчерСменаВодителя.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
	ПроверитьСоздатьПКДПутевыхЛистов(СвойМедик);
	
	ОбновитьВидимостьДоступностьПоГруппамДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИспользуютсяПутевыеЛисты Тогда
		
		Если Не ЗначениеЗаполнено(ТекущиВидАРМ) Тогда
			ТекущиВидАРМ = "Диспетчер";
		КонецЕсли;
		
		Если ТекущиВидАРМ = "Медик" И Не СвойМедик Тогда
			ТекущиВидАРМ = "Диспетчер";
		КонецЕсли;
		
		Если ТекущиВидАРМ = "Диспетчер" И Не Элементы.ФормаДиспетчер.Видимость Тогда
			ТекущиВидАРМ = "Медик";
		КонецЕсли;
		Если ТекущиВидАРМ = "Медик" И Не Элементы.ФормаМедосмотр.Видимость Тогда
			ТекущиВидАРМ = "ТехКонтроль";
		КонецЕсли;
		Если ТекущиВидАРМ = "ТехКонтроль" И Не Элементы.ФормаТехКонтроль.Видимость Тогда
			ТекущиВидАРМ = "ПоказанияОдометра";
		КонецЕсли;
		Если ТекущиВидАРМ = "ПоказанияОдометра" И Не Элементы.ФормаПоказанияОдометра.Видимость Тогда
			Закрыть();
			Сообщить("У вас нет доступа. Обратитесь к администратору.");
		КонецЕсли;
		
		ПриСменеСтранициЗадачНаКлиенте();
		
		ПриИзмененииАвтообновленияФормы(АвтообновлениеФормы);
		
		ОборудованиеУстановитьВидимостьВыключения();
		ИспользоватьПодключаемоеОборудование = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ИспользоватьОборудование");
		Если ИспользоватьПодключаемоеОборудование Тогда
			
			ПодключитьОбработчикОжидания("ОткрытьФормуПодключенноеОборудованиеОбработчикОжидания", 0.5, Истина);
			
		КонецЕсли;
		
		Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = Ложь;
		
		ПолучитьУведомленияИзСервиса();
		
	Иначе
		
		Закрыть();
		
		Сообщить("Использование путевых листов отключено");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ВвестиДокумент"
		Или ИмяСобытия = "КонтурЛогистика_ЗакрытиеФормыСлеженияЗаФайлами"
		Или ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов"
		Или ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи"
		Или (ИмяСобытия = "ЗавершениеФоновогоЗадания"
			И Параметр.Свойство("КлючФЗ")
			И Лев(Параметр.КлючФЗ, 17) = "Выполнение обмена") Тогда
		
		ОбновитьСпискиЗадач();
		
	ИначеЕсли ИмяСобытия = "TracksData"
		И Источник = "ПодключаемоеОборудование"
		И КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ИспользоватьОборудование") Тогда
		
		ОбработкаОповещения_ПЛ_РМ_ИспользоватьОборудование(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		
		Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			Период.ДатаНачала = ТекущаяДатаСеансаНаСервере() - 5 * 86400;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Период.ДатаОкончания = КонецДня(ТекущаяДатаСеансаНаСервере());
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		
		УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1"));
		
	ИначеЕсли СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		
		Если ОтборМедосмотр = "Предсменный" Тогда
			УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2"));
		ИначеЕсли ОтборМедосмотр = "Послесменный" Тогда
			УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6"));
		Иначе
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, "ДатВрПрМО",
				Период.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, "ДатВрПрМО2",
				Период.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, Истина);
		КонецЕсли;
		
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		
		УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3"));
		
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		Если ОтборПоказанияОдометра = "Выезд" Тогда
			УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4"));
		ИначеЕсли ОтборПоказанияОдометра = "Заезд" Тогда
			УстановитьПараметрыДинамическогоСписка(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5"));
		Иначе
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоказанияОдометра, "ДатВрОдометр",
				Период.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, Истина);
			КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоказанияОдометра, "ДатВрОдометр2",
				Период.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДиспетчерПриИзменении(Элемент)
	
	Если ОтборДиспетчер = "НеПодписанные" Тогда
		ИндексыНеПодписанных = Новый Массив;
		ИндексыНеПодписанных.Добавить(ИндексКартинкиЧерновик());
		ИндексыНеПодписанных.Добавить(ИндексКартинкиОтказ());
		ИндексыНеПодписанных.Добавить(ИндексКартинкиОшибка());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиДиспетчер, "ИндексКартинкиСтатусаПодписания",
			ИндексыНеПодписанных, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборДиспетчер = "Подписанные" Тогда
		ИндексыПодписанный = Новый Массив;
		ИндексыПодписанный.Добавить(ИндексКартинкиВыполнитьОбмен());
		ИндексыПодписанный.Добавить(ИндексКартинкиГотово());
		ИндексыПодписанный.Добавить(ИндексКартинкиОтказ());
		ИндексыПодписанный.Добавить(ИндексКартинкиQRКод());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиДиспетчер, "ИндексКартинкиСтатусаПодписания",
			ИндексыПодписанный, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборДиспетчер = "ВПути" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиДиспетчер, "ИндексКартинкиСтатусаПодписания",
			ИндексКартинкиQRКод(), ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборДиспетчер = "Все" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиДиспетчер, "ИндексКартинкиСтатусаПодписания",
			0, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
	ОтборПоНеПодписанным = (ОтборДиспетчер = "НеПодписанные");
	ОтборПодписанные = (ОтборДиспетчер = "Подписанные");
	ОтборВПути = (ОтборДиспетчер = "ВПути");
	
	Элементы.ЗадачиДиспетчерПодписатьТитул.Видимость = (Не ОтборПодписанные И Не ОтборВПути);
	Элементы.ЗадачиДиспетчерСменаВодителя.Видимость = Не ОтборПоНеПодписанным;
	Элементы.ЗадачиДиспетчерОформитьТитул.Видимость = (Не ОтборПодписанные И Не ОтборВПути);
	Элементы.ЗадачиДиспетчерСоздатьТитул1.Видимость = Не ОтборВПути;
	Элементы.ЗадачиДиспетчерСоздатьТитул1Копированием.Видимость = Не ОтборВПути;
	Элементы.ЗадачиДиспетчерСтатусЭТРН.Видимость = Не ОтборПоНеПодписанным;
	Элементы.ГруппаДиспетчерДокументДанныеТитула.Видимость = Не ОтборПоНеПодписанным;
	
	Если ОтборДиспетчер = "ВПути" Тогда
		Элементы.ЗадачиДиспетчерСменаВодителя.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ЗадачиДиспетчерПодписатьТитул.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗадачиДиспетчер.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ГруппаТумблерСменаВодителя.Видимость = (ТекущиеДанные.ИндексКартинкиСтатусаПодписания = ИндексКартинкиQRКод());
		Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = (Не Элементы.ГруппаТумблерСменаВодителя.Видимость);
	Иначе
		Элементы.ГруппаТумблерСменаВодителя.Видимость = Ложь;
		Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ДиспетчерНомерСменыВодителя.Видимость = Не ДиспетчерПрежнийНомер;
	Элементы.ДиспетчерПоказанияОдометраРаботник.Видимость = Не ДиспетчерПрежнийРаботник;
	Элементы.ДиспетчерПоказанияОдометраДолжнось.Видимость = Не ДиспетчерПрежнийРаботник;
	
	ПериодПриИзменении(Неопределено);
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМедосмотрПриИзменении(Элемент)
	
	Если ОтборМедосмотр = "Предсменный" Или ОтборМедосмотр = "Послесменный" Тогда
		
		Элементы.ГруппаМедосмотрСписки.ТекущаяСтраница = Элементы.ГруппаМедосмотрЗадачи;
		Элементы.МедосмотрЗадачиНайти.Видимость = Истина;
		Элементы.МедосмотрСписокНайти.Видимость = Ложь;
		
		Если ОтборМедосмотр = "Предсменный" Тогда
			ОтобразитьОтборДополнительныеКолонки("ЗадачиМедосмотр", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2"));   
		Иначе
			ОтобразитьОтборДополнительныеКолонки("ЗадачиМедосмотр", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6"));  
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаМедосмотрСписки.ТекущаяСтраница = Элементы.ГруппаМедосмотрСписок;
		Элементы.МедосмотрЗадачиНайти.Видимость = Ложь;
		Элементы.МедосмотрСписокНайти.Видимость = Истина;
		УдалитьДополнительныеКолонкиИОтборы("ЗадачиМедосмотр");
	КонецЕсли;
	
	Если ОтборМедосмотр = "Предсменный" Тогда
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиМедосмотр, "СтатусЭТРН",
			КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияМедосмотрПредсменный(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиМедосмотр, "ТребуемоеДействие",
			ТребуемыхДействийАктивные(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборМедосмотр = "Послесменный" Тогда
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиМедосмотр, "СтатусЭТРН",
			КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияМедосмотрПослесменный(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиМедосмотр, "ТребуемоеДействие",
			ТребуемыхДействийАктивные(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборМедосмотр = "Подписанные" Тогда
		ИндексыПодписанный = Новый Массив;
		ИндексыПодписанный.Добавить(ИндексКартинкиВыполнитьОбмен());
		ИндексыПодписанный.Добавить(ИндексКартинкиГотово());
		ИндексыПодписанный.Добавить(ИндексКартинкиQRКод());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, "ИндексКартинкиСтатусаПодписания",
			ИндексыПодписанный, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборМедосмотр = "НеПройденныеМедосмотры" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, "ИндексКартинкиСтатусаПодписания",
			3, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборМедосмотр = "Все" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, "ИндексКартинкиСтатусаПодписания",
			0, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
	Если Элементы.ГруппаМедосмотрЗаполнение.Скрыта()
		И Не ПроверитьЗаполнениеПередПодписанием(Истина) Тогда
		
		Элементы.ГруппаМедосмотрЗаполнение.Показать();
	КонецЕсли;
	
	ПериодПриИзменении(Неопределено);
	
	ЗадачиМедосмотрПриАктивизацииСтроки(Неопределено);
	
	Если ОтборМедосмотр = "Предсменный" Или ОтборМедосмотр = "Послесменный" Тогда
		ЕстьДоступ = ЕстьДоступСозданиеРедактированиеЭлементов(ТипЛогистика);
		
		Элементы.ЗадачиМедосмотрПодписатьТитул.Доступность = ЕстьДоступ;
		Элементы.ЗадачиМедосмотрОтказатьТитул.Доступность = ЕстьДоступ;
		Элементы.ГруппаМедосмотрЗаполнение.Доступность = ЕстьДоступ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТехКонтрольПриИзменении(Элемент)
	
	Если ОтборТехКонтроль = "НеПодписанные" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "СтатусЭТРН",
			КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияТехКонтроль(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ДокументЛогистика",,
			ВидСравненияКомпоновкиДанных.Заполнено,, Ложь);
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "СтатусЭТРН",
			Неопределено, ВидСравненияКомпоновкиДанных.ВСписке,, Ложь);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ДокументЛогистика",,
			ВидСравненияКомпоновкиДанных.Заполнено,, Истина);
	КонецЕсли;
	
	Если ОтборТехКонтроль = "НеПодписанные" Тогда
		ИндексыНеПодписанных = Новый Массив;
		ИндексыНеПодписанных.Добавить(ИндексКартинкиЧерновик());
		ИндексыНеПодписанных.Добавить(ИндексКартинкиОшибка());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ИндексКартинкиСтатусаПодписания",
			ИндексыНеПодписанных, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборТехКонтроль = "Подписанные" Тогда
		ИндексыПодписанный = Новый Массив;
		ИндексыПодписанный.Добавить(ИндексКартинкиВыполнитьОбмен());
		ИндексыПодписанный.Добавить(ИндексКартинкиГотово());
		ИндексыПодписанный.Добавить(ИндексКартинкиQRКод());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ИндексКартинкиСтатусаПодписания",
			ИндексыПодписанный, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборТехКонтроль = "ВыпускНеРазрешен" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ИндексКартинкиСтатусаПодписания",
			3, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	ИначеЕсли ОтборТехКонтроль = "Все" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, "ИндексКартинкиСтатусаПодписания",
			0, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
	Элементы.ЗадачиТехКонтрольПодписатьТитул.Видимость = (ОтборТехКонтроль = "НеПодписанные");
	Элементы.ЗадачиТехКонтрольОтказатьТитул.Видимость = (ОтборТехКонтроль = "НеПодписанные");
	
	Если Элементы.ГруппаТехКонтрольЗаполнение.Скрыта()
		И Не ПроверитьЗаполнениеПередПодписанием(Истина) Тогда
		
		Элементы.ГруппаТехКонтрольЗаполнение.Показать();
	КонецЕсли;
	
	ПериодПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказанияОдометраПриИзменении(Элемент)
	
	ЭтоЗаезд = (ОтборПоказанияОдометра = "Заезд");
	
	Элементы.ПоказанияОдометраЭтоСменаВодителя.Видимость = ЭтоЗаезд;
	
	Если ОтборПоказанияОдометра = "Выезд" Или ОтборПоказанияОдометра = "Заезд" Тогда
		
		Элементы.ГруппаПоказанияОдометраСписки.ТекущаяСтраница = Элементы.ГруппаПоказанияОдометраЗадачи;
		Элементы.ПоказанияОдометраЗадачиНайти.Видимость = Истина;
		Элементы.ПоказанияОдометраСписокНайти.Видимость = Ложь;
		
		Если ОтборПоказанияОдометра = "Выезд" Тогда
			ОтобразитьОтборДополнительныеКолонки("ЗадачиПоказанияОдометра", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4"));
		Иначе
			ОтобразитьОтборДополнительныеКолонки("ЗадачиПоказанияОдометра", ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5"));
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПоказанияОдометраСписки.ТекущаяСтраница = Элементы.ГруппаПоказанияОдометраСписок;
		Элементы.ПоказанияОдометраЗадачиНайти.Видимость = Ложь;
		Элементы.ПоказанияОдометраСписокНайти.Видимость = Истина;
		УдалитьДополнительныеКолонкиИОтборы("ЗадачиПоказанияОдометра");
	КонецЕсли;
	
	Элементы.ГруппаПоказанияОдометраПредыдущие.Видимость = ЭтоЗаезд;
	Элементы.ДекорацияПоказанияОдометраПоказания.Видимость = Не ЭтоЗаезд;
	
	Если ОтборПоказанияОдометра = "Выезд" Тогда
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиПоказанияОдометра, "СтатусЭТРН",
			КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияПоказанияОдометраВыезд(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиПоказанияОдометра, "ТребуемоеДействие",
			ТребуемыхДействийАктивные(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборПоказанияОдометра = "Заезд" Тогда
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5");
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиПоказанияОдометра, "СтатусЭТРН",
			КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостоянияПоказанияОдометраЗаезд(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиПоказанияОдометра, "ТребуемоеДействие",
			ТребуемыхДействийАктивные(), ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборПоказанияОдометра = "Подписанные" Тогда
		ИндексыПодписанный = Новый Массив;
		ИндексыПодписанный.Добавить(ИндексКартинкиВыполнитьОбмен());
		ИндексыПодписанный.Добавить(ИндексКартинкиГотово());
		ИндексыПодписанный.Добавить(ИндексКартинкиQRКод());
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоказанияОдометра, "ИндексКартинкиСтатусаПодписания",
			ИндексыПодписанный, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	ИначеЕсли ОтборПоказанияОдометра = "Все" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоказанияОдометра, "ИндексКартинкиСтатусаПодписания",
			0, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
	Если Элементы.ГруппаПоказанияОдометраЗаполнение.Скрыта()
		И Не ПроверитьЗаполнениеПередПодписанием(Истина) Тогда
		
		Элементы.ГруппаПоказанияОдометраЗаполнение.Показать();
	КонецЕсли;
	
	ПериодПриИзменении(Неопределено);
	
	ЗадачиПоказанияОдометраПриАктивизацииСтроки(Неопределено);
	
	Если ОтборПоказанияОдометра = "Выезд" Или ОтборПоказанияОдометра = "Заезд" Тогда
		ЕстьДоступ = ЕстьДоступСозданиеРедактированиеЭлементов(ТипЛогистика);
		
		Элементы.ЗадачиПоказанияОдометраПодписатьТитул.Доступность = ЕстьДоступ;
		Элементы.ГруппаПоказанияОдометраЗаполнение.Доступность = ЕстьДоступ;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиДиспетчер

&НаКлиенте
Процедура ЗадачиДиспетчерВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ЗадачиДиспетчерСтатусЭТРН" И ТекущиеДанные.ИндексКартинкиСтатусаПодписания = 5 Тогда
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ДокументСсылка", ТекущиеДанные.ДокументЛогистика);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ОтправкаQRКода", ПараметрыОткрытия);
		
	ИначеЕсли ИмяКолонки = "ЗадачиДиспетчерДокументЛогистика" Тогда
		
		ПоказываемТитул = Неопределено;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда 
			ПоказываемТитул = ТекущиеДанные.ДокументЛогистика;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
			ПоказываемТитул = ТекущиеДанные.ПредыдущийТитул;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
			ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ПоказываемТитул, ЭтаФорма);
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.Документ1С, ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиДиспетчерПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗадачиДиспетчер.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаДиспетчерВодитель2.Видимость = ЗначениеЗаполнено(ТекущиеДанные.Водитель2);
	
	ЭтоСправочникЛогистики = ТипЗнч(ТекущиеДанные.ТранспортноеСредство) = Тип("СправочникСсылка.КонтурЛогистика_ТранспортныеСредства");
	
	Если ЕстьНастройкиКонвертацииТС Тогда
		ГрузоподъемностьВТоннах = Элементы.Найти("ДиспетчерДокументТранспортноеСредствоГрузоподъемностьВТоннах");
		Если ГрузоподъемностьВТоннах <> Неопределено Тогда
			ГрузоподъемностьВТоннах.Видимость = Не ЭтоСправочникЛогистики;
		КонецЕсли;
		
		ВместимостьВКубическихМетрах = Элементы.Найти("ДиспетчерТранспортноеСредствоВместимостьВКубическихМетрах");
		Если ВместимостьВКубическихМетрах <> Неопределено Тогда
			ВместимостьВКубическихМетрах.Видимость = Не ЭтоСправочникЛогистики;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияТонн.Видимость = ЭтоСправочникЛогистики;
		Элементы.ДекорацияКубМ.Видимость = ЭтоСправочникЛогистики;
	КонецЕсли;
	
	Если Элементы.Найти("ДиспетчерДокументТранспортноеСредствоГрузоподъемностьВТоннахКЛ") <> Неопределено Тогда
		Элементы.ДиспетчерДокументТранспортноеСредствоГрузоподъемностьВТоннахКЛ.Видимость = ЭтоСправочникЛогистики;
	КонецЕсли;
	Если Элементы.Найти("ДиспетчерТранспортноеСредствоВместимостьВКубическихМетрахКЛ") <> Неопределено Тогда
		Элементы.ДиспетчерТранспортноеСредствоВместимостьВКубическихМетрахКЛ.Видимость = ЭтоСправочникЛогистики;
	КонецЕсли;
	
	// В пути
	СтатусВПути = (ТекущиеДанные.ИндексКартинкиСтатусаПодписания = ИндексКартинкиQRКод());
	Если СтатусВПути Тогда
		Если Не Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость
			И Не Элементы.ГруппаТумблерСменаВодителя.Видимость Тогда
			
			Элементы.ГруппаТумблерСменаВодителя.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.ГруппаТумблерСменаВодителя.Видимость = Ложь;
		Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = Ложь;
	КонецЕсли;
	
	Если СтатусВПути
		И ((ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") И ТекущийЭлемент.Имя = "ЗадачиДиспетчер")
			Или (ТипЗнч(ТекущийЭлемент) = Тип("КнопкаФормы") И ТекущийЭлемент.Имя = "ТумблерСменаВодителя")) Тогда
		ДанныеЗаполнения = Новый Структура("ЭтоСменаВодителя, ОдометрРаботник, Должность, ПоказанияОдометра, ДатВрОдометр, Титул1");
		
		ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5");
		ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4"), ТекущиеДанные.ДокументЛогистика);
		
		ЗаполнитьЧерезНастройкиКонвертации(ДанныеЗаполнения, ТипДокументаЛогистика, ПредыдущийТитул);
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Титул1) Тогда
			ДиспетчерНомерСменыВодителя = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
				ДанныеЗаполнения.Титул1, "НомерПЛ");
		КонецЕсли;
		ДиспетчерПоказанияОдометраРаботник = ДанныеЗаполнения.ОдометрРаботник;
		ДиспетчерПоказанияОдометраДолжнось = ДанныеЗаполнения.Должность;
		ДиспетчерПоказанияОдометраПоказания = ДанныеЗаполнения.ПоказанияОдометра;
		ДиспетчерПоказанияОдометраДатаИВремя = ДанныеЗаполнения.ДатВрОдометр;
		
		ДиспетчерОдометраПоказанияПредыдущие = ПоказанияОдометраТитула4(ТекущиеДанные.ДокументЛогистика);
	КонецЕсли;
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗадачиДиспетчерПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.Документ1С) Тогда 
			ПредставлениеДокумента1С = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(
				СтрокаСписка.Значение.Данные.Номер) + " от " + Формат(СтрокаСписка.Значение.Данные.Дата, "ДФ=dd.MM");
			ОфДок1С = СтрокаСписка.Значение.Оформление.Получить("Документ1С");
			Если ЗначениеЗаполнено(ОфДок1С) Тогда
				ОфДок1С.УстановитьЗначениеПараметра("Текст", ПредставлениеДокумента1С);
			КонецЕсли;
		КонецЕсли;
		
		ОформитьОтображениеДокументЛогистика(Строки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаВодительПлюс1Нажатие(Элемент)
	
	Элементы.КартинкаВодительПлюс1.Видимость = Ложь;
	Элементы.ГруппаДиспетчерСменаВодитель2.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиспетчерНомерВРучнуюПриИзменении(Элемент)
	
	Элементы.ДиспетчерНомерСменыВодителя.Видимость = Не ДиспетчерПрежнийНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиспетчерПрежнийРаботникПриИзменении(Элемент)
	
	Элементы.ДиспетчерПоказанияОдометраРаботник.Видимость = Не ДиспетчерПрежнийРаботник;
	Элементы.ДиспетчерПоказанияОдометраДолжнось.Видимость = Не ДиспетчерПрежнийРаботник;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиМедосмотр

&НаКлиенте
Процедура ЗадачиМедосмотрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ЗадачиМедосмотрПредсменныйДокументЛогистика" Тогда
		
		ПоказываемТитул = Неопределено;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда 
			ПоказываемТитул = ТекущиеДанные.ДокументЛогистика;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
			ПоказываемТитул = ТекущиеДанные.ПредыдущийТитул;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
			ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ПоказываемТитул, ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВсегдаТекущееПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗадачиМедосмотрПредсменныйПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ОформитьОтображениеДокументЛогистика(Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиМедосмотрПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗадачиМедосмотр.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполненияВручнуюМедосмотр Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("МедРаботник, МедЛицензия, Должность, ДатВрПрМО");
	
	Если ОтборМедосмотр = "Предсменный" Тогда
		ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2");
	ИначеЕсли ОтборМедосмотр = "Послесменный" Тогда
		ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6");
	Иначе
		Возврат;
	КонецЕсли;
	
	// Есть черновик, заполним данные заполнения из него
	Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик") Тогда
		Элементы.ДанныеЗаполненияВручнуюМедосмотр.Доступность = Ложь;
		Элементы.ДекорацияДанныеЗаполненияВручнуюМедосмотр.Видимость = Истина;
		ДанныеЗаполнения = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ТекущиеДанные.ДокументЛогистика, ДанныеЗаполнения);
	Иначе
		Элементы.ДанныеЗаполненияВручнуюМедосмотр.Доступность = Истина;
		Элементы.ДекорацияДанныеЗаполненияВручнуюМедосмотр.Видимость = Ложь;
		ЗаполнитьЧерезНастройкиКонвертации(ДанныеЗаполнения, ТипДокументаЛогистика, ТекущиеДанные.ПредыдущийТитул);
	КонецЕсли;
	
	МедРаботник = ДанныеЗаполнения.МедРаботник;
	МедЛицензия = ДанныеЗаполнения.МедЛицензия;
	МедДолжность = ДанныеЗаполнения.Должность;
	МедДатВрПрМО = ДанныеЗаполнения.ДатВрПрМО;
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаполненияВручнуюМедосмотрПриИзменении(Элемент)
	
	ЗадачиМедосмотрПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокМедосмотр

&НаКлиенте
Процедура СписокМедосмотрВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокМедосмотрПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокМедосмотр.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиТехКонтроль

&НаКлиенте
Процедура ЗадачиТехКонтрольВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ЗадачиТехКонтрольДокументЛогистика" Тогда
		
		ПоказываемТитул = Неопределено;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда 
			ПоказываемТитул = ТекущиеДанные.ДокументЛогистика;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
			ПоказываемТитул = ТекущиеДанные.ПредыдущийТитул;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
			ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ПоказываемТитул, ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗадачиТехКонтрольПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ОформитьОтображениеДокументЛогистика(Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКонтрольДатВрКонтВсегдаТекущееПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКонтрольДатВрВыпВсегдаТекущееПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиТехКонтрольПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗадачиТехКонтроль.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполненияВручнуюТехКонтроль Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ТехРаботник, Должность, ДатВрКонтТехСост, ДатВрВыпНаЛин");
	
	// Есть черновик, заполним данные заполнения из него
	Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик") Тогда
		Элементы.ДанныеЗаполненияВручнуюТехКонтроль.Доступность = Ложь;
		Элементы.ДекорацияДанныеЗаполненияВручнуюТехКонтроль.Видимость = Истина;
		ДанныеЗаполнения = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ТекущиеДанные.ДокументЛогистика, ДанныеЗаполнения);
	Иначе
		Элементы.ДанныеЗаполненияВручнуюТехКонтроль.Доступность = Истина;
		Элементы.ДекорацияДанныеЗаполненияВручнуюТехКонтроль.Видимость = Ложь;
		ЗаполнитьЧерезНастройкиКонвертации(ДанныеЗаполнения,
			ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3"),
			ТекущиеДанные.ПредыдущийТитул);
	КонецЕсли;
	
	ТехКонтрольРаботник = ДанныеЗаполнения.ТехРаботник;
	ТехКонтрольДолжность = ДанныеЗаполнения.Должность;
	ТехКонтрольДатВрКонтТехСост = ДанныеЗаполнения.ДатВрКонтТехСост;
	ТехКонтрольДатВрВыпНаЛин = ДанныеЗаполнения.ДатВрВыпНаЛин;
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаполненияВручнуюТехКонтрольПриИзменении(Элемент)
	
	ЗадачиТехКонтрольПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачиПоказанияОдометра

&НаКлиенте
Процедура ЗадачиПоказанияОдометраВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Поле.Имя;
	
	Если ИмяКолонки = "ЗадачиПоказанияОдометраДокументЛогистика" Тогда
		
		ПоказываемТитул = Неопределено;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда 
			ПоказываемТитул = ТекущиеДанные.ДокументЛогистика;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
			ПоказываемТитул = ТекущиеДанные.ПредыдущийТитул;
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументЭТРН) Тогда
			ПоказываемТитул = ТекущиеДанные.ДокументЭТРН;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПоказываемТитул) Тогда
			КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ПоказываемТитул, ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПоказанияОдометраПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЗадачиПоказанияОдометра.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполненияВручнуюПоказанияОдометра Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборПоказанияОдометра <> "Выезд" И ОтборПоказанияОдометра <> "Заезд" Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТекПоказанияОдометраРеквизитыЧерезНастройкуКонвертации(ТекущиеДанные);
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекПоказанияОдометраРеквизитыЧерезНастройкуКонвертации(Знач ТекущиеДанные)
	
	Перем ДанныеЗаполнения, ТипДокументаЛогистика;
	
	Если ОтборПоказанияОдометра = "Заезд" Тогда
		ОдометраПоказанияПредыдущие = ПоказанияОдометраТитула4(ТекущиеДанные.ГлавныйДокумент);
	КонецЕсли;
	
	Если ОтборПоказанияОдометра = "Выезд" Тогда
		ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4");
	ИначеЕсли ОтборПоказанияОдометра = "Заезд" Тогда
		ТипДокументаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5");
	Иначе
		ВызватьИсключение "ОтборПоказанияОдометра не заполнен";
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура("ЭтоСменаВодителя, ОдометрРаботник, Должность, ПоказанияОдометра, ДатВрОдометр");
	
	// Есть черновик, заполним данные заполнения из него
	Если ТекущиеДанные.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик") Тогда
		Элементы.ДанныеЗаполненияВручнуюПоказанияОдометра.Доступность = Ложь;
		Элементы.ДекорацияДанныеЗаполненияВручнуюПоказанияОдометра.Видимость = Истина;
		ДанныеЗаполнения = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ТекущиеДанные.ДокументЛогистика, ДанныеЗаполнения);
	Иначе
		Элементы.ДанныеЗаполненияВручнуюПоказанияОдометра.Доступность = Истина;
		Элементы.ДекорацияДанныеЗаполненияВручнуюПоказанияОдометра.Видимость = Ложь;
		ЗаполнитьЧерезНастройкиКонвертации(ДанныеЗаполнения, ТипДокументаЛогистика, ТекущиеДанные.ПредыдущийТитул);
	КонецЕсли;
	
	ПоказанияОдометраЭтоСменаВодителя = ДанныеЗаполнения.ЭтоСменаВодителя;
	ПоказанияОдометраРаботник = ДанныеЗаполнения.ОдометрРаботник;
	ПоказанияОдометраДолжнось = ДанныеЗаполнения.Должность;
	ПоказанияОдометраПоказания = ДанныеЗаполнения.ПоказанияОдометра;
	ПоказанияОдометраДатаИВремя = ДанныеЗаполнения.ДатВрОдометр;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаполненияВручнуюПоказанияОдометраПриИзменении(Элемент)
	
	ЗадачиПоказанияОдометраПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказанияОдометраТитула4(Титул1)
	
	ПоказанияОдометра = 0;
	
	Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4, Титул1);
	
	Если ЗначениеЗаполнено(Титул4) Тогда
		ПоказанияОдометра = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаСсылки(Титул4, "ПоказанияОдометра");
	КонецЕсли;
	
	Возврат ПоказанияОдометра;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗадачиПоказанияОдометраПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ОформитьОтображениеДокументЛогистика(Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОдометраДатаИВремяВсегдаТекущееПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиспетчерПоказанияОдометраДатаИВремяВсегдаТекущееПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПоказанияОдометра

&НаКлиенте
Процедура СписокПоказанияОдометраВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПоказанияОдометраПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокПоказанияОдометра.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоказанияТоплива(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Диспетчер(Команда)
	
	ТекущиВидАРМ = "Диспетчер";
	
	ПриСменеСтранициЗадачНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Медосмотр(Команда)
	
	ТекущиВидАРМ = "Медосмотр";
	
	ПриСменеСтранициЗадачНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКонтроль(Команда)
	
	ТекущиВидАРМ = "ТехКонтроль";
	
	ПриСменеСтранициЗадачНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОдометра(Команда)
	
	ТекущиВидАРМ = "ПоказанияОдометра";
	
	ПриСменеСтранициЗадачНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	Если ЗначениеЗаполнено(ИдентификаторФЗ_ВыполнитьОбмен) Тогда 
		
		// Открываем отслеживание
		КонтурЛогистика_ДлительныеОперацииКлиент.СледитьЗаФоновымЗаданиемВФорме(ИдентификаторФЗ_ВыполнитьОбмен, "Фоновое задание Выполнение обмена", Ложь);
		
	Иначе
		
		// Запускаем новое
		АдресРезультатаВыполнитьОбмен = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",,
			"КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьОбмен",
			"Фоновое задание Выполнение обмена",
			АдресРезультатаВыполнитьОбмен);
		
		Если РезультатЗапуска.Статус = "Выполняется" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = РезультатЗапуска.ИдентификаторЗадания;
			
			Для Каждого ТекущаяКоманда Из ЭлементыКодмандОбмена() Цикл
				ТекущаяКоманда.Картинка = БиблиотекаКартинок.КонтурЛогистика_Лоадер16;
				ТекущаяКоманда.Заголовок = "Обмен выполняется";
				ТекущаяКоманда.ЦветТекста = WebЦвета.Серый;
			КонецЦикла;
			
			ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", 0.1, Истина);
			
		ИначеЕсли РезультатЗапуска.Статус = "Выполнено" Тогда
			
			ИдентификаторФЗ_ВыполнитьОбмен = "";
			ПроверитьФоновоеЗаданиеВыполнитьОбмен();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиЗадач();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокИсходныхДокументов(Команда)
	
	ТипыДокументов1СМассив = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТипыЗначенияДокумента1С(ТипЛогистика);
	
	Для Каждого ВозможныйТипДокументаКонфигурации Из ТипыДокументов1СМассив Цикл
		Если Не ЗначениеЗаполнено(ВозможныйТипДокументаКонфигурации) Тогда
			Продолжить;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Документ." + ВозможныйТипДокументаКонфигурации + ".ФормаСписка",,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьТитул(Команда)
	
	Если Элементы.ЗадачиДиспетчер.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗадачиДиспетчер.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ДокументЛогистика);
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = ТекущиеДанные.Документ1С;
	
	Разделители = КонтурЛогистика_ОбработкаДокументовКлиент.РассчитатьРазделительДокументаУчетнойСистемы(ТипЛогистика, ДокументСсылка);
	Если Разделители = Неопределено Или Разделители.Количество() < 2 Тогда	// Можно открыть форму нового
		
		ДанныеЗаполнения = Новый Структура("ДокументОснование, ТипЛогистика", ДокументСсылка, ТипЛогистика);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Документ." + КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) + ".ФормаОбъекта",
			ПараметрыФормы);
		
	Иначе
		
		ДокументыОснования = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка);
		КонтурЛогистика_ОбработкаДокументовСервер.ВвестиДокументыПакетно(ДокументыОснования, Ложь, ТипЛогистика);
		ОбновитьСпискиЗадач();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТитул1(Команда)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Документ.КонтурЛогистика_ПЛ_Титул1.Форма.ФормаДокумента",, ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТитул1Копированием(Команда)
	
	Если Элементы.ЗадачиДиспетчер.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗадачиДиспетчер.ТекущиеДанные;
	
	ТекстОшибкиСоздания = "Создать копированием можно только титулы введенные вручную";
	Если ЗначениеЗаполнено(ТекущиеДанные.Документ1С) Тогда
		Сообщить(ТекстОшибкиСоздания);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда
		Сообщить(ТекстОшибкиСоздания);
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИндексКартинкиСтатусаПодписания = ИндексКартинкиОтказ() Тогда
		// Открываем текущий
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ТекущиеДанные.ДокументЛогистика, ЭтаФорма);
	Иначе
		// Формируем новый
		ПараметрыФомры = Новый Структура;
		ПараметрыФомры.Вставить("ЗначениеКопирования", ТекущиеДанные.ДокументЛогистика);
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
			"Документ.КонтурЛогистика_ПЛ_Титул1.Форма.ФормаДокумента", ПараметрыФомры,
			ЭтаФорма, ЭтаФорма,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МедВремяМедосмотраСейчас(Команда)
	
	МедДатВрПрМО = ТекущаяДатаСеансаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКонтрольДатВрВыпНаЛинСейчас(Команда)
	
	ТехКонтрольДатВрВыпНаЛин = ТекущаяДатаСеансаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехКонтрольДатВрКонтТехСостСейчас(Команда)
	
	ТехКонтрольДатВрКонтТехСост = ТекущаяДатаСеансаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОдометраДатаИВремяСейчас(Команда)
	
	ПоказанияОдометраДатаИВремя = ТекущаяДатаСеансаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиспетчерПоказанияОдометраДатаИВремяСейчас(Команда)
	
	ДиспетчерПоказанияОдометраДатаИВремя = ТекущаяДатаСеансаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СменаВодителя(Команда)
	
	ОчиститьСообщения();
	
	ТекущийСписокЗадач = Элементы.ЗадачиДиспетчер;
	
	Если ТекущийСписокЗадач.ВыделенныеСтроки.Количество() > 1 Тогда
		Сообщить("Нельзя оформить смену водителя для нескольких документов.");
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеСменыВодителя() Тогда
		Возврат;
	КонецЕсли;
	
	Титул5Ссылка = ОтправкаСменыВодителяТитула5(ТекущийСписокЗадач);
	Если Титул5Ссылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтправкаСменыВодителяТитула1(Титул5Ссылка);
	
	// Очистим важные поля заполнения
	ДиспетчерНомерСменыВодителя = "";
	ДиспетчерВодитель = Неопределено;
	ДиспетчерПоказанияОдометраПоказания = 0;
	
	ОбновитьСпискиЗадач();
	
	ТумблерСменаВодителяЗакрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеСменыВодителя()
	
	Результат = Истина;
	
	// Номер
	Если Не ДиспетчерПрежнийНомер И Не ЗначениеЗаполнено(ДиспетчерНомерСменыВодителя) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить номер";
		ПараметрыСообщения.ПутьКДанным  = "ДиспетчерНомерСменыВодителя";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	// Водитель
	Если Не ЗначениеЗаполнено(ДиспетчерВодитель) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить водителя";
		ПараметрыСообщения.ПутьКДанным  = "ДиспетчерВодитель";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	// Ответственный
	Если Не ДиспетчерПрежнийРаботник И Не ЗначениеЗаполнено(ДиспетчерПоказанияОдометраРаботник) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить ответственного";
		ПараметрыСообщения.ПутьКДанным  = "ДиспетчерПоказанияОдометраРаботник";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	// Показания одометра
	Если Не ЗначениеЗаполнено(ДиспетчерПоказанияОдометраПоказания) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить показания одометра";
		ПараметрыСообщения.ПутьКДанным  = "ДиспетчерПоказанияОдометраПоказания";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	// Дата и время
	Если Не ДиспетчерПоказанияОдометраДатаИВремяВсегдаТекущее И Не ЗначениеЗаполнено(ДиспетчерПоказанияОдометраДатаИВремя) Тогда
		ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
		ПараметрыСообщения.Текст = "Необходимо заполнить дату и время";
		ПараметрыСообщения.ПутьКДанным  = "ДиспетчерПоказанияОдометраДатаИВремя";
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОтправкаСменыВодителяТитула5(ТекущийСписокЗадач)
	
	ОбработанныеДокументы = Новый Массив;
	
	ДокументыКОбработке = ДокументыКОбработкеИзСпискаЗадач(ТекущийСписокЗадач, Истина);
	
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5");
	РезультатИзготовления = ИзготовитьФайлыОбмена(ДокументыКОбработке, ОбработанныеДокументы);
	ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1");
	
	Если РезультатИзготовления.Успех Тогда
		ИзготовленныеФайлыОбмена = РезультатИзготовления.ИзготовленныеФайлыОбмена;
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(РезультатИзготовления.ДокументСОшибкой);
		Возврат Неопределено;
	КонецЕсли;
	
	ПодписанныеФайлыОбмена = ПодписатьФайлы(ИзготовленныеФайлыОбмена);
	Если ТипЗнч(ПодписанныеФайлыОбмена) = Тип("Массив") И ПодписанныеФайлыОбмена.Количество() = 0 Тогда
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ИзготовленныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика);
		Возврат Неопределено;
	КонецЕсли;
	
	РезультатОтправкиУспешно = ОтправитьПодписанныеФайлы(ПодписанныеФайлыОбмена);
	
	Если РезультатОтправкиУспешно Тогда
		Если ОбработанныеДокументы.Количество() = 1 Тогда
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ОбработанныеДокументы[0]);
			ПоказатьОповещениеПользователя("Отправлен", НавигационнаяСсылка, Строка(ОбработанныеДокументы[0]));
		Иначе
			ПоказатьОповещениеПользователя(,, "Отправлено документов: " + Строка(Формат(ОбработанныеДокументы.Количество(), "ЧДЦ=0; ЧГ=")));
		КонецЕсли;
	Иначе
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ПодписанныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбработанныеДокументы[0];
	
КонецФункции

&НаКлиенте
Функция ОтправкаСменыВодителяТитула1(Титул5Ссылка)
	
	Результат = Истина;
	
	ОбработанныеДокументы = Новый Массив;
	
	Титул1Ссылка = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
		Титул5Ссылка, "Титул1");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Водитель", ДиспетчерВодитель);
	Если ЗначениеЗаполнено(ДиспетчерВодитель2) Тогда
		ДополнительныеПараметры.Вставить("Водитель2", ДиспетчерВодитель2);
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ПредыдущийПЛ", Титул1Ссылка);
	Если Не ДиспетчерПрежнийНомер Тогда
		ДополнительныеПараметры.Вставить("НомерПЛ", ДиспетчерНомерСменыВодителя);
	КонецЕсли;
	
	ДанныеОтправки = Новый Структура;
	ДанныеОтправки.Вставить("ПредыдущийТитул", Титул5Ссылка);
	ДанныеОтправки.Вставить("ДокументЛогистика", Титул5Ссылка);
	ДанныеОтправки.Вставить("ДополнительныеПараметры", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры));
	
	ДокументыКОбработке = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОтправки);
	
	РезультатИзготовления = ИзготовитьФайлыОбменаСменыВодителя(ДокументыКОбработке, ОбработанныеДокументы);
	
	Если РезультатИзготовления.Успех Тогда
		ИзготовленныеФайлыОбмена = РезультатИзготовления.ИзготовленныеФайлыОбмена;
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(РезультатИзготовления.ДокументСОшибкой);
		Возврат Ложь;
	КонецЕсли;
	
	ПодписанныеФайлыОбмена = ПодписатьФайлы(ИзготовленныеФайлыОбмена);
	Если ТипЗнч(ПодписанныеФайлыОбмена) = Тип("Массив") И ПодписанныеФайлыОбмена.Количество() = 0 Тогда
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ИзготовленныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика);
		Возврат Ложь;
	КонецЕсли;
	
	РезультатОтправкиУспешно = ОтправитьПодписанныеФайлы(ПодписанныеФайлыОбмена);
	
	Если РезультатОтправкиУспешно Тогда
		Если ОбработанныеДокументы.Количество() = 1 Тогда
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ОбработанныеДокументы[0]);
			ПоказатьОповещениеПользователя("Отправлен", НавигационнаяСсылка, Строка(ОбработанныеДокументы[0]));
		Иначе
			ПоказатьОповещениеПользователя(,, "Отправлено документов: " + Строка(Формат(ОбработанныеДокументы.Количество(), "ЧДЦ=0; ЧГ=")));
		КонецЕсли;
		
		СоздатьЧерновикТ4(ОбработанныеДокументы[0], Титул5Ссылка);
	Иначе
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ПодписанныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьЧерновикТ4(Титул1Ссылка, Титул5Ссылка)
	
	ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4;
	МассивПредыдущихТитулов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Титул1Ссылка);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПоказанияОдометра", Титул5Ссылка.ПоказанияОдометра);
	
	МассивДополнительныеПараметры = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры);
	
	РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
		МассивПредыдущихТитулов, ТипЛогистика, Ложь, МассивДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьТитул(Команда)
	
	ОчиститьСообщения();
	
	Если ПоказанияОдометраПоказания = 0 И ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика(
			0, "Укажите показания одометра", Тип("Число"), ЭтаФорма, "ОбработчикПродолжитьПодписание");
		
	Иначе
		
		Если ПодписыватьБезВопросов Тогда
			ПодписатьТитулНаКлиенте();
		Иначе
			
			// Формируем текст заголовка
			ТекущийСписокЗадач = Элементы["Задачи" + ТекущиВидАРМ];
			Если ТекущийСписокЗадач.ВыделенныеСтроки.Количество() = 1 Тогда
				ТекущиеДанные = ТекущийСписокЗадач.ДанныеСтроки(ТекущийСписокЗадач.ВыделенныеСтроки[0]);
				
				Если ТекущиеДанные.ИндексКартинкиСтатусаПодписания = ИндексКартинкиОтказ() Тогда
					ОформитьТитул(Неопределено);
					Возврат;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекущиеДанные.НомерТрН) Тогда
					ТекстЗаголовка = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
						"Путевой лист №%1 от %2", ТекущиеДанные.НомерТрН, Формат(ТекущиеДанные.ДатаТрН, "ДФ=dd.MM.yy"));
				Иначе
					ТекстЗаголовка = "Подписание...";
				КонецЕсли;
			Иначе
				ТекстЗаголовка = "Выбрано документов: " + Формат(ТекущийСписокЗадач.ВыделенныеСтроки.Количество(), "ЧДЦ=0; ЧГ=0");
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ТекстВопроса", "Выполнить подписание?");
			ПараметрыФормы.Вставить("Заголовок", ТекстЗаголовка);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
				"ОбщаяФорма.КонтурЛогистика_ВопросРасширенный", ПараметрыФормы, ЭтаФорма, ЭтаФорма,
				"ПодписатьТитулВопросЗавершение",, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПродолжитьПодписание(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Параметр1) Тогда
		ПоказанияОдометраПоказания = Параметр1;
		ПодписатьТитул(ЭтаФорма.Команды.Найти("ПодписатьТитул"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьТитулВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("БольшеНеСпрашивать") Тогда
		ПодписыватьБезВопросов = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Ответ Тогда
		Возврат;
	КонецЕсли;
	
	ПодписатьТитулНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьТитулНаКлиенте()
	
	ТекущийСписокЗадач = Элементы["Задачи" + ТекущиВидАРМ];
	
	Если Не ПроверитьЗаполнениеПередПодписанием(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиВидАРМ = "ПоказанияОдометра"
		И ДанныеЗаполненияВручнуюПоказанияОдометра
		И ТекущийСписокЗадач.ВыделенныеСтроки.Количество() > 1 Тогда
		
		Сообщить("Нельзя подписать несколько документов показания одометра, так как в режиме ""Вручную"" для каждого документа свои показания.");
		Возврат;
	КонецЕсли;
	
	ОбработанныеДокументы = Новый Массив;
	
	ДокументыКОбработке = ДокументыКОбработкеИзСпискаЗадач(ТекущийСписокЗадач);
	
	РезультатИзготовления = ИзготовитьФайлыОбмена(ДокументыКОбработке, ОбработанныеДокументы);
	Если РезультатИзготовления.Успех Тогда
		ИзготовленныеФайлыОбмена = РезультатИзготовления.ИзготовленныеФайлыОбмена;
	Иначе
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(РезультатИзготовления.ДокументСОшибкой);
		Возврат;
	КонецЕсли;
	
	ПодписанныеФайлыОбмена = ПодписатьФайлы(ИзготовленныеФайлыОбмена);
	Если ТипЗнч(ПодписанныеФайлыОбмена) = Тип("Массив") И ПодписанныеФайлыОбмена.Количество() = 0 Тогда
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
			ИзготовленныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика.СвязанныйДокумент);
		Возврат;
	КонецЕсли;
	
	РезультатОтправкиУспешно = ОтправитьПодписанныеФайлы(ПодписанныеФайлыОбмена);
	
	Если ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		ОтправитьQRКодыДокументов(ПодписанныеФайлыОбмена);
	КонецЕсли;
	
	Если РезультатОтправкиУспешно Тогда
		Если ОбработанныеДокументы.Количество() = 1 Тогда
			НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ОбработанныеДокументы[0]);
			ПоказатьОповещениеПользователя("Отправлен", НавигационнаяСсылка, Строка(ОбработанныеДокументы[0]));
		Иначе
			ПоказатьОповещениеПользователя(,, "Отправлено документов: " + Строка(Формат(ОбработанныеДокументы.Количество(), "ЧДЦ=0; ЧГ=")));
		КонецЕсли;
	Иначе
		ДокументЛогистика = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			ПодписанныеФайлыОбмена[0], "СвязанныйДокумент");
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(ДокументЛогистика);
	КонецЕсли;
	
	Если ТекущиВидАРМ = "ПоказанияОдометра" И РезультатОтправкиУспешно Тогда
		ПоказанияОдометраПоказания = 0;
	КонецЕсли;
	
	ОбновитьСпискиЗадач();
	
КонецПроцедуры

&НаСервере
Функция ИзготовитьФайлыОбмена(ДокументыКОбработке, ОбработанныеДокументы)
	
	РезультатИзготовления = Новый Структура;
	РезультатИзготовления.Вставить("Успех", Истина);
	РезультатИзготовления.Вставить("ИзготовленныеФайлыОбмена", Новый Массив);
	РезультатИзготовления.Вставить("ДокументСОшибкой");
	
	Для Каждого ТекущаяСтрока Из ДокументыКОбработке Цикл
		
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДокументЛогистика) Тогда
				МассивДокументов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ДокументЛогистика);
			Иначе
				МассивДокументов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.Документ1С);
			КонецЕсли;
			
			ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика",
				МассивДокументов, ТипЛогистика);
			
		Иначе
			
			МассивПредыдущихТитулов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ПредыдущийТитул);
			
			РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
				МассивПредыдущихТитулов, ТипЛогистика, Ложь, ТекущаяСтрока.ДополнительныеПараметры);
			ВведенныеДокументы = РезультатВвода.ВведенныеДокументы;
			
			ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ВведенныеДокументы);
			
		КонецЕсли;
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		// Изготавливаем файл
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если МассивФайловОбмена.Количество() = 0 Тогда
			// Не удалось сфоромировать
			РезультатИзготовления.Успех = Ложь;
			
			УжеВведенныеДокументы = КонтурЛогистика_ОбработкаДокументовСервер.УжеВведенныеДокументыЛогистикаПоДокументу1С(
				ПараметрыВводаДокументов.МассивДокументов[0], ТипЛогистика);
			Если УжеВведенныеДокументы.Количество() > 0 Тогда
				РезультатИзготовления.ДокументСОшибкой = УжеВведенныеДокументы[0];
			Иначе
				РезультатИзготовления.ДокументСОшибкой = ПараметрыВводаДокументов.МассивДокументов[0];
			КонецЕсли;
			
			Возврат РезультатИзготовления;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			РезультатИзготовления.ИзготовленныеФайлыОбмена, МассивФайловОбмена, Истина);
		
		// Для оповещения
		Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			Если МассивФайловОбмена.Количество() <> 0 Тогда
				ОбработанныеДокументы.Добавить(МассивФайловОбмена[0].ГлавныйДокумент);
			КонецЕсли;
		Иначе
			ОбработанныеДокументы.Добавить(ВведенныеДокументы[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатИзготовления;
	
КонецФункции

&НаСервере
Функция ИзготовитьФайлыОбменаСменыВодителя(ДокументыКОбработке, ОбработанныеДокументы)
	
	РезультатИзготовления = Новый Структура;
	РезультатИзготовления.Вставить("Успех", Истина);
	РезультатИзготовления.Вставить("ИзготовленныеФайлыОбмена", Новый Массив);
	РезультатИзготовления.Вставить("ДокументСОшибкой");
	
	Для Каждого ТекущаяСтрока Из ДокументыКОбработке Цикл
		
		МассивПредыдущихТитулов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ПредыдущийТитул);
		
		РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
			МассивПредыдущихТитулов, ТипЛогистика, Ложь, ТекущаяСтрока.ДополнительныеПараметры);
		ВведенныеДокументы = РезультатВвода.ВведенныеДокументы;
		
		ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ВведенныеДокументы);
		
		ПараметрыФормированияФайловРеквизиты = Новый Структура;
		ПараметрыФормированияФайловРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		
		// Изготавливаем файл
		МассивФайловОбмена = КонтурЛогистика_ОбработкаДокументовСервер.ИзготовитьФайлыОбмена(
			ПараметрыВводаДокументов, ПараметрыФормированияФайловРеквизиты);
		
		Если МассивФайловОбмена.Количество() = 0 Тогда
			// Не удалось сфоромировать
			РезультатИзготовления.Успех = Ложь;
			
			УжеВведенныеДокументы = КонтурЛогистика_ОбработкаДокументовСервер.УжеВведенныеДокументыЛогистикаПоДокументу1С(
				ПараметрыВводаДокументов.МассивДокументов[0], ТипЛогистика);
			Если УжеВведенныеДокументы.Количество() > 0 Тогда
				РезультатИзготовления.ДокументСОшибкой = УжеВведенныеДокументы[0];
			Иначе
				РезультатИзготовления.ДокументСОшибкой = ПараметрыВводаДокументов.МассивДокументов[0];
			КонецЕсли;
			
			Возврат РезультатИзготовления;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			РезультатИзготовления.ИзготовленныеФайлыОбмена, МассивФайловОбмена, Истина);
		
		// Для оповещения
		ОбработанныеДокументы.Добавить(ВведенныеДокументы[0]);
		
	КонецЦикла;
	
	Возврат РезультатИзготовления;
	
КонецФункции

&НаКлиенте
Функция ПодписатьФайлы(ИзготовленныеФайлыОбмена)
	
	Возврат КонтурЛогистика_ОбработкаДокументовКлиент.ПодписатьФайлыОбмена(ИзготовленныеФайлыОбмена);
	
КонецФункции

&НаСервере
Функция ОтправитьПодписанныеФайлы(ФайлыОбменаКОтправке)
	
	Если ФайлыОбменаКОтправке.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Непосредственно отправка
	РезультатОтправки = КонтурЛогистика_ОбработкаДокументовСервер.ОтправитьФайлыВДиадок(ФайлыОбменаКОтправке);
	
	Если Не РезультатОтправки.Успешно Тогда
		ТекстОшибки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатОтправки);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Проблемы при отправке документов: " + ТекстОшибки);
	КонецЕсли;
	
	Возврат РезультатОтправки.Успешно;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьQRКодыДокументов(МассивФайлов)
	
	Если Не КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("АвтоматическоеПолучениеИОтправкаQRКодов") Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКОбработке = Новый Массив;
	
	Для Каждого ТекущийДокумент Из МассивФайлов Цикл
		ГлавныйДок = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ТекущийДокумент, "ГлавныйДокумент");
		Если ЗначениеЗаполнено(ГлавныйДок) Тогда 
			ДокументыКОбработке.Добавить(ГлавныйДок);  
		КонецЕсли;
	КонецЦикла;
	
	Если ДокументыКОбработке.Количество() <> 0 Тогда
		
		КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание("КонтурЛогистика_ДлительныеОперацииСервер.ОчередьОтправкиQRКодовПолучитьОтправить",
								Новый Структура("ДокументыКОбработке", ДокументыКОбработке),
								"ПолучениеИОтправкаQRКодовПоток_" + Строка(Новый УникальныйИдентификатор),
								"Получение и отправка QR кодов")
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеПередПодписанием(ТихийРежим)
	
	Результат = Истина;
	
	Если СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		
		Если Не ЗначениеЗаполнено(МедРаботник) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Медработник";
				ПараметрыСообщения.ПутьКДанным = "МедРаботник";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(МедЛицензия) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Лицензия";
				ПараметрыСообщения.ПутьКДанным = "МедЛицензия";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не МедВремяВсегдаТекущее И Не ЗначениеЗаполнено(МедДатВрПрМО) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Дата и время проведеня";
				ПараметрыСообщения.ПутьКДанным = "МедДатВрПрМО";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		
		Если Не ЗначениеЗаполнено(ТехКонтрольРаботник) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Тех. работник";
				ПараметрыСообщения.ПутьКДанным = "ТехКонтрольРаботник";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не ТехКонтрольДатВрКонтВсегдаТекущее И Не ЗначениеЗаполнено(ТехКонтрольДатВрКонтТехСост) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Дата и время проведения";
				ПараметрыСообщения.ПутьКДанным = "ТехКонтрольДатВрКонтТехСост";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не ТехКонтрольДатВрВыпВсегдаТекущее И Не ЗначениеЗаполнено(ТехКонтрольДатВрВыпНаЛин) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Вып. на линию";
				ПараметрыСообщения.ПутьКДанным = "ТехКонтрольДатВрВыпНаЛин";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		Если Не ЗначениеЗаполнено(ПоказанияОдометраРаботник) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Ответственный";
				ПараметрыСообщения.ПутьКДанным = "ПоказанияОдометраРаботник";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПоказанияОдометраПоказания) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Показания одометра";
				ПараметрыСообщения.ПутьКДанным = "ПоказанияОдометраПоказания";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
		Если Не ПоказанияОдометраДатаИВремяВсегдаТекущее И Не ЗначениеЗаполнено(ПоказанияОдометраДатаИВремя) Тогда
			Если Не ТихийРежим Тогда
				ПараметрыСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПараметрыСообщения();
				ПараметрыСообщения.Текст = "Не заполнено поле Дата и время";
				ПараметрыСообщения.ПутьКДанным = "ПоказанияОдометраДатаИВремя";
				
				КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПоказатьСообщение(ПараметрыСообщения);
			КонецЕсли;
			
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтказатьТитул(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы["Задачи" + ТекущиВидАРМ].ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеПередПодписанием(Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьВводЗначения_КонтурЛогистика("", "Укажите причину отказа в подписи",
		Тип("Строка"), ЭтаФорма, "ПослеВводаПричиныОтказа");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПричиныОтказа(ПричинаОтказа, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПричинаОтказа) Тогда 
		
		//Возврат;
		ВызватьИсключение "Вы не указали причину отказа";
		
	КонецЕсли;
	
	ДокументыКОбработке = ДокументыКОбработкеИзСпискаЗадач(Элементы["Задачи" + ТекущиВидАРМ]);
	
	ОтказатьТитулНаКлиенте(ПричинаОтказа, ДокументыКОбработке);
	
	ОбновитьСпискиЗадач();
	
	Оповестить("КонтурЛогистика_ОбновитьЗадачи");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказатьТитулНаКлиенте(ПричинаОтказа, ДокументыКОбработке)
	
	Для Каждого ТекущаяСтрока Из ДокументыКОбработке Цикл
		
		МассивПредыдущихТитулов = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока.ПредыдущийТитул);
		
		РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
			МассивПредыдущихТитулов, ТипЛогистика, Ложь, ТекущаяСтрока.ДополнительныеПараметры);
		ВведенныеДокументы = РезультатВвода.ВведенныеДокументы;
		
		Для Каждого ТекущийДокумент Из ВведенныеДокументы Цикл
			#Если ВебКлиент Тогда
				КонтурЛогистика_ОбработкаДокументовКлиент.ПослеВводаПричиныОтказаНаВебКлиенте(ПричинаОтказа, ТекущийДокумент, ЭтаФорма);
			#Иначе
				КонтурЛогистика_ОбработкаДокументовКлиент.ПослеВводаПричиныОтказаНаКлиенте(ПричинаОтказа, ТекущийДокумент);
			#КонецЕсли
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДокументыКОбработкеИзСпискаЗадач(ТекущийСписокЗадач, ЭтоСменаВодителя = Ложь)
	
	ДокументыКОбработке = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ТекущийСписокЗадач.ВыделенныеСтроки Цикл
		ТекущиеДанные = ТекущийСписокЗадач.ДанныеСтроки(ТекущаяСтрока);
		
		// Не даем подписать титул с отказом медика или тех контроля
		Если ТекущиеДанные.ИндексКартинкиСтатусаПодписания = ИндексКартинкиОтказ() Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		
		Если ЭтоСменаВодителя Тогда
			
			ПредыдущийТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(
				ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4"),
				ТекущиеДанные.ДокументЛогистика);
			
			ДополнительныеПараметры.Вставить("ЭтоСменаВодителя", ЭтоСменаВодителя);
			Если ДиспетчерПрежнийРаботник Тогда
				
				Если ЗначениеЗаполнено(ПредыдущийТитул) Тогда
					ДанныеОтветственногоИзПредыдущегоТитула = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
						ПредыдущийТитул, "ОдометрРаботник, Должность");
					ДополнительныеПараметры.Вставить("ОдометрРаботник", ДанныеОтветственногоИзПредыдущегоТитула.ОдометрРаботник);
					ДополнительныеПараметры.Вставить("Должность", ДанныеОтветственногоИзПредыдущегоТитула.Должность);
				КонецЕсли;
				
			Иначе
				
				Если ЗначениеЗаполнено(ДиспетчерПоказанияОдометраРаботник) Тогда
					ДополнительныеПараметры.Вставить("ОдометрРаботник", ДиспетчерПоказанияОдометраРаботник);
				КонецЕсли;
				Если ЗначениеЗаполнено(ДиспетчерПоказанияОдометраДолжнось) Тогда
					ДополнительныеПараметры.Вставить("Должность", ДиспетчерПоказанияОдометраДолжнось);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДиспетчерПоказанияОдометраПоказания) Тогда
				ДополнительныеПараметры.Вставить("ПоказанияОдометра", ДиспетчерПоказанияОдометраПоказания);
			КонецЕсли;
			Если ДиспетчерПоказанияОдометраДатаИВремяВсегдаТекущее Тогда
				ДополнительныеПараметры.Вставить("ДатВрОдометр", ТекущаяДатаСеансаНаСервере());
			ИначеЕсли ЗначениеЗаполнено(ДиспетчерПоказанияОдометраДатаИВремя) Тогда
				ДополнительныеПараметры.Вставить("ДатВрОдометр", ДиспетчерПоказанияОдометраДатаИВремя);
			КонецЕсли;
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6") Тогда
			
			// если в Т2 Т3 Т6 выделено несколько строк то мы сейчас не пересчитываем значения для каждой строки и берем те что указаны справа
			// даже если выбрано ДанныеЗаполненияВручнуюПоказанияОдометра = ложь
			
			ДополнительныеПараметры.Вставить("Водитель", ТекущиеДанные.Водитель);
			
			Если ЗначениеЗаполнено(МедРаботник) Тогда
				ДополнительныеПараметры.Вставить("МедРаботник", МедРаботник);
			КонецЕсли;
			Если ЗначениеЗаполнено(МедЛицензия) Тогда
				ДополнительныеПараметры.Вставить("МедЛицензия", МедЛицензия);
			КонецЕсли;
			Если ЗначениеЗаполнено(МедДолжность) Тогда
				ДополнительныеПараметры.Вставить("Должность", МедДолжность);
			КонецЕсли;
			Если МедВремяВсегдаТекущее Тогда
				ДополнительныеПараметры.Вставить("ДатВрПрМО", ТекущаяДатаСеансаНаСервере());
			ИначеЕсли ЗначениеЗаполнено(МедДатВрПрМО) Тогда
				ДополнительныеПараметры.Вставить("ДатВрПрМО", МедДатВрПрМО);
			КонецЕсли;
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3") Тогда
			
			// если в Т2 Т3 Т6 выделено несколько строк то мы сейчас не пересчитываем значения для каждой строки и берем те что указаны справа
			// даже если выбрано ДанныеЗаполненияВручнуюПоказанияОдометра = ложь
			
			Если ЗначениеЗаполнено(ТехКонтрольРаботник) Тогда
				ДополнительныеПараметры.Вставить("ТехРаботник", ТехКонтрольРаботник);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТехКонтрольДолжность) Тогда
				ДополнительныеПараметры.Вставить("Должность", ТехКонтрольДолжность);
			КонецЕсли;
			Если ТехКонтрольДатВрКонтВсегдаТекущее Тогда
				ДополнительныеПараметры.Вставить("ДатВрКонтТехСост", ТекущаяДатаСеансаНаСервере());
			ИначеЕсли ЗначениеЗаполнено(ТехКонтрольДатВрКонтТехСост) Тогда
				ДополнительныеПараметры.Вставить("ДатВрКонтТехСост", ТехКонтрольДатВрКонтТехСост);
			КонецЕсли;
			Если ТехКонтрольДатВрВыпВсегдаТекущее Тогда
				ДополнительныеПараметры.Вставить("ДатВрВыпНаЛин", ТекущаяДатаСеансаНаСервере());
			ИначеЕсли ЗначениеЗаполнено(ТехКонтрольДатВрВыпНаЛин) Тогда
				ДополнительныеПараметры.Вставить("ДатВрВыпНаЛин", ТехКонтрольДатВрВыпНаЛин);
			КонецЕсли;
			
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4")
			Или ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5") Тогда
			
			// если в Т4 Т5 выделено несколько строк то мы точно должны пересчитывать значения для каждой строки
			
			Если Не ДанныеЗаполненияВручнуюПоказанияОдометра
				И ТекущийСписокЗадач.ВыделенныеСтроки.Количество() > 1 Тогда // требуется пересчитывать значения заполнения для каждой строки если выделено несколько
				ЗаполнитьТекПоказанияОдометраРеквизитыЧерезНастройкуКонвертации(ТекущиеДанные);
			КонецЕсли;
			
			Если ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5") Тогда
				ДополнительныеПараметры.Вставить("ЭтоСменаВодителя", ПоказанияОдометраЭтоСменаВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПоказанияОдометраРаботник) Тогда
				ДополнительныеПараметры.Вставить("ОдометрРаботник", ПоказанияОдометраРаботник);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПоказанияОдометраДолжнось) Тогда
				ДополнительныеПараметры.Вставить("Должность", ПоказанияОдометраДолжнось);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПоказанияОдометраПоказания) Тогда
				ДополнительныеПараметры.Вставить("ПоказанияОдометра", ПоказанияОдометраПоказания);
			КонецЕсли;
			Если ПоказанияОдометраДатаИВремяВсегдаТекущее Тогда
				ДополнительныеПараметры.Вставить("ДатВрОдометр", ТекущаяДатаСеансаНаСервере());
			ИначеЕсли ЗначениеЗаполнено(ПоказанияОдометраДатаИВремя) Тогда
				ДополнительныеПараметры.Вставить("ДатВрОдометр", ПоказанияОдометраДатаИВремя);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеОтправки = Новый Структура;
		ДанныеОтправки.Вставить("ПредыдущийТитул", ТекущиеДанные.ПредыдущийТитул);
		ДанныеОтправки.Вставить("ДополнительныеПараметры", КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры));
		
		Если ЭтоСменаВодителя Тогда
			ДанныеОтправки.Вставить("ПредыдущийТитул", ПредыдущийТитул);
		ИначеЕсли ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1") Тогда
			ДанныеОтправки.Вставить("Документ1С", ТекущиеДанные.Документ1С);
			ДанныеОтправки.Вставить("ДокументЛогистика", ТекущиеДанные.ДокументЛогистика);
		КонецЕсли;
		
		ДокументыКОбработке.Добавить(ДанныеОтправки);
	КонецЦикла;
	
	Возврат ДокументыКОбработке;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьТекстЗапроса(Команда)
	
	ПараметрыФормы = ДанныеЗапроса();
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ФормаТекстаЗапроса", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТумблерСменаВодителя(Команда)
	
	Элементы.ГруппаТумблерСменаВодителя.Видимость = Ложь;
	Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = Истина;
	
	ЗадачиДиспетчерПриАктивизацииСтроки(Элементы.ЗадачиДиспетчер);
	
КонецПроцедуры

&НаКлиенте
Процедура ТумблерСменаВодителяЗакрыть(Команда)
	
	Элементы.ГруппаТумблерСменаВодителя.Видимость = Истина;
	Элементы.ГруппаДиспетчерВПутиЗаполнение.Видимость = Ложь;
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьОбъектовЗаполнения()
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		
		Элементы.ДиспетчерПоказанияОдометраДатаИВремя.Видимость = Не ДиспетчерПоказанияОдометраДатаИВремяВсегдаТекущее;
		Элементы.ДиспетчерПоказанияОдометраДатаИВремяСейчас.Видимость = Не ДиспетчерПоказанияОдометраДатаИВремяВсегдаТекущее;
		
		Элементы.ГруппаДиспетчерСменаВодитель2.Видимость = (ЗначениеЗаполнено(ДиспетчерВодитель2));
		Элементы.КартинкаВодительПлюс1.Видимость = Не Элементы.ГруппаДиспетчерСменаВодитель2.Видимость;
		
	ИначеЕсли СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		
		Элементы.МедДатаИВремяПроведения.Видимость = Не МедВремяВсегдаТекущее;
		Элементы.ДекорацияДанныеЗаполненияВручнуюМедосмотр.Видимость = Ложь;
		
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		
		Элементы.ТехКонтрольДатВрКонтТехСост.Видимость = Не ТехКонтрольДатВрКонтВсегдаТекущее;
		Элементы.ТехКонтрольДатВрКонтТехСостСейчас.Видимость = Не ТехКонтрольДатВрКонтВсегдаТекущее;
		
		Элементы.ТехКонтрольДатВрВыпНаЛин.Видимость = Не ТехКонтрольДатВрВыпВсегдаТекущее;
		Элементы.ТехКонтрольДатВрВыпНаЛинСейчас.Видимость = Не ТехКонтрольДатВрВыпВсегдаТекущее;
		
		Элементы.ДекорацияДанныеЗаполненияВручнуюТехКонтроль.Видимость = Ложь;
		
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		Элементы.ПоказанияОдометраДатаИВремя.Видимость = Не ПоказанияОдометраДатаИВремяВсегдаТекущее;
		Элементы.ПоказанияОдометраДатаИВремяСейчас.Видимость = Не ПоказанияОдометраДатаИВремяВсегдаТекущее;
		
		Элементы.ДекорацияДанныеЗаполненияВручнуюПоказанияОдометра.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиЗадач()
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		Элементы.ЗадачиДиспетчер.Обновить();
		Элементы.ЗадачиДиспетчер.ВыделенныеСтроки.Очистить();
	ИначеЕсли СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		Элементы.ЗадачиМедосмотр.Обновить();
		Элементы.ЗадачиМедосмотр.ВыделенныеСтроки.Очистить();
		Элементы.СписокМедосмотр.Обновить();
		ЗадачиМедосмотрПриАктивизацииСтроки(Неопределено);
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		Элементы.ЗадачиТехКонтроль.Обновить();
		Элементы.ЗадачиТехКонтроль.ВыделенныеСтроки.Очистить();
		ЗадачиТехКонтрольПриАктивизацииСтроки(Неопределено);
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		Элементы.ЗадачиПоказанияОдометра.Обновить();
		Элементы.ЗадачиПоказанияОдометра.ВыделенныеСтроки.Очистить();
		Элементы.СписокПоказанияОдометра.Обновить();
		ЗадачиПоказанияОдометраПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтранициЗадачНаКлиенте()
	
	Элементы.ГруппаЗадач.ТекущаяСтраница = Элементы["Группа" + ТекущиВидАРМ];
	
	ШрифтСтандарт = Новый Шрифт();
	Элементы.ФормаДиспетчер.Шрифт = ШрифтСтандарт;
	Элементы.ФормаМедосмотр.Шрифт = ШрифтСтандарт;
	Элементы.ФормаТехКонтроль.Шрифт = ШрифтСтандарт;
	Элементы.ФормаПоказанияОдометра.Шрифт = ШрифтСтандарт;
	
	АвтоЦветФона = Новый Цвет();
	Элементы.ФормаДиспетчер.ЦветФона = АвтоЦветФона;
	Элементы.ФормаМедосмотр.ЦветФона = АвтоЦветФона;
	Элементы.ФормаТехКонтроль.ЦветФона = АвтоЦветФона;
	Элементы.ФормаПоказанияОдометра.ЦветФона = АвтоЦветФона;
	
	Элементы.ФормаДиспетчер.Доступность = Истина;
	Элементы.ФормаМедосмотр.Доступность = Истина;
	Элементы.ФормаТехКонтроль.Доступность = Истина;
	Элементы.ФормаПоказанияОдометра.Доступность = Истина;
	
	Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоИнтерфейс82()
		Или КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЭтоРежимСовместимости_8_2() Тогда
		
		Элементы["Форма" + ТекущиВидАРМ].Доступность = Ложь;
	Иначе
		Элементы["Форма" + ТекущиВидАРМ].Шрифт = Новый Шрифт(,, Истина);
		Элементы["Форма" + ТекущиВидАРМ].ЦветФона = WebЦвета.Золотой;
	КонецЕсли;
	
	Элементы["Задачи" + ТекущиВидАРМ + "ПодписатьТитул"].КнопкаПоУмолчанию = Истина;
	Если ТекущиВидАРМ = "Диспетчер" И ОтборДиспетчер = "ВПути" Тогда
		Элементы.ЗадачиДиспетчерСменаВодителя.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Заголовок = "Путевой лист (ф. 5.01): рабочее место";
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		
		Заголовок = Заголовок + " диспетчера";
		
		Если ОтборДиспетчер = "" Тогда
			ОтборДиспетчер = "НеПодписанные";
		КонецЕсли;
		
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1");
		
		ОтборДиспетчерПриИзменении(Неопределено);
		
	ИначеЕсли СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		
		Заголовок = Заголовок + " медика";
		
		Если ОтборМедосмотр = "" Тогда
			ОтборМедосмотр = "Предсменный";
		КонецЕсли;
		
		Если ОтборМедосмотр = "Предсменный" Или ОтборМедосмотр = "Послесменный" Тогда
			Элементы.ГруппаМедосмотрСписки.ТекущаяСтраница = Элементы.ГруппаМедосмотрЗадачи;
		Иначе
			Элементы.ГруппаМедосмотрСписки.ТекущаяСтраница = Элементы.ГруппаМедосмотрСписок;
		КонецЕсли;
		
		ОтборМедосмотрПриИзменении(Неопределено);
		
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		
		Заголовок = Заголовок + " тех. контролера";
		
		Если ОтборТехКонтроль = "" Тогда
			ОтборТехКонтроль = "НеПодписанные";
		КонецЕсли;
		
		ТипЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3");
		
		ОтборТехКонтрольПриИзменении(Неопределено);
		
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		Заголовок = Заголовок + " показания одометра";
		
		Если ОтборПоказанияОдометра = "" Тогда
			ОтборПоказанияОдометра = "Выезд";
		КонецЕсли;
		
		Если ОтборМедосмотр = "Выезд" Или ОтборМедосмотр = "Заезд" Тогда
			Элементы.ГруппаПоказанияОдометраСписки.ТекущаяСтраница = Элементы.ГруппаПоказанияОдометраЗадачи;
		Иначе
			Элементы.ГруппаПоказанияОдометраСписки.ТекущаяСтраница = Элементы.ГруппаПоказанияОдометраСписок;
		КонецЕсли;
		
		ОтборПоказанияОдометраПриИзменении(Неопределено);
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьОбъектовЗаполнения();
	
	ПереместитьПанельТоплива();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаСеансаНаСервере()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервереБезКонтекста
Функция ТребуемыхДействийАктивные()
	
	МассивТД = Новый Массив;
	
	// мои
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Оформить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Переотправить"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ЗапроситьОбъяснение"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ИсправитьОшибки"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ОбрабатываетсяСервером"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Отправляется"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПровестиДокумент"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПродолжитьОформление"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.Распечатать"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ПроверитьОтветДругогоУчастника"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВвестиНаОсновании"));

	// требующие обработки сервером
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВыполнитьОбмен"));
	МассивТД.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТребуемыеДействия.ВОчередиОтправки"));
	
	Возврат МассивТД;
	
КонецФункции

&НаСервере
Процедура ПодготовитьСписки()
	
	ТекстИндексаКартинкиСтатусаПодписанияТ1 = ТекстИндексаКартинкиСтатусаПодписанияТ1();
	ТекстИндексаКартинкиСтатусаПодписанияТ23456 = ТекстИндексаКартинкиСтатусаПодписанияТ23456();
	
	// Диспетчер
	РезультатаФормированияЗапроса = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, "Все типы");
	
	Если РезультатаФормированияЗапроса.ПолныйТекстЗапроса <> "" Тогда
		ЕстьНастройкиКонвертацииТ1 = Истина;
		
		ЗадачиДиспетчер.ТекстЗапроса = РезультатаФормированияЗапроса.ПолныйТекстЗапроса;
		УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1, Неопределено);
		Для Каждого ПараметрЗапроса Из РезультатаФормированияЗапроса.СтруктураПараметровЗапроса Цикл
			ЗадачиДиспетчер.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
		КонецЦикла;
		
		// Добавим поля "ИндексКартинкиСтатусаПодписания" и "Водитель2"
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ЗадачиДиспетчер.ТекстЗапроса);
		
		Если Найти(ЗадачиДиспетчер.ТекстЗапроса, "КАК ОбъединеннаяТаблица") = 0 Тогда
			
			// Один тип учетного документа
			ЭтоПерваяСтрока = Истина;
			Для Каждого ОператорЗапроса Из СхемаЗапроса.ПакетЗапросов[0].Операторы Цикл
				ПолеИндексаКартинки = ОператорЗапроса.ВыбираемыеПоля.Добавить(ТекстИндексаКартинкиСтатусаПодписанияТ1);
				ПолеВодитель2 = ОператорЗапроса.ВыбираемыеПоля.Добавить("КонтурЛогистика_ПЛ_Титул1.Ссылка.Водитель2");
				
				Если ЭтоПерваяСтрока Тогда
					ИндексПоляИндексаКартинки = ОператорЗапроса.ВыбираемыеПоля.Индекс(ПолеИндексаКартинки);
					СхемаЗапроса.ПакетЗапросов[0].Колонки[ИндексПоляИндексаКартинки].Псевдоним = "ИндексКартинкиСтатусаПодписания";
					
					ИндексПоляВодитель2 = ОператорЗапроса.ВыбираемыеПоля.Индекс(ПолеВодитель2);
					СхемаЗапроса.ПакетЗапросов[0].Колонки[ИндексПоляВодитель2].Псевдоним = "Водитель2";
					
					ЭтоПерваяСтрока = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			// Изменим вычисление поля "Водитель"
			ВыражениеВычисленияВодителя = Строка(СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти("Водитель").Поля[0]);
			ПолеВодителя = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Найти(ВыражениеВычисленияВодителя);
			ИндексПоляВодитель = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Индекс(ПолеВодителя);
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Установить(ИндексПоляВодитель, Новый ВыражениеСхемыЗапроса("ВЫБОР
				|	КОГДА КонтурЛогистика_ПЛ_Титул1.Ссылка ЕСТЬ NULL
				|		ТОГДА втДокументы.Водитель
				|	ИНАЧЕ КонтурЛогистика_ПЛ_Титул1.Ссылка.Водитель
				|КОНЕЦ"));
			
		Иначе
			
			// Несколько типов учетного документа
			ЭтоПерваяСтрока = Истина;
			Для Каждого ОператорЗапроса Из СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос.Операторы Цикл
				ТекущиеКолонкиЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Запрос.Колонки;
				
				ПолеИндексаКартинки = ОператорЗапроса.ВыбираемыеПоля.Добавить(ТекстИндексаКартинкиСтатусаПодписанияТ1);
				ПолеВодитель2 = ОператорЗапроса.ВыбираемыеПоля.Добавить("КонтурЛогистика_ПЛ_Титул1.Ссылка.Водитель2");
				
				Если ЭтоПерваяСтрока Тогда
					ИндексПоляИндексаКартинки = ОператорЗапроса.ВыбираемыеПоля.Индекс(ПолеИндексаКартинки);
					ТекущиеКолонкиЗапроса[ИндексПоляИндексаКартинки].Псевдоним = "ИндексКартинкиСтатусаПодписания";
					
					ИндексПоляВодитель2 = ОператорЗапроса.ВыбираемыеПоля.Индекс(ПолеВодитель2);
					ТекущиеКолонкиЗапроса[ИндексПоляВодитель2].Псевдоним = "Водитель2";
					
					// Изменим вычисление поля "Водитель"
					ВыражениеВычисленияВодителя = Строка(ТекущиеКолонкиЗапроса.Найти("Водитель").Поля[0]);
					ПолеВодителя = ОператорЗапроса.ВыбираемыеПоля.Найти(ВыражениеВычисленияВодителя);
					ИндексПоляВодитель = ОператорЗапроса.ВыбираемыеПоля.Индекс(ПолеВодителя);
					ОператорЗапроса.ВыбираемыеПоля.Установить(ИндексПоляВодитель, Новый ВыражениеСхемыЗапроса("ВЫБОР
						|	КОГДА КонтурЛогистика_ПЛ_Титул1.Ссылка ЕСТЬ NULL
						|		ТОГДА втДокументы.Водитель
						|	ИНАЧЕ КонтурЛогистика_ПЛ_Титул1.Ссылка.Водитель
						|КОНЕЦ"));
					
					ЭтоПерваяСтрока = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			// Добавим итоговые поля в объединенную талицу
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ОбъединеннаяТаблица.ИндексКартинкиСтатусаПодписания");
			СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Добавить("ОбъединеннаяТаблица.Водитель2");
			
		КонецЕсли;
		
		ЗадачиДиспетчер.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		
		ОтобразитьОтборДополнительныеКолонки("ЗадачиДиспетчер", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
		
	КонецЕсли;
	
	// Медосмотр
	Если СвойМедик Тогда
		ПолныйТекстЗапросаТ2 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2, Неопределено,,,, Ложь).ПолныйТекстЗапроса;
		ПолныйТекстЗапросаТ6 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6, Неопределено,,,, Ложь).ПолныйТекстЗапроса;
		ЗадачиМедосмотр.ТекстЗапроса = ПолныйТекстЗапросаТ2 + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + СтрЗаменить(ПолныйТекстЗапросаТ6, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ");
		ЗадачиМедосмотр.ТекстЗапроса = СтрЗаменить(ЗадачиМедосмотр.ТекстЗапроса, "КОНЕЦ КАК ТребуемоеДействие,",
			ТекстИндексаКартинкиСтатусаПодписанияТ23456);
		
		УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2, Неопределено);
		УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6, Неопределено);
		
		ДобавитьДополнительныеКолонкиВОбъединенныйЗапрос(ЗадачиМедосмотр,           
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2, 
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
		
		ОтобразитьОтборДополнительныеКолонки("ЗадачиМедосмотр", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2);
	КонецЕсли;
	
	// Тех контроль
	РезультатаФормированияЗапроса = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3, Неопределено);
	ЗадачиТехКонтроль.ТекстЗапроса = РезультатаФормированияЗапроса.ПолныйТекстЗапроса;
	УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3, Неопределено);
	Для Каждого ПараметрЗапроса Из РезультатаФормированияЗапроса.СтруктураПараметровЗапроса Цикл
		ЗадачиТехКонтроль.Параметры.УстановитьЗначениеПараметра(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	ЗадачиТехКонтроль.ТекстЗапроса = СтрЗаменить(ЗадачиТехКонтроль.ТекстЗапроса, "КОНЕЦ КАК ТребуемоеДействие,",
		ТекстИндексаКартинкиСтатусаПодписанияТ23456);
	
	ОтобразитьОтборДополнительныеКолонки("ЗадачиТехКонтроль", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3);
	
	// Показания одометра
	РезультатаФормированияЗапросаТ4 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4, Неопределено);
	РезультатаФормированияЗапросаТ5 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СформироватьТекстЗапросаСпискаЗадач(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5, Неопределено);
	ЗадачиПоказанияОдометра.ТекстЗапроса = РезультатаФормированияЗапросаТ4.ПолныйТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|" + СтрЗаменить(РезультатаФормированияЗапросаТ5.ПолныйТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ");
	
	ЗадачиПоказанияОдометра.ТекстЗапроса = СтрЗаменить(ЗадачиПоказанияОдометра.ТекстЗапроса, "КОНЕЦ КАК ТребуемоеДействие,",
		ТекстИндексаКартинкиСтатусаПодписанияТ23456);
	
	УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4, Неопределено);
	УстановитьПараметрыДинамическогоСписка(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5, Неопределено);
	
	ДобавитьДополнительныеКолонкиВОбъединенныйЗапрос(ЗадачиПоказанияОдометра,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4, 
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	
	ОтобразитьОтборДополнительныеКолонки("ЗадачиПоказанияОдометра", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4);
	
	// Статус документооборота в пути
	Если СписокМедосмотр.Параметры.Элементы.Найти("СтатусДокументооборотаВПути") <> Неопределено Тогда
		СписокМедосмотр.Параметры.УстановитьЗначениеПараметра(
			"СтатусДокументооборотаВПути", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостояниеПутевогоЛистаВПути());
	КонецЕсли;
	Если СписокПоказанияОдометра.Параметры.Элементы.Найти("СтатусДокументооборотаВПути") <> Неопределено Тогда
		СписокПоказанияОдометра.Параметры.УстановитьЗначениеПараметра(
			"СтатусДокументооборотаВПути", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостояниеПутевогоЛистаВПути());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЧерновик()
	
	Возврат 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиВыполнитьОбмен()
	
	Возврат 1;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиГотово()
	
	Возврат 2;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиОтказ()
	
	Возврат 3;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиОшибка()
	
	Возврат 4;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиQRКод()
	
	Возврат 5;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстИндексаКартинкиСтатусаПодписанияТ1()
	
	// 0 - Черновик
	// 1 - Выполнить обмен
	// 2 - Готово
	// 3 - Отказ
	// 4 - Ошибка
	// 5 - QR-код
	
	ТекстЗапрос =
		"ВЫБОР
		|	КОГДА КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние = &СтатусДокументооборотаВПути
		|		ТОГДА 5
		|	КОГДА КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние.Картинка = 3
		|		ТОГДА 3
		|	КОГДА КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус ЕСТЬ NULL
		|		ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
		|		ТОГДА 0
		|	КОГДА КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке)
		|		ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)
		|		ТОГДА 1
		|	КОГДА КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан)
		|		ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена)
		|		ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Получен)
		|		ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Пропущен)
		|		ТОГДА 2
		|	КОГДА КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка)
		|		ТОГДА 4
		|	ИНАЧЕ 3
		|КОНЕЦ";
	
	Возврат ТекстЗапрос;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстИндексаКартинкиСтатусаПодписанияТ23456()
	
	// 0 - Черновик
	// 1 - Выполнить обмен
	// 2 - Готово
	// 3 - Отказ
	// 4 - Ошибка
	// 5 - QR-код
	
	ТекстЗапроса = "КОНЕЦ КАК ТребуемоеДействие,
		|	ВЫБОР
		|		КОГДА КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние = &СтатусДокументооборотаВПути
		|			ТОГДА 5
		|		КОГДА КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус ЕСТЬ NULL
		|			ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
		|			ТОГДА 0
		|		КОГДА КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке)
		|			ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)
		|			ТОГДА 1
		|		КОГДА КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан)
		|			ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена)
		|			ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Получен)
		|			ИЛИ КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Пропущен)
		|			ТОГДА 2
		|		КОГДА КонтурЛогистика_СтатусыТекущихТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка)
		|			ТОГДА 4
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексКартинкиСтатусаПодписания,";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыДинамическогоСписка(ТипЛогистика, СпецСценарий = Неопределено)
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
		ТекущийСписокЗадач = ЗадачиДиспетчер;
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6 Тогда
		
		ТекущийСписокЗадач = ЗадачиМедосмотр;
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3 Тогда
		ТекущийСписокЗадач = ЗадачиТехКонтроль;
	ИначеЕсли ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4
		Или ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5 Тогда
		
		ТекущийСписокЗадач = ЗадачиПоказанияОдометра;
	КонецЕсли;
	
	Если ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 И Не ЕстьНастройкиКонвертацииТ1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийСписокЗадач.Параметры.Элементы.Найти("НачалоПериода") <> Неопределено Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("НачалоПериода", Период.ДатаНачала);
	КонецЕсли;
	
	// Введенные титулы могут по дате отличаться от предыдущих - расширим диапазон анализа текущего документа
	Если ТекущийСписокЗадач.Параметры.Элементы.Найти("НачалоПериодаПоследующийТитул") <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда 
			ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследующийТитул", Период.ДатаНачала);
		Иначе
			ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("НачалоПериодаПоследующийТитул", Период.ДатаНачала - 5 * 86400);
		КонецЕсли;
	КонецЕсли;
	
	// Определяем дополнительные параметры запроса в зависимости от типа титула и специального сценария
	ПараметрыСписка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПараметрыСпискаПоТипуЛогистики(
		ТипЛогистика, СпецСценарий);
	Для Каждого ТекущийПараметр Из ПараметрыСписка Цикл
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);
	КонецЦикла;
	
	// Введенные титулы могут по дате отличаться от предыдущих - расширим диапазон анализа текущего документа
	СекундВЧасе = 60 * 60;
	СмещениеОкончанияПериода = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СмещениеОкончанияПериодаСпискаЗадач") * СекундВЧасе;
	ОкончаниеПериода = Период.ДатаОкончания + СмещениеОкончанияПериода;
	ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериода", ОкончаниеПериода);
	Если ТекущийСписокЗадач.Параметры.Элементы.Найти("ОкончаниеПериодаПоследующийТитул") <> Неопределено Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("ОкончаниеПериодаПоследующийТитул", ОкончаниеПериода + 5 * 86400);
	КонецЕсли;
	
	Если ТекущийСписокЗадач.Параметры.Элементы.Найти("ТекущийПользователь") <> Неопределено Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	КонецЕсли;
	
	// Статус документооборота в пути
	Если ТекущийСписокЗадач.Параметры.Элементы.Найти("СтатусДокументооборотаВПути") <> Неопределено Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра(
			"СтатусДокументооборотаВПути", КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.СостояниеПутевогоЛистаВПути());
	КонецЕсли;
	
	// Параметр - Сценарий
	Если ЗначениеЗаполнено(ТекущийСписокЗадач.ТекстЗапроса) И Найти(ТекущийСписокЗадач.ТекстЗапроса, "&Сценарий") > 0 Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра(
			"Сценарий", Перечисления.КонтурЛогистика_Сценарии.Отправка);
	КонецЕсли;
	
	// Парамерт - НаправлениеКонвертации
	Если ЗначениеЗаполнено(ТекущийСписокЗадач.ТекстЗапроса) И Найти(ТекущийСписокЗадач.ТекстЗапроса, "&НаправлениеКонвертации") > 0 Тогда
		ТекущийСписокЗадач.Параметры.УстановитьЗначениеПараметра(
			"НаправлениеКонвертации", Перечисления.КонтурЛогистика_НаправлениеКонвертации.Входящее);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОформитьОтображениеДокументЛогистика(Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ДокументЛогистика)
			И Не ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ПредыдущийТитул) Тогда
			
			ПредставлениеДокументаЛогистика = "";
			ПредставлениеПредыдущегоТитула = "";
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаСписка.Значение.Данные.ДокументЛогистика) Тогда
			
			ПредставлениеДокументаЛогистика = "" // может быть ТрН или ЗН или СВ
				+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(СтрокаСписка.Значение.Данные.НомерТрН) 
				+ " от " 
				+ Формат(СтрокаСписка.Значение.Данные.ДатаТрН, "ДФ=dd.MM");
			ПредставлениеПредыдущегоТитула = "";
			
		Иначе
			ПредставлениеПредыдущегоТитула = ""  // может быть ТрН или ЗН или СВ
				+ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УдалитьЛидирующиеНули(СтрокаСписка.Значение.Данные.НомерТрН) 
				+ " от " 
				+ Формат(СтрокаСписка.Значение.Данные.ДатаТрН, "ДФ=dd.MM");
			ПредставлениеДокументаЛогистика = "";
		КонецЕсли;
		
		ОфДокЛогистика = СтрокаСписка.Значение.Оформление.Получить("ДокументЛогистика");
		Если ЗначениеЗаполнено(ОфДокЛогистика) Тогда 
			ОфДокЛогистика.УстановитьЗначениеПараметра("Текст", ПредставлениеДокументаЛогистика);
		КонецЕсли;
		
		ОфПредыдущийТитул = СтрокаСписка.Значение.Оформление.Получить("ПредыдущийТитул");
		Если ЗначениеЗаполнено(ОфПредыдущийТитул) Тогда 
			ОфПредыдущийТитул.УстановитьЗначениеПараметра("Текст", ПредставлениеПредыдущегоТитула);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЭлементыДанныхУчетногоДокумента()
	
	ПараметрыВодителя = Новый Структура("ВУНомер, ВУСерия, ВУДатаВыдачи");
	ПараметрыТранспортногоСредства = Новый Структура("РегНомер, ВместимостьКубМ, ГрузоподъемностьТонн");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.РеквизитСправочникаЛогистика КАК РеквизитСправочникаЛогистика,
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.ВыражениеВычисления КАК ВыражениеВычисления
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ПравилаКонвертации КАК КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|		ПО КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.Ссылка = КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = ""КонтурЛогистика_Сотрудники""
	|	И КонтурЛогистика_НастройкиКонвертацииСправочников.РеквизитТитула = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников.Водитель)
	|	И КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.СпособМаппинга = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС)
	|	И НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РеквизитСправочникаЛогистика = "ВУНомер" Тогда
			ПараметрыВодителя.ВУНомер = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
		Если Выборка.РеквизитСправочникаЛогистика = "ВУСерия" Тогда
			ПараметрыВодителя.ВУСерия = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
		Если Выборка.РеквизитСправочникаЛогистика = "ВУДатаВыдачи" Тогда
			ПараметрыВодителя.ВУДатаВыдачи = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.РеквизитСправочникаЛогистика КАК РеквизитСправочникаЛогистика,
	|	КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.ВыражениеВычисления КАК ВыражениеВычисления
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников.ПравилаКонвертации КАК КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_НастройкиКонвертацииСправочников КАК КонтурЛогистика_НастройкиКонвертацииСправочников
	|		ПО КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.Ссылка = КонтурЛогистика_НастройкиКонвертацииСправочников.Ссылка
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииСправочников.ТипСправочникаЛогистика = ""КонтурЛогистика_ТранспортныеСредства""
	|	И КонтурЛогистика_НастройкиКонвертацииСправочниковПравилаКонвертации.СпособМаппинга = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС)
	|	И НЕ КонтурЛогистика_НастройкиКонвертацииСправочников.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РеквизитСправочникаЛогистика = "РегНомер" Тогда
			ПараметрыТранспортногоСредства.РегНомер = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
		Если Выборка.РеквизитСправочникаЛогистика = "ВместимостьКубМ" Тогда
			ПараметрыТранспортногоСредства.ВместимостьКубМ = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
		Если Выборка.РеквизитСправочникаЛогистика = "ГрузоподъемностьТонн" Тогда
			ПараметрыТранспортногоСредства.ГрузоподъемностьТонн = Выборка.ВыражениеВычисления;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПараметрыВодителя.ВУНомер) И ЗначениеЗаполнено(ПараметрыВодителя.ВУСерия) Тогда
		
		// Водитель 1
		ГруппаВодитель = Элементы.ГруппаДанныеВодителя;
		
		ИмяЭлемента = "ДиспетчерДокументВодительВУСерия";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель." + ПараметрыВодителя.ВУСерия;
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "Водительское удостоверение");
		
		ИмяЭлемента = "ДиспетчерДокументВодительВУНомер";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель." + ПараметрыВодителя.ВУНомер;
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным);
		
		Если ЗначениеЗаполнено(ПараметрыВодителя.ВУДатаВыдачи) Тогда
			ИмяЭлемента = "ДиспетчерДокументВодительВУДатаВыдачи";
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель." + ПараметрыВодителя.ВУДатаВыдачи;
			НовыйЭлемент = ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "от");
		КонецЕсли;
		
		// Водитель 2
		ГруппаВодитель = Элементы.ГруппаДанныеВодителя2;
		
		ИмяЭлемента = "ДиспетчерДокументВодитель2ВУСерия";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2." + ПараметрыВодителя.ВУСерия;
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "Водительское удостоверение");
		
		ИмяЭлемента = "ДиспетчерДокументВодитель2ВУНомер";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2." + ПараметрыВодителя.ВУНомер;
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным);
		
		Если ЗначениеЗаполнено(ПараметрыВодителя.ВУДатаВыдачи) Тогда
			ИмяЭлемента = "ДиспетчерДокументВодитель2ВУДатаВыдачи";
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2." + ПараметрыВодителя.ВУДатаВыдачи;
			НовыйЭлемент = ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "от");
		КонецЕсли;
	Иначе
		
		// Водитель 1
		ГруппаВодитель = Элементы.ГруппаДанныеВодителя;
		
		ИмяЭлемента = "ДиспетчерДокументВодительВУСерия";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель.ВУСерия";
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "Водительское удостоверение");
		
		ИмяЭлемента = "ДиспетчерДокументВодительВУНомер";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель.ВУНомер";
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным);
		
		Если ЗначениеЗаполнено(ПараметрыВодителя.ВУДатаВыдачи) Тогда
			ИмяЭлемента = "ДиспетчерДокументВодительВУДатаВыдачи";
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель.ВУДатаВыдачи";
			НовыйЭлемент = ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "от");
		КонецЕсли;
		
		// Водитель 2
		ГруппаВодитель = Элементы.ГруппаДанныеВодителя2;
		
		ИмяЭлемента = "ДиспетчерДокументВодитель2ВУСерия";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2.ВУСерия";
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "Водительское удостоверение");
		
		ИмяЭлемента = "ДиспетчерДокументВодитель2ВУНомер";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2.ВУНомер";
		ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным);
		
		Если ЗначениеЗаполнено(ПараметрыВодителя.ВУДатаВыдачи) Тогда
			ИмяЭлемента = "ДиспетчерДокументВодитель2ВУДатаВыдачи";
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.Водитель2.ВУДатаВыдачи";
			НовыйЭлемент = ДобавитьЭлементОтображения(ГруппаВодитель, ИмяЭлемента, ПутьКДанным, "от");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыТранспортногоСредства.ГрузоподъемностьТонн)
		И ЗначениеЗаполнено(ПараметрыТранспортногоСредства.ВместимостьКубМ) Тогда
		
		ЕстьНастройкиКонвертацииТС = Истина;
		
		ИмяЭлемента = "ДиспетчерДокументТранспортноеСредствоГрузоподъемностьВТоннах";
		Если ЗначениеЗаполнено(ПараметрыТранспортногоСредства.ГрузоподъемностьТонн) Тогда
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.ТранспортноеСредство." + ПараметрыТранспортногоСредства.ГрузоподъемностьТонн;
		КонецЕсли;
		НовыйЭлемент = ДобавитьЭлементОтображения(Элементы.ГруппаТСГрузоподъемность, ИмяЭлемента, ПутьКДанным, "Грузоподъемность");
		Если НовыйЭлемент <> Неопределено Тогда
			Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаТСГрузоподъемность, Элементы.ДекорацияТонн);
		КонецЕсли;
		
		ИмяЭлемента = "ДиспетчерТранспортноеСредствоВместимостьВКубическихМетрах";
		ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.ТранспортноеСредство." + ПараметрыТранспортногоСредства.ВместимостьКубМ;
		НовыйЭлемент = ДобавитьЭлементОтображения(Элементы.ГруппаТСВместимость, ИмяЭлемента, ПутьКДанным, "Вместимость");
		Если НовыйЭлемент <> Неопределено Тогда
			Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаТСВместимость, Элементы.ДекорацияКубМ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыТранспортногоСредства.РегНомер) Тогда
			ИмяЭлемента = "ДиспетчерДокументТранспортноеСредствоРегНомер";
			ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.ТранспортноеСредство." + ПараметрыТранспортногоСредства.РегНомер;
			НовыйЭлемент = ДобавитьЭлементОтображения(Элементы.ГруппаДиспетчерДокументТС, ИмяЭлемента, ПутьКДанным, "Гос. рег. номер");
			Если НовыйЭлемент <> Неопределено Тогда
				Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаДиспетчерДокументТС, Элементы.ГруппаТСГрузоподъемность);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЕстьНастройкиКонвертацииТС = Ложь;
	КонецЕсли;
	
	ИмяЭлемента = "ДиспетчерДокументТранспортноеСредствоГрузоподъемностьВТоннахКЛ";
	ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.ТранспортноеСредство.ГрузоподъемностьТонн";
	НовыйЭлемент = ДобавитьЭлементОтображения(Элементы.ГруппаТСГрузоподъемность, ИмяЭлемента, ПутьКДанным, "Грузоподъемность");
	Если НовыйЭлемент <> Неопределено Тогда
		Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаТСГрузоподъемность, Элементы.ДекорацияТонн);
	КонецЕсли;
	
	ИмяЭлемента = "ДиспетчерТранспортноеСредствоВместимостьВКубическихМетрахКЛ";
	ПутьКДанным = "Элементы.ЗадачиДиспетчер.ТекущиеДанные.ТранспортноеСредство.ВместимостьКубМ";
	НовыйЭлемент = ДобавитьЭлементОтображения(Элементы.ГруппаТСВместимость, ИмяЭлемента, ПутьКДанным, "Вместимость");
	Если НовыйЭлемент <> Неопределено Тогда
		Элементы.Переместить(НовыйЭлемент, Элементы.ГруппаТСВместимость, Элементы.ДекорацияКубМ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементОтображения(ГруппаРодитель, ИмяЭлемента, ПутьКДанным, Заголовок = "")
	
	НовыйЭлемент = Неопределено;
	
	Попытка
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаРодитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = ПутьКДанным;
		НовыйЭлемент.Шрифт = Новый Шрифт(,, Истина);
		НовыйЭлемент.ЦветРамки = ЦветаСтиля.ЦветФонаФормы;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = 8;
		
		Если ЗначениеЗаполнено(Заголовок) Тогда
			НовыйЭлемент.Заголовок = Заголовок;
		Иначе
			НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		КонецЕсли;
	Исключение
		// Не требуется  
	КонецПопытки;
	
	Возврат НовыйЭлемент;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьФоновоеЗаданиеВыполнитьОбмен() Экспорт
	
	ИнтервалОбработчикаОжидания = 2;
	
	ЗаданиеЕщеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(
		ИдентификаторФЗ_ВыполнитьОбмен, Элементы.ЛоадерВыполнитьОбмен);
	
	Если ЗаданиеЕщеВыполняется Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗаданиеВыполнитьОбмен", ИнтервалОбработчикаОжидания, Истина);
		
	Иначе
		
		// Проверим результат выполнения фонового задания
		Результат = ПолучитьИзВременногоХранилища(АдресРезультатаВыполнитьОбмен);
		Если Результат <> Неопределено И Не Результат.Успешно Тогда
			ТекстСообщения = "";
			Для Каждого ТекущееСообщение Из Результат.МассивОшибок Цикл
				ТекстСообщения = ТекстСообщения + ТекущееСообщение + Символы.ПС;
			КонецЦикла;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Заголовок", "Протокол выполнения обмена");
			ПараметрыФормы.Вставить("Текст", ТекстСообщения);
			
			КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("ОбщаяФорма.КонтурЛогистика_ФормаТекстовогоСообщения", ПараметрыФормы);
		КонецЕсли;
		
		ИдентификаторФЗ_ВыполнитьОбмен = "";
		
		Для Каждого ТекущаяКоманда Из ЭлементыКодмандОбмена() Цикл
			ТекущаяКоманда.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВыполнитьОбмен;
			ТекущаяКоманда.Заголовок = "Выполнить обмен";
			ТекущаяКоманда.ЦветТекста = Новый Цвет(77,77,77);
		КонецЦикла;
		
		ОбновитьСпискиЗадач();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ЭлементыКодмандОбмена()
	
	КомандыОбмена = Новый Массив;
	КомандыОбмена.Добавить(Элементы.ДиспетчерВыполнитьОбмен);
	КомандыОбмена.Добавить(Элементы.МедосмотрВыполнитьОбмен);
	КомандыОбмена.Добавить(Элементы.ТехКонтрольВыполнитьОбмен);
	КомандыОбмена.Добавить(Элементы.ПоказанияОдометраВыполнитьОбмен);
	
	Возврат КомандыОбмена;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьСоздатьПКДПутевыхЛистов(СвойМедик)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборТипов = Новый Массив;
	НаборТипов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3);
	НаборТипов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4);
	НаборТипов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	
	Если СвойМедик Тогда
		НаборТипов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2);
		НаборТипов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	КонецЕсли;
	
	Для Каждого ТекущийТипДокумента Из НаборТипов Цикл
		
		// Проверяем наличие настроек конвертации для путевых листов
		Настройка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(ТекущийТипДокумента);
		
		Если Настройка <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТекущийТипДокумента);
		
		Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СоздатьНастройкуПЛДляТитуловКромеТитула1(
			ТекущийТипДокумента, НомерТитула);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЧерезНастройкиКонвертации(ДанныеЗаполнения, ТипДокументаЛогистика, ПредыдущийТитул)
	
	НастройкаКонвертации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертации(ТипДокументаЛогистика);
	
	Если Не ЗначениеЗаполнено(НастройкаКонвертации) Тогда
		Возврат;
	КонецЕсли;
	
	НомерТитула = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.НомерТитула(ТипДокументаЛогистика);
	ИмяДокумента = "КонтурЛогистика_ПЛ_Титул" + Строка(НомерТитула);
	
	ДанныеЗаполненияТитула = Новый Структура;
	ДанныеЗаполненияТитула.Вставить("ПредыдущийТитул", ПредыдущийТитул);
	
	ДокументТитулОбъект = Документы[ИмяДокумента].СоздатьДокумент();
	ДокументТитулОбъект.Заполнить(ДанныеЗаполненияТитула);
	
	ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ДокументТитулОбъект);
	
	ДокументТитулОбъект = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДоступСозданиеРедактированиеЭлементов(ТипыПутевыхЛистов)
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ДоступыПользователя = КонтурЛогистика_ОбщегоНазначенияСервер.ДоступыПользователя(ТекущийПользователь);
	
	Если ДоступыПользователя.ПолныйДоступ Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДоступКТитулам = ДоступыПользователя.ДоступКТитулам;
	
	СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(ТипыПутевыхЛистов);
	
	Возврат СозданиеРедактированиеЭлементов;
	
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоГруппамДоступа()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ДоступыПользователя = КонтурЛогистика_ОбщегоНазначенияСервер.ДоступыПользователя(ТекущийПользователь);
	
	Если ДоступыПользователя.ПолныйДоступ Тогда
		Возврат;
	КонецЕсли;
	
	ДоступКТитулам = ДоступыПользователя.ДоступКТитулам;
	
	ТипыПутевыхЛистов = Новый Массив;
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2);
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3);
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4);
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	ТипыПутевыхЛистов.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	
	Для Каждого ТекущийТип Из ТипыПутевыхЛистов Цикл
		
		ТолькоПросмотрЭлементов = ДоступКТитулам.ТолькоПросмотр.Получить(ТекущийТип);
		СозданиеРедактированиеЭлементов = ДоступКТитулам.СозданиеРедактирование.Получить(ТекущийТип);
		
		ИмяТипа = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТекущийТип);
		
		ИмяМетода = "ОбновитьВидимостьДоступностьПо" + ИмяТипа + "(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)";
		
		Выполнить(ИмяМетода);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул1(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Элементы.ФормаДиспетчер.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
	
	Элементы.ЗадачиДиспетчерПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДиспетчерСменаВодителя.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДиспетчерОформитьТитул.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДиспетчерСоздатьТитул1.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиДиспетчерСоздатьТитул1Копированием.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул2(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Элементы.ФормаМедосмотр.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
	
	Элементы.ЗадачиМедосмотрПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиМедосмотрОтказатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	
	Элементы.ГруппаМедосмотрЗаполнение.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул3(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Элементы.ФормаТехКонтроль.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
	
	Элементы.ЗадачиТехКонтрольПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиТехКонтрольОтказатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	
	Элементы.ГруппаТехКонтрольЗаполнение.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул4(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Элементы.ФормаПоказанияОдометра.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
	
	Элементы.ЗадачиПоказанияОдометраПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	
	Элементы.ГруппаПоказанияОдометраЗаполнение.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул5(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Если Элементы.ФормаПоказанияОдометра.Видимость Тогда
		Если СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов Тогда
			// Есть доступ на Т4 и Т5
		Иначе
			// Есть доступ на Т4
			Элементы.ФормаПоказанияОдометра.Заголовок = "Показания одометра (Т4)";
			
			ЭлементУдаления = Элементы.ОтборПоказанияОдометра.СписокВыбора.НайтиПоЗначению("Заезд");
			Элементы.ОтборПоказанияОдометра.СписокВыбора.Удалить(ЭлементУдаления);
		КонецЕсли;
	Иначе
		// Есть доступ на Т5
		Элементы.ФормаПоказанияОдометра.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
		Элементы.ФормаПоказанияОдометра.Заголовок = "Показания одометра (Т5)";
		
		ЭлементУдаления = Элементы.ОтборПоказанияОдометра.СписокВыбора.НайтиПоЗначению("Выезд");
		Элементы.ОтборПоказанияОдометра.СписокВыбора.Удалить(ЭлементУдаления);
	КонецЕсли;
	
	Элементы.ЗадачиПоказанияОдометраПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	
	Элементы.ГруппаПоказанияОдометраЗаполнение.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьДоступностьПоПЛ_Титул6(ТолькоПросмотрЭлементов, СозданиеРедактированиеЭлементов)
	
	Если Элементы.ФормаМедосмотр.Видимость Тогда
		Если СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов Тогда
			// Есть доступ на Т2 и Т6
		Иначе
			// Есть доступ на Т2
			Элементы.ФормаМедосмотр.Заголовок = "Медосмотр (Т2)";
			
			ЭлементУдаления = Элементы.ОтборМедосмотр.СписокВыбора.НайтиПоЗначению("Послесменный");
			Элементы.ОтборМедосмотр.СписокВыбора.Удалить(ЭлементУдаления);
		КонецЕсли;
	Иначе
		// Есть доступ на Т6
		Элементы.ФормаМедосмотр.Видимость = СозданиеРедактированиеЭлементов Или ТолькоПросмотрЭлементов;
		Элементы.ФормаМедосмотр.Заголовок = "Медосмотр (Т6)";
		
		ЭлементУдаления = Элементы.ОтборМедосмотр.СписокВыбора.НайтиПоЗначению("Предсменный");
		Элементы.ОтборМедосмотр.СписокВыбора.Удалить(ЭлементУдаления);
	КонецЕсли;
	
	Элементы.ЗадачиМедосмотрПодписатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	Элементы.ЗадачиМедосмотрОтказатьТитул.Доступность = СозданиеРедактированиеЭлементов;
	
	Элементы.ГруппаМедосмотрЗаполнение.Доступность = СозданиеРедактированиеЭлементов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьУведомленияИзСервиса()
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("УчитыватьПоследнююДатуПолучения", Ложь);
	
	РезультатЗапуска = КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеЗадание(
		"КонтурЛогистика_ДлительныеОперацииСервер.ПолучитьУведомленияИзСервиса", ПараметрыМетода,, "Получение уведомлений из сервиса");
	
	Если РезультатЗапуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатЗапуска.Статус = "Выполнено" Тогда
		КонтурЛогистика_ОбновлениеКлиент.ПроверитьНаличиеУведомлений(ЭтаФорма);
	Иначе
		ИдентификаторФЗ_ПолучитьУведомления = РезультатЗапуска.ИдентификаторЗадания;
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПолучитьУведомления", 3, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание_ПолучитьУведомления() Экспорт
	
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.МенеджерФоновыхЗаданийДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаданиеВыполняется = КонтурЛогистика_ДлительныеОперацииКлиент.ОбработчикСлеженияЗаФЗ(ИдентификаторФЗ_ПолучитьУведомления);
	
	Если ЗаданиеВыполняется Тогда
		ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание_ПолучитьУведомления", 3, Истина);
	Иначе
		КонтурЛогистика_ОбновлениеКлиент.ПроверитьНаличиеУведомлений(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДанныеЗапроса()
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		
		ТекущийДинамическийСписок = ЗадачиДиспетчер;
		
	ИначеЕсли СвойМедик И ТекущиВидАРМ = "Медосмотр" Тогда
		
		Если ОтборМедосмотр = "" Или ОтборМедосмотр = "Предсменный" Или ОтборМедосмотр = "Послесменный" Тогда
			ТекущийДинамическийСписок = ЗадачиМедосмотр;
		Иначе
			ТекущийДинамическийСписок = СписокМедосмотр;
		КонецЕсли;		
		
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		
		ТекущийДинамическийСписок = ЗадачиТехКонтроль;
		
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		
		Заголовок = Заголовок + " показания одометра";
		
		Если ОтборПоказанияОдометра = "" Тогда
			ОтборПоказанияОдометра = "Выезд";
		КонецЕсли;
		
		Если ОтборПоказанияОдометра = "" Или ОтборМедосмотр = "Выезд" Или ОтборМедосмотр = "Заезд" Тогда
			ТекущийДинамическийСписок = ЗадачиПоказанияОдометра;
		Иначе
			ТекущийДинамическийСписок = СписокПоказанияОдометра;
		КонецЕсли;
				
	КонецЕсли;
	
	СписокПараметров = Новый СписокЗначений;
	Для каждого Параметр Из ТекущийДинамическийСписок.Параметры.Элементы Цикл
		
		Если Не Параметр.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		СписокПараметров.Добавить(Параметр.Значение, Строка(Параметр.Параметр));
		
	КонецЦикла;
	
	Отборы = Новый СписокЗначений;	
	ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, ТекущийДинамическийСписок.Отбор.Элементы);	
	Для каждого ПользовательскаяНастройка Из  ТекущийДинамическийСписок.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ПользовательскаяНастройка) = Тип("ОтборКомпоновкиДанных") Тогда
			ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, ПользовательскаяНастройка.Элементы);	
		КонецЕсли;
	КонецЦикла;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ТекстЗапроса", ТекущийДинамическийСписок.ТекстЗапроса);
	ДанныеЗапроса.Вставить("ПараметрыЗапроса", СписокПараметров);
	ДанныеЗапроса.Вставить("Отборы", Отборы);
	
	Возврат ДанныеЗапроса;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементыОтбораКомпоновкиДанных(Отборы, Элементы)
	
	Для каждого Отбор Из Элементы Цикл
		
		Если Не Отбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Отбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ДанныеОтбора = Новый Структура;
			ДанныеОтбора.Вставить("Имя", Строка(Отбор.ТипГруппы));
			ДанныеОтбора.Вставить("ЭтоГруппа", Истина);
			ДанныеОтбора.Вставить("Элементы", Новый СписокЗначений);
						
			Отборы.Добавить(ДанныеОтбора, Строка(Отбор.ТипГруппы));
			
			ДобавитьЭлементыОтбораКомпоновкиДанных(ДанныеОтбора.Элементы, Отбор.Элементы);
		Иначе
			ДанныеОтбора = Новый Структура;
			ДанныеОтбора.Вставить("Имя", Строка(Отбор.ЛевоеЗначение));
			ДанныеОтбора.Вставить("ВидСравнения", Отбор.ВидСравнения);
			ДанныеОтбора.Вставить("Значение", Отбор.ПравоеЗначение);
			ДанныеОтбора.Вставить("ЭтоГруппа", Ложь);
			
			Отборы.Добавить(ДанныеОтбора, Строка(Отбор.ЛевоеЗначение));	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

#Область ПодключенноеОборудование

&НаКлиенте
Процедура ОткрытьФормуПодключенноеОборудование(ПодключитьОборудованиеПриОткрытии = Истина)

	ПоддерживаемыеТипыПодключаемогоОборудования = "СчитывательМагнитныхКарт";
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УникальныйИдентификатор",           УникальныйИдентификатор);
	ПараметрыОткрытия.Вставить("ПодключитьОборудованиеПриОткрытии", ПодключитьОборудованиеПриОткрытии);
	ПараметрыОткрытия.Вставить("ПоддерживаемыеТипыПодключаемогоОборудования", ПоддерживаемыеТипыПодключаемогоОборудования);
	
	ОткрытьФорму("Документ.ЧекККМ.Форма.ПодключенноеОборудование", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодключенноеОборудованиеОбработчикОжидания()
	
	ОткрытьФормуПодключенноеОборудование(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеОтключитьОтбор(Команда)
	
	ОборудованиеОтборЗначениеОтбора = Неопределено;
	
	ПолеОтбора_Диспетчер = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Диспетчер");
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиДиспетчер, ПолеОтбора_Диспетчер,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	
	ПолеОтбора_Медосмотр = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Медосмотр");
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиМедосмотр, ПолеОтбора_Медосмотр,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокМедосмотр, ПолеОтбора_Медосмотр,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
		
	ПолеОтбора_ТехКонтроль = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_ТехКонтроль");
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиТехКонтроль, ПолеОтбора_ТехКонтроль,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	
	ПолеОтбора_Одометр = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Одометр");
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗадачиПоказанияОдометра, ПолеОтбора_Одометр,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокПоказанияОдометра, ПолеОтбора_Одометр,
		ОборудованиеОтборЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
		
	ОборудованиеУстановитьВидимостьВыключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеУстановитьВидимостьВыключения()

	Элементы.ГруппаДиспетчерОборудованиеОтбор.Видимость = ЗначениеЗаполнено(ОборудованиеОтборЗначениеОтбора) 
															И ЗначениеЗаполнено(ПолеОтбора_Диспетчер);
	Элементы.ГруппаМедосмотрОборудованиеОтбор.Видимость = ЗначениеЗаполнено(ОборудованиеОтборЗначениеОтбора) 
															И ЗначениеЗаполнено(ПолеОтбора_Медосмотр);
	Элементы.ГруппаТехКонтрольОборудованиеОтбор.Видимость = ЗначениеЗаполнено(ОборудованиеОтборЗначениеОтбора) 
															И ЗначениеЗаполнено(ПолеОтбора_ТехКонтроль);
	Элементы.ГруппаОдометрОборудованиеОтбор.Видимость = ЗначениеЗаполнено(ОборудованиеОтборЗначениеОтбора)
															И ЗначениеЗаполнено(ПолеОтбора_Одометр);

КонецПроцедуры

&НаСервере
Процедура РассчитатьЗначениеОтбора(Параметр)
	
	КодРасчетаЗначенияОтбора = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_РМ_КодРасчетаЗначенияОтбора");
	
	Если ЗначениеЗаполнено(КодРасчетаЗначенияОтбора) Тогда
		
		Параметры = Новый Структура;
		Параметры.Вставить("Параметр", Параметр);
		
		ОборудованиеОтборЗначениеОтбора = КонтурЛогистика_ОбщегоНазначенияСервер.ВычислитьЗначениеВБезопасномРежиме(
			КодРасчетаЗначенияОтбора, Параметры);
		
	Иначе
		
		ОборудованиеОтборЗначениеОтбора = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения_ПЛ_РМ_ИспользоватьОборудование(Параметр)
	
	РассчитатьЗначениеОтбора(Параметр);
	
	Если ЗначениеЗаполнено(ОборудованиеОтборЗначениеОтбора) Тогда
		
		Состояние(ОборудованиеОтборЗначениеОтбора,, "Применен отбор по значению", БиблиотекаКартинок.КонтурЛогистика_Отбор);
		
		// Диспетчер
		ПолеОтбора_Диспетчер = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Диспетчер");
		ТекущееИспользование = ЗначениеЗаполнено(ПолеОтбора_Диспетчер);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗадачиДиспетчер, ПолеОтбора_Диспетчер, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		
		// Медосмотр
		ПолеОтбора_Медосмотр = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Медосмотр");
		ТекущееИспользование = ЗначениеЗаполнено(ПолеОтбора_Медосмотр);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗадачиМедосмотр, ПолеОтбора_Медосмотр, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокМедосмотр, ПолеОтбора_Медосмотр, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		
		// ТехКонтроль
		ПолеОтбора_ТехКонтроль = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_ТехКонтроль");
		ТекущееИспользование = ЗначениеЗаполнено(ПолеОтбора_ТехКонтроль);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗадачиТехКонтроль, ПолеОтбора_ТехКонтроль, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		
		// Одометр
		ПолеОтбора_Одометр = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПЛ_РМ_ПолеОтбора_Одометр");
		ТекущееИспользование = ЗначениеЗаполнено(ПолеОтбора_Одометр);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЗадачиПоказанияОдометра, ПолеОтбора_Одометр, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СписокПоказанияОдометра, ПолеОтбора_Одометр, ОборудованиеОтборЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,, ТекущееИспользование);
		
	Иначе
		
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Не найдено значение для отбора. Не указано соответствие?");
		ОборудованиеОтключитьОтбор(Неопределено);
		
	КонецЕсли;
	
	ОборудованиеУстановитьВидимостьВыключения();
	
КонецПроцедуры

&НаКлиенте
Процедура МедРаботникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(МедРаботник) Тогда 
		
		МедЛицензия = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(МедРаботник, "МедЛицензия");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАвтообновлениеФормы(Команда)
	
	ПриИзмененииАвтообновленияФормы(Не АвтообновлениеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииАвтообновленияФормы(ПерАвтообновление)
	
	АвтообновлениеФормы = ПерАвтообновление;
	
	Если АвтообновлениеФормы = Ложь Тогда
		ЗаголовокКнопки = "Включить автообновление формы";
		ОтключитьОбработчикОжидания("ОбновитьСпискиЗадач");
	Иначе
		ПериодОбновления = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ПериодОбновленияФорм");	
		
		ЗаголовокКнопки = "Отключить автообновление формы";
		ПодключитьОбработчикОжидания("ОбновитьСпискиЗадач", ПериодОбновления, Ложь);
	КонецЕсли;
	
	Элементы.ЗадачиДиспетчерИзменитьАвтообновлениеФормы.Заголовок = ЗаголовокКнопки;
	Элементы.ЗадачиМедосмотрИзменитьАвтообновлениеФормы.Заголовок = ЗаголовокКнопки;
	Элементы.ЗадачиТехКонтрольИзменитьАвтообновлениеФормы.Заголовок = ЗаголовокКнопки;
	Элементы.ЗадачиПоказанияОдометраИзменитьАвтообновлениеФормы.Заголовок = ЗаголовокКнопки;
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеКолонки

&НаСервере
Функция ДобавитьДополнительныеКолонкиВОбъединенныйЗапрос(ДинСписок, ТипЛогистики1, ТипЛогистики2)
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ДинСписок.ТекстЗапроса);
	
	НастройкаКонвертации1 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(ТипЛогистики1);
	НастройкаКонвертации2 = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(ТипЛогистики2);
	
	ОператорЗапроса1 = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорЗапроса2 = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	Для инд = 1 По 99 Цикл
		
		ДополнительноеПоле =  СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти("Доп" + Строка(инд));
		Если ДополнительноеПоле <> Неопределено Тогда
			Индекс = СхемаЗапроса.ПакетЗапросов[0].Колонки.Индекс(ДополнительноеПоле);
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Удалить(Индекс);
		КонецЕсли;
		
	КонецЦикла;
			
	НомерСтроки = 1;
	Для каждого ДопКолонка Из НастройкаКонвертации1.ДополнительныеКолонки Цикл
		
		ИмяКолонки = "Доп" + Строка(НомерСтроки);
		
		ДополнительноеПоле =  СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(ИмяКолонки);
		Если ДополнительноеПоле = Неопределено Тогда
			
			НовоеПоле = ОператорЗапроса1.ВыбираемыеПоля.Добавить(ДопКолонка.ПутьКДанным);
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(НовоеПоле).Псевдоним = ИмяКолонки;
											
		Иначе
									
			ИндексДополнительногоПоля =  СхемаЗапроса.ПакетЗапросов[0].Колонки.Индекс(ДополнительноеПоле);			
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Удалить(ИндексДополнительногоПоля);
			
			НовоеПоле = ОператорЗапроса1.ВыбираемыеПоля.Добавить(ДопКолонка.ПутьКДанным);
			ИндексНовогоПоля = ОператорЗапроса1.ВыбираемыеПоля.Индекс(НовоеПоле);			
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(НовоеПоле).Псевдоним = ИмяКолонки;
			
		КонецЕсли;
						
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Для каждого ДопКолонка Из НастройкаКонвертации2.ДополнительныеКолонки Цикл
		
		ИмяКолонки = "Доп" + Строка(НомерСтроки);
		
		Если ОператорЗапроса1.ВыбираемыеПоля.Найти(ДопКолонка.ПутьКДанным) = Неопределено Тогда
			ПолеУжеЕсть = Ложь;
		Иначе
			ПолеУжеЕсть = Истина;
		КонецЕсли;
				
		Если ПолеУжеЕсть Тогда
			НовоеПоле = ОператорЗапроса1.ВыбираемыеПоля.Добавить("NULL");
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(НовоеПоле).Псевдоним = ИмяКолонки;
		Иначе
			НовоеПоле = ОператорЗапроса2.ВыбираемыеПоля.Добавить(ДопКолонка.ПутьКДанным);
			СхемаЗапроса.ПакетЗапросов[0].Колонки.Найти(НовоеПоле).Псевдоним = ИмяКолонки;
		КонецЕсли;
											
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ДинСписок.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

&НаСервере
Процедура ОтобразитьОтборДополнительныеКолонки(СписокЗадачИмя, ТипЛогистика)
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(ТипЛогистика);
	
	УдалитьДополнительныеКолонкиИОтборы(СписокЗадачИмя);
					
	Для каждого ДопКолонка Из НастройкаКонвертации.ДополнительныеКолонки Цикл
		
		ИмяКолонки = "Доп" + Формат(ДопКолонка.НомерСтроки, "ЧГ=0");
		
		Элемент = Элементы.Найти(СписокЗадачИмя + ИмяКолонки);
		Если Элемент = Неопределено Тогда
			Элемент = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздКолонкаТаблицыФормы(ЭтаФорма, СписокЗадачИмя + "Колонка" + ИмяКолонки, Элементы[СписокЗадачИмя], , ДопКолонка.Заголовок, СписокЗадачИмя + "." + ИмяКолонки);	
		КонецЕсли;		
				
	КонецЦикла;
					
	Для каждого ДопКолонка Из НастройкаКонвертации.ДополнительныеКолонки Цикл
		
		ИмяКолонки = "Доп" + Формат(ДопКолонка.НомерСтроки, "ЧГ=0");
		
		ИмяДопРеквизита = СписокЗадачИмя + "ОтборКолонка" + ИмяКолонки;
		
		Если Элементы.Найти(ИмяДопРеквизита) <> Неопределено Тогда
			Элементы[ИмяДопРеквизита].Видимость = ДопКолонка.Отбор;	
		ИначеЕсли Не ДопКолонка.Отбор Тогда
			Продолжить;
		КонецЕсли;
							
		Типы = Новый Массив;                                                                      
		стрТипы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ДопКолонка.Тип, ";");
		Для каждого стрТип Из стрТипы Цикл
			Типы.Добавить(Тип(стрТип));	
		КонецЦикла;
		ОписаниеТипов = Новый ОписаниеТипов(Типы);
		
		КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СоздатьРеквизит(ЭтаФорма, ИмяДопРеквизита, ОписаниеТипов);
												
		Если Элементы.Найти(ИмяДопРеквизита) = Неопределено Тогда
		
			СобытияЭФ = Новый Структура;  
			СобытияЭФ.Вставить("ПриИзменении", "УстановитьОтборДинСписка");
			
			СвойстваЭФ = Новый Структура;  
			СвойстваЭФ.Вставить("КнопкаОчистки", Истина);
			СвойстваЭФ.Вставить("РастягиватьПоГоризонтали", Истина);
			
			Если ДопКолонка.НомерСтроки % 3 = 1 Или ДопКолонка.НомерСтроки = 1 Тогда
				Родитель = ИмяГруппыОтбораДополнительныеКолонки(СписокЗадачИмя, 1);
			ИначеЕсли ДопКолонка.НомерСтроки % 3 = 2 Или ДопКолонка.НомерСтроки = 2 Тогда
				Родитель = ИмяГруппыОтбораДополнительныеКолонки(СписокЗадачИмя, 2);
			Иначе
				Родитель = ИмяГруппыОтбораДополнительныеКолонки(СписокЗадачИмя, 3);
			КонецЕсли;
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(ЭтаФорма, ИмяДопРеквизита, Родитель, ДопКолонка.Заголовок, 1, ИмяДопРеквизита, СвойстваЭФ, СобытияЭФ);
						
		Иначе
			
			Элементы[ИмяДопРеквизита].Заголовок = ДопКолонка.Заголовок;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительныеКолонкиИОтборы(СписокЗадачИмя)
	
	Для каждого Реквизит Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если Лев(Реквизит.Имя, СтрДлина(СписокЗадачИмя + "Отбор")) = СписокЗадачИмя + "Отбор" Тогда	
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.УдлРеквизитИЭлемент(ЭтаФорма, Реквизит.Имя);				
		КонецЕсли;
	КонецЦикла;	
	
	Для инд = 1 По 99 Цикл
		
		ИмяКолонки = "Доп" + Формат(инд, "ЧГ=0");
		
		Элемент = Элементы.Найти(СписокЗадачИмя + "Колонка" + ИмяКолонки);
		Если Элемент <> Неопределено Тогда
			Элементы.Удалить(Элемент);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка(Элемент)
	
	СтрДляПоиска = СтрЗаменить(Элемент.Имя, "ОтборКолонка", "");
	ПолеОтбора = Прав(СтрДляПоиска, СтрДлина(СтрДляПоиска) - Найти(СтрДляПоиска, "Доп") + 1);
	СписокЗадачИмя = Лев(СтрДляПоиска, Найти(СтрДляПоиска, "Доп") - 1);
	
	Для каждого Отбор Из ЭтаФорма[СписокЗадачИмя].Отбор.Элементы Цикл
			
		Если Строка(Отбор.ЛевоеЗначение) = ПолеОтбора Тогда
			ЭтаФорма[СписокЗадачИмя].Отбор.Элементы.Удалить(Отбор);
			Прервать;
		КонецЕсли;				
			
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЭтаФорма[Элемент.Имя]) Тогда
				
		ЭлементОтбора = ЭтаФорма[СписокЗадачИмя].Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
		ЭлементОтбора.ПравоеЗначение = ЭтаФорма[Элемент.Имя];
		
		Если ТипЗнч(ЭтаФорма[Элемент.Имя]) = Тип("Строка") Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
		Иначе
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		
		ЭлементОтбора.Использование = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяГруппыОтбораДополнительныеКолонки(СписокЗадачИмя, Инд)
	
	Если СписокЗадачИмя = "ЗадачиДиспетчер" Тогда
		ИмяГруппы = "ГруппаДиспетчерОтборыДополнительныеКолонки" + Строка(Инд);
	ИначеЕсли СписокЗадачИмя = "ЗадачиМедосмотр" Тогда
		ИмяГруппы = "ГруппаМедосмотрОтборыДополнительныеКолонки" + Строка(Инд);
	ИначеЕсли СписокЗадачИмя = "ЗадачиТехКонтроль" Тогда
		ИмяГруппы = "ГруппаТехКонтрольОтборыДополнительныеКолонки" + Строка(Инд);
	ИначеЕсли СписокЗадачИмя = "ЗадачиПоказанияОдометра" Тогда
		ИмяГруппы = "ГруппаПоказанияОдометраОтборыДополнительныеКолонки" + Строка(Инд);
	КонецЕсли;
	
	Возврат Элементы[ИмяГруппы];
	
КонецФункции

#КонецОбласти

#Область ПоказанияТоплива

&НаКлиенте
Процедура ЗаполнитьПоказанияТоплива(ТекущиеДанные)
	
	Если ТекущиВидАРМ = "Медосмотр" Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказанияТопливаНаВыезде = 0;
		ПоказанияТопливаНаЗаезде = 0;
		ПоказанияТопливаНаЗаправках.Очистить();
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("ПредыдущийТитул") И ЗначениеЗаполнено(ТекущиеДанные.ПредыдущийТитул) Тогда
		ТекущийДокумент = ТекущиеДанные.ПредыдущийТитул;
	ИначеЕсли ТекущиеДанные.Свойство("Титул1") И ЗначениеЗаполнено(ТекущиеДанные.Титул1) Тогда
		ТекущийДокумент = ТекущиеДанные.Титул1;
	ИначеЕсли ТекущиеДанные.Свойство("ДокументЛогистика") И ЗначениеЗаполнено(ТекущиеДанные.ДокументЛогистика) Тогда
		ТекущийДокумент = ТекущиеДанные.ДокументЛогистика;
	Иначе
		ТекущийДокумент = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийДокумент) Тогда
		
		ДанныеПоказанияТоплива = ДанныеПоказанияТопливаПоДокументу(ТекущийДокумент);
		
		ПоказанияТопливаНаВыезде = ДанныеПоказанияТоплива.НаВыезде;
		ПоказанияТопливаНаЗаезде = ДанныеПоказанияТоплива.НаЗаезде;
		ПоказанияТопливаНаЗаправках.ЗагрузитьЗначения(ДанныеПоказанияТоплива.Заправка);
		
	Иначе
		
		ПоказанияТопливаНаВыезде = 0;
		ПоказанияТопливаНаЗаезде = 0;
		ПоказанияТопливаНаЗаправках.Очистить();
		
	КонецЕсли;
	
	Элементы.ПоказанияТопливаНаВыезде.ТолькоПросмотр = Истина;
	Элементы.ПоказанияТопливаНаЗаезде.ТолькоПросмотр = Истина;
	Элементы.ПоказанияТопливаНаЗаправках.ТолькоПросмотр = Истина;
	
	Возврат;
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1") Тогда
		ТекущийСтатусаДО = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтатусДО(ТекущийДокумент);
	Иначе
		Титул1 = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ТекущийДокумент, "Титул1");
		ТекущийСтатусаДО = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьСтатусДО(Титул1);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийСтатусаДО) Тогда
		ТекущийКодСтатусаДО = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ТекущийСтатусаДО, "Код");
	Иначе
		ТекущийКодСтатусаДО = "";
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьПоказанийТоплива();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДоступностьПоказанийТоплива()
	
	Если ТекущийКодСтатусаДО = "pl-on-the-way" Тогда
		
		// В пути
		Элементы.ПоказанияТопливаНаВыезде.Доступность = Ложь;
		Элементы.ПоказанияТопливаНаЗаезде.Доступность = Истина;
		Элементы.ПоказанияТопливаНаЗаправках.Доступность = Истина;
		
	ИначеЕсли ТекущийКодСтатусаДО = "pl-completed"
		Или ТекущийКодСтатусаДО = "pl-changeover"
		Или ТекущийКодСтатусаДО = "pl-rejected-cheсkup"
		Или ТекущийКодСтатусаДО = "pl-rejected-techInspection" Тогда
		
		// Завершена
		Элементы.ПоказанияТопливаНаВыезде.Доступность = Ложь;
		Элементы.ПоказанияТопливаНаЗаезде.Доступность = Ложь;
		Элементы.ПоказанияТопливаНаЗаправках.Доступность = Ложь;
		
	Иначе
		
		// Не начата
		Элементы.ПоказанияТопливаНаВыезде.Доступность = Истина;
		Элементы.ПоказанияТопливаНаЗаезде.Доступность = Ложь;
		Элементы.ПоказанияТопливаНаЗаправках.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьПанельТоплива()
	
	Если ТекущиВидАРМ = "Диспетчер" Тогда
		НовыйРодитель = Элементы.ГруппаДиспетчерДокументИЗаполнение;
	ИначеЕсли ТекущиВидАРМ = "Медосмотр" Тогда
		Возврат;
	ИначеЕсли ТекущиВидАРМ = "ТехКонтроль" Тогда
		НовыйРодитель = Элементы.ГруппаТехКонтрольЗаполнение;
	ИначеЕсли ТекущиВидАРМ = "ПоказанияОдометра" Тогда
		НовыйРодитель = Элементы.ГруппаПоказанияОдометраЗаполнение;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ДекорацияГруппаПоказанияТопливаУдлинитель, НовыйРодитель);
	Элементы.Переместить(Элементы.ГруппаПоказанияТоплива, НовыйРодитель);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоказанияТопливаПоДокументу(ДокументЛогистика)
	
	ДанныеПоказанияТоплива = Новый Структура;
	ДанныеПоказанияТоплива.Вставить("НаЗаезде", 0);
	ДанныеПоказанияТоплива.Вставить("НаВыезде", 0);
	ДанныеПоказанияТоплива.Вставить("Заправка", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументЛогистика);
	Запрос.УстановитьПараметр("ТипДанных", РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.ЛицоОформившееПЛ КАК ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул1.kl_id КАК kl_id
	|ПОМЕСТИТЬ ДанныеТитула1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул2.Титул1.ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул2.Титул1.kl_id
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул2 КАК КонтурЛогистика_ПЛ_Титул2
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул2.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1.ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул3.Титул1.kl_id
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул4.Титул1.kl_id
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул5.Титул1.ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул5.Титул1.kl_id
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул5 КАК КонтурЛогистика_ПЛ_Титул5
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул5.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул6.Титул1.ЛицоОформившееПЛ,
	|	КонтурЛогистика_ПЛ_Титул6.Титул1.kl_id
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул6 КАК КонтурЛогистика_ПЛ_Титул6
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул6.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТитула1.ЛицоОформившееПЛ КАК ЛицоОформившееПЛ,
	|	ДанныеТитула1.kl_id КАК kl_id
	|ПОМЕСТИТЬ ДанныеТитула1Сгруппированные
	|ИЗ
	|	ДанныеТитула1 КАК ДанныеТитула1
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеТитула1.ЛицоОформившееПЛ,
	|	ДанныеТитула1.kl_id
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез2 КАК Разрез2,
	|	КонтурЛогистика_ПроизвольныеДанные.Количество КАК Количество
	|ИЗ
	|	ДанныеТитула1Сгруппированные КАК ДанныеТитула1Сгруппированные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|		ПО ДанныеТитула1Сгруппированные.ЛицоОформившееПЛ = КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок
	|			И ДанныеТитула1Сгруппированные.kl_id = КонтурЛогистика_ПроизвольныеДанные.Разрез1
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Разрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.НаВыезде Тогда
			ДанныеПоказанияТоплива.НаВыезде = Выборка.Количество;
		ИначеЕсли Выборка.Разрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.НаЗаезде Тогда
			ДанныеПоказанияТоплива.НаЗаезде = Выборка.Количество;
		ИначеЕсли Выборка.Разрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.Заправка Тогда
			ДанныеПоказанияТоплива.Заправка.Добавить(Выборка.Количество);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеПоказанияТоплива;
	
КонецФункции

#КонецОбласти

#КонецОбласти