// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ФункциональныеОпции.Добавить("НеИспользоватьУправлениеДоставкой20");
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СостояниеДоставки");
	НастройкиВарианта.Наименование = НСтр("ru = 'Состояние доставки'");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ запланированной доставки по документам.
											|По каким товарам и в каком количестве требуется доставка?
											|Для каких товаров необходимо планирование рейса?'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.Склад.Подсистемы.УправлениеДоставкой);
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СостояниеДоставкиПоТоварам");
	НастройкиВарианта.Наименование = НСтр("ru = 'Состояние доставки (по товарам)'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.Склад.Подсистемы.УправлениеДоставкой);
	
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, НастройкиОтчета, "СостояниеДоставкиКонтекст");
	
КонецПроцедуры

#КонецОбласти

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//   КлючВарианта - Строка - 
//   
//	Возвращаемое значение:
//		СтрокаТаблицыЗначений - описание созданной команды.
//
Функция ДобавитьКомандуОтчета(КомандыОтчетов, Параметры, КлючВарианта = "") Экспорт
	
	КомандаОтчет = Неопределено;
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.СостояниеДоставки) Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.СостояниеДоставки.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru = 'Состояние доставки'");
		КомандаОтчет.МножественныйВыбор = Ложь;
		КомандаОтчет.РежимЗаписи = "Проводить";
		КомандаОтчет.ФункциональныеОпции = "НеИспользоватьУправлениеДоставкой20";
		КомандаОтчет.Важность = "Обычное";
		
		Если ЗначениеЗаполнено(КлючВарианта) Тогда
			
			КомандаОтчет.КлючВарианта = КлючВарианта;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КомандаОтчет;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли