#Область СлужебныйПрограммныйИнтерфейс

#Область ПредставлениеПолейДереваМаркированнойПродукции

// Формирует признак допустимости и представление проверки данных МОТП для строки дерева, содержащего данные упаковки.
// 
// Параметры:
//  ТекущаяСтрока - ДанныеФормыЭлементДерева, СтрокаДереваЗначений - строка дерева, содержащая данные упаковки.
//  ПараметрыПроверкиКодовМаркировки - Структура - со свойствами:
//  * ЗапрашиватьДанныеСервиса - Булево - Признак включенной опции запроса данных сервиса
//  * КонтролироватьСтатусыКодовМаркировки - Булево - Признак необходимости временного отключения контроля статусов кодов маркировки
//  * ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП - Булево - Признак необходимости проверки вхождения кодов в серую зону МОТП
//  * ДопустимыеСтатусыКодовМаркировки - Массив Из ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП - допустимые статусы кода маркировки для текущей хоз.операции
//  * ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП - Дата - Дата производства, начиная с которой выполняется контроль статусов кода маркировки
//  * ИННВладельца - Строка - ИНН владельца кода маркировки по данным ИС МОТП
//  * КонтролироватьВложенностьУпаковок - Булево - Признак необходимости проверить допустимые типы вложений согласно ограничения СУЗ API.
//  * ДопустимыеВложенияАгрегатов - Соответствие Из ПеречислениеСсылка - найстройки для котроля вложенности упаковок.
//  РежимПодбораСуществующихУпаковок - Булево - режим подбора существующих упаковок
//  ЕстьПодчиненныеСтроки - Булево, Неопределено - явное указание наличия подчиненных строк
Процедура ПроверитьДопустимостьКодаМаркировки(ТекущаяСтрока, ПараметрыПроверкиКодовМаркировки, РежимПодбораСуществующихУпаковок = Истина, ЕстьПодчиненныеСтроки = Неопределено) Экспорт
	
	Если ТекущаяСтрока.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиПотребительскиеУпаковкиБезУпаковки()
	 Или ТекущаяСтрока.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиГрупповыеУпаковкиБезКоробки() Тогда
		
		ТекущаяСтрока.НедопустимыйКодМаркировки           = Ложь;
		ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = "";
		
	ИначеЕсли Не ПараметрыПроверкиКодовМаркировки.ЗапрашиватьДанныеСервиса
		Или ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
		
		ТекущаяСтрока.НедопустимыйКодМаркировки           = Ложь;
		ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = "";
		
	ИначеЕсли ПараметрыПроверкиКодовМаркировки.ОтсутствуетПодключениеИСМП Тогда
		
		ТекущаяСтрока.НедопустимыйКодМаркировки           = Ложь;
		ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = НСтр("ru = 'Статус неопределен'");
		
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.СтатусКодаМаркировки)
		Или ЗначениеЗаполнено(ТекущаяСтрока.ИННВладельца) Тогда
		
		ТекущаяСтрока.НедопустимыйКодМаркировки           = Ложь;
		ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = "";
		
		Если ПараметрыПроверкиКодовМаркировки.ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП Тогда
			ВыполнятьКонтрольСУчетомСеройЗоны = Не ТекущаяСтрока.ВСеройЗоне;
		Иначе
			ВыполнятьКонтрольСУчетомСеройЗоны = Истина;
		КонецЕсли;
		
		ДатаПроизводстваДопускаетКонтроль = Истина;
		
		// Приоритет 1. Статус
		Если ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая") Тогда
			ДопустимыеСтатусыКодовМаркировки = ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыУпаковокМОТП;
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор")
			И ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыКодовМаркировки = ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыНаборовМОТП;
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая")
			И ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыНаборовМОТП <> Неопределено Тогда
			ДопустимыеСтатусыКодовМаркировки = ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыНаборовМОТП;
		Иначе
			ДопустимыеСтатусыКодовМаркировки = ПараметрыПроверкиКодовМаркировки.ДопустимыеСтатусыМОТП;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаПроизводства)
			И ВыполнятьКонтрольСУчетомСеройЗоны Тогда
			ДатаПроизводстваДопускаетКонтроль = ТекущаяСтрока.ДатаПроизводства >= ПараметрыПроверкиКодовМаркировки.ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП;
		Иначе
			ДатаПроизводстваДопускаетКонтроль = Истина;
		КонецЕсли;
		
		ИсключенияПроверокРазрешительногоРежима = Ложь;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.РазрешительныйРежимДатаЗапросаГИСМТ)
			И Не ЗначениеЗаполнено(ТекущаяСтрока.РазрешительныйРежимИдентификаторЗапросаГИСМТ)
			Или ТекущаяСтрока.ПродажаПоДаннымОффлайнРежима Тогда
			
			// ответ от ГИС МТ не был получен, продажа разрешена без проверок
			ИсключенияПроверокРазрешительногоРежима = Истина;
			
		КонецЕсли;
		
		ОтсутствуетДопустимыйСтатус = ДопустимыеСтатусыКодовМаркировки.Найти(ТекущаяСтрока.СтатусКодаМаркировки) = Неопределено;
		
		Если ТекущаяСтрока.СтатусКодаМаркировки = ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Нанесен") И ЗначениеЗаполнено(ТекущаяСтрока.РазрешительныйРежимДатаЗапросаГИСМТ) Тогда
			Если ТекущаяСтрока.ИННПроизводителя = ПараметрыПроверкиКодовМаркировки.ИННВладельца Тогда
				ОтсутствуетДопустимыйСтатус = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.СтатусКодаМаркировки)
			И ПараметрыПроверкиКодовМаркировки.КонтролироватьСтатусыКодовМаркировки 
			И ОтсутствуетДопустимыйСтатус
			И Не ТекущаяСтрока.ЧастичноеВыбытие
			И ВыполнятьКонтрольСУчетомСеройЗоны
			И Не ИсключенияПроверокРазрешительногоРежима
			И ДатаПроизводстваДопускаетКонтроль
			И НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(
				ТекущаяСтрока.ВидПродукции, ПараметрыПроверкиКодовМаркировки.ВидОперацииИСМП) Тогда
			ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
			ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = СтрШаблон(НСтр("ru = 'Статус: %1'"), ТекущаяСтрока.СтатусКодаМаркировки);
		КонецЕсли;
		
		// Приоритет 2. Вложения. Пустая упаковка
		Если Не ТекущаяСтрока.НедопустимыйКодМаркировки
			И ПараметрыПроверкиКодовМаркировки.КонтролироватьСтандартнуюВложенность
			И ТекущаяСтрока.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская")
			И (ЕстьПодчиненныеСтроки = Ложь И ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок = 0) Тогда
				ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
				ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = НСтр("ru = 'Пустая упаковка'");
		КонецЕсли;
		
		// Приоритет 3. Вложенность стандартных упаковок
		Если Не ТекущаяСтрока.НедопустимыйКодМаркировки
			И ПараметрыПроверкиКодовМаркировки.КонтролироватьСтандартнуюВложенность
			И ТекущаяСтрока.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская")
			И ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок <> ТекущаяСтрока.ПлановоеКоличествоПотребительскихУпаковок И ТекущаяСтрока.ПлановоеКоличествоПотребительскихУпаковок > 0 Тогда
			ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
			ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = СтрШаблон(
				НСтр("ru = 'По данным ГИС МТ в упаковке %2 ед. из %1'"),
				ТекущаяСтрока.ПлановоеКоличествоПотребительскихУпаковок, ТекущаяСтрока.КоличествоПодчиненныхПотребительскихУпаковок);
		КонецЕсли;
		
		// Приоритет 4. Владелец
		Если Не ТекущаяСтрока.НедопустимыйКодМаркировки
			И ВыполнятьКонтрольСУчетомСеройЗоны
			И ДатаПроизводстваДопускаетКонтроль
			И Не ИсключенияПроверокРазрешительногоРежима
			И ТекущаяСтрока.СтатусКодаМаркировки <> ПредопределенноеЗначение("Перечисление.СтатусыКодовМаркировкиИСМП.Неопределен")
			И ЗначениеЗаполнено(ТекущаяСтрока.СтатусКодаМаркировки)
			И ПараметрыПроверкиКодовМаркировки.КонтролироватьВладельцевКодовМаркировки
			И НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.КонтролироватьВладельцевКодовМаркировки(
				ТекущаяСтрока.ВидПродукции, ПараметрыПроверкиКодовМаркировки.ВидОперацииИСМП) Тогда
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.ИННВладельца)
				И ТекущаяСтрока.ИННВладельца <> ПараметрыПроверкиКодовМаркировки.ИННВладельца Тогда
				
				Если ПараметрыПроверкиКодовМаркировки.ОрганизацииИнтеркампани[ТекущаяСтрока.ИННВладельца] = Неопределено Тогда
					
					ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
					ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки
						+ ?(ПустаяСтрока(ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки), "", ", ")
						+ СтрШаблон(НСтр("ru = 'ИНН владельца: %1'"), ТекущаяСтрока.ИННВладельца);
				
				КонецЕсли;
				
			ИначеЕсли Не ЗначениеЗаполнено(ТекущаяСтрока.ИННВладельца)
				И РежимПодбораСуществующихУпаковок Тогда
				
				ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
				ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки
					+ ?(ПустаяСтрока(ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки), "", ", ")
					+ НСтр("ru = 'Принадлежит другой организации'");
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Приоритет 5. Блокировка КМ по данным ГИС МТ
		Если ПараметрыПроверкиКодовМаркировки.КонтролироватьСтатусыКодовМаркировки
			И ЗначениеЗаполнено(ТекущаяСтрока.ОрганыБлокировкиКМ) Тогда
			ТекущаяСтрока.НедопустимыйКодМаркировки           = Истина;
			ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки
				+ ?(ПустаяСтрока(ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки), "", ", ")
				+ СтрШаблон(НСтр("ru = 'Заблокирован по решению %1'"), ТекущаяСтрока.ОрганыБлокировкиКМ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыПроверкиКодовМаркировки.КонтролироватьВложенностьУпаковок
		И ПараметрыПроверкиКодовМаркировки.ДопустимыеВложенияАгрегатов <> Неопределено Тогда
		
		ПроверитьДопустимуюВложенностьУпаковок(ТекущаяСтрока, ПараметрыПроверкиКодовМаркировки);
		
	КонецЕсли;
	
	Если ПараметрыПроверкиКодовМаркировки.КонтролироватьМинимальныеРозничныеЦены И ЗначениеЗаполнено(ТекущаяСтрока.МРЦ)
		И Не ТекущаяСтрока.НедопустимыйКодМаркировки Тогда
		Если ПараметрыПроверкиКодовМаркировки.МинимальнаяРозничнаяЦена > ТекущаяСтрока.МРЦ Тогда
			ТекущаяСтрока.НедопустимыйКодМаркировки = Истина;
			ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки + ?(
				ПустаяСтрока(ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки), "", ", ") + НСтр(
				"ru = 'МРЦ меньше минимальной розничной цены'");
		КонецЕсли;
	КонецЕсли;
		
	Если ТекущаяСтрока.ОбработанСОшибкойВГИСМТ Тогда
		
		ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки = ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки
			+ ?(ПустаяСтрока(ТекущаяСтрока.ПредставлениеПроверкиКодаМаркировки), "", ", ")
			+ ТекущаяСтрока.ТекстОбработанСОшибкойВГИСМТ;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДопустимуюВложенностьУпаковок(ТекущаяСтрока, ПараметрыПроверкиКодовМаркировки)
	
	Если ТипЗнч(ТекущаяСтрока) = Тип("ДанныеФормыЭлементДерева") Тогда
		РодительТекущейСтроки = ТекущаяСтрока.ПолучитьРодителя();
	Иначе
		РодительТекущейСтроки = ТекущаяСтрока.Родитель;
	КонецЕсли;
	
	Если РодительТекущейСтроки <> Неопределено И ТипЗнч(РодительТекущейСтроки.ТипУпаковки) = Тип("ПеречислениеСсылка.ТипыУпаковок") Тогда 
		
		ДопустимыеВложенияАгрегатов = ПараметрыПроверкиКодовМаркировки.ДопустимыеВложенияАгрегатов;
		
		ДопустимыеВложенияПоВидуУпаковки  = ДопустимыеВложенияАгрегатов.Получить(РодительТекущейСтроки.ВидУпаковки);
		ДопустимыеВложенияПоТипуШтрихкода = ДопустимыеВложенияАгрегатов.Получить(РодительТекущейСтроки.ТипШтрихкода);
		
		СтрокаОшибки = "";
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ВидУпаковки) Тогда
			
			СтрокаОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось определить вид упаковки (не заполнен коэффициент) для %1.'"),
				ТекущаяСтрока.Штрихкод);
			
		ИначеЕсли Не ЗначениеЗаполнено(РодительТекущейСтроки.ВидУпаковки) Тогда
			
			СтрокаОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось определить вид упаковки (не заполнен коэффициент) для %1.'"),
				РодительТекущейСтроки.Штрихкод);
			
		ИначеЕсли ДопустимыеВложенияПоВидуУпаковки <> Неопределено
			И ДопустимыеВложенияПоВидуУпаковки.Найти(ТекущаяСтрока.ВидУпаковки) = Неопределено
			И (РодительТекущейСтроки.ВидУпаковки <> ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
			   Или РодительТекущейСтроки.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
			       И ДопустимыеВложенияПоТипуШтрихкода <> Неопределено
			       И ДопустимыеВложенияПоТипуШтрихкода.Найти(ТекущаяСтрока.ВидУпаковки) = Неопределено) Тогда
			
			СтрокаОшибки = СтрШаблон(
				НСтр("ru = '%1 упаковка не может содержать %2'"),
				РодительТекущейСтроки.ВидУпаковки,
				ТекущаяСтрока.ВидУпаковки);
			
		ИначеЕсли ТекущаяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
			И ДопустимыеВложенияПоТипуШтрихкода <> Неопределено Тогда
			
			Если ДопустимыеВложенияПоТипуШтрихкода.Найти(ТекущаяСтрока.ТипШтрихкода) = Неопределено Тогда
				
				СтрокаОшибки = СтрШаблон(
					НСтр("ru = 'Упаковка %1 не может содержать %2'"),
					РодительТекущейСтроки.ТипШтрихкода,
					ТекущаяСтрока.ТипШтрихкода);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаОшибки) Тогда
			
			РодительТекущейСтроки.НедопустимыйКодМаркировки = Истина;
			РодительТекущейСтроки.ПредставлениеПроверкиКодаМаркировки = СтрокаОшибки;
			
		КонецЕсли;
		
		Если ПараметрыПроверкиКодовМаркировки.Свойство("КонтролироватьСоставГрупповойУпаковкиПриИзмененииСтрокиДерева")
			И ПараметрыПроверкиКодовМаркировки.КонтролироватьСоставГрупповойУпаковкиПриИзмененииСтрокиДерева Тогда
			
			ПроверкаИПодборПродукцииИСМПКлиентСервер.ПроверитьСоставАгрегата(РодительТекущейСтроки, ПараметрыПроверкиКодовМаркировки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

