#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст запроса для расчета статусов указания серий
// Параметры:
//	ПараметрыУказанияСерий - Структура - состав полей задается в функции ПроверкаИПодборПродукцииИС.ПараметрыУказанияСерий
// Возвращаемое значение:
//	Строка - текст запроса расчета статуса указания серий.
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	Возврат ИнтеграцияИС.ТекстЗапросаЗаполненияСтатусовУказанияСерий(
		Метаданные.Обработки.ПроверкаИПодборПродукцииИС, ПараметрыУказанияСерий);
	
КонецФункции

// Сформировать печатные формы объектов.
//
// Параметры:
//   МассивОбъектов        - Массив из Произвольный         - ссылки на объекты, которые нужно распечатать
//   ПараметрыПечати       - Структура                      - дополнительные настройки печати
//   КоллекцияПечатныхФорм - ТаблицаЗначений                - сформированные табличные документы (выходной параметр)
//   ОбъектыПечати         - СписокЗначений из Произвольный - имя области, в которой был выведен объект (выходной параметр)
//   ПараметрыВывода       - Структура                      - дополнительные параметры сформированных табличных документов (выходной параметр)
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_РасхожденияПоКодам") Тогда
		
		ДанныеПечати = ПараметрыПечати.СтруктураДанных;
		Макет = ПолучитьМакет("ПФ_MXL_РасхожденияПоКодам");
		ТабличныйДокумент = СверкаКодовМаркировкиИСМП.СформироватьПечатнуюФормуРасхожденияПоКодамМаркировки(ДанныеПечати, Макет);
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_РасхожденияПоКодам",
			НСтр("ru='Расхождения по кодам маркировки'"),
			ТабличныйДокумент,
			,
			"Обработки.ПроверкаИПодборПродукцииИС.ПФ_MXL_РасхожденияПоКодам");
			
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗагрузитьДанныеДокументаДлительнаяОперация", Истина);
	Методы.Вставить("ЗафиксироватьРезультатПроверкиИПодбора", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из длительной операции по подготовке данных для формы проверки и подбора маркируемой продукции.
// 
// Параметры:
//	Параметры - Структура - содержит следующие значения:
// 	* ПроверкаНеПоДокументу            - Булево - признак получения данных не по ссылке на документ
// 	* ПроверяемыйДокумент              - ДокументСсылка - ссылка на документ, из формы которого открыта форма проверки и подбора
// 	* НачальныйСтатусПроверки          - ПеречислениеСсылка.СтатусыПроверкиНаличияПродукцииИС - статус наличия продукции, используемый при подготовке данных
// 	* ДетализацияСтруктурыХранения     - ПеречислениеСсылка.ДетализацияСтруктурыХраненияИС - значение детализации из формы проверки
// 	* РедактированиеФормыНедоступно    - Булево - признак запрета редактирования формы подбора
// 	* РежимПодбораСуществующихУпаковок - Булево - признак работы со штрихкодами упаковок, имеющимися в информационной базе
// 	* ПараметрыСканирования            - Структура - параметры обработки кодов маркировки, сформированные в форме проверки и подбора
// 	* ПараметрыПроверкиКодовМаркировки - Структура - параметры проверки кодов маркировки по статусу и владельцу, сформированные в форме проверки и подбора
// 	* КонтролироватьСканируемуюПродукциюПоДокументуОснованию - Булево - признак необходимости контроля наличия маркируемой продукции по основанию проверяемого документа
// 	* Сценарий                         - Число - сценарий работы с маркируемой продукцией в документе
//	АдресРезультата - Строка - адрес временного хранилища, в которое будут помещены результаты выполнения
Процедура ЗагрузитьДанныеДокументаДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"Обработка.ПроверкаИПодборПродукцииИС.МодульМенеджера.ЗагрузитьДанныеДокументаДлительнаяОперация");
	
	ПараметрыСканирования = Параметры.ПараметрыСканирования;
	ПараметрыСканирования.СсылкаНаОбъект = Параметры.ПроверяемыйДокумент;
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("ДеревоМаркированнойПродукции",          ДеревоМаркированнойПродукции());
	ДанныеДокумента.Вставить("ПодобраннаяМаркируемаяПродукция",       ПодобраннаяМаркируемаяПродукция());
	ДанныеДокумента.Вставить("ДоступныеДляПроверкиУпаковки",          Новый СписокЗначений());
	ДанныеДокумента.Вставить("УпаковкиДокумента",                     Новый СписокЗначений());
	ДанныеДокумента.Вставить("НачальныйСтатусПроверки",               Параметры.НачальныйСтатусПроверки);
	ДанныеДокумента.Вставить("ДетализацияСтруктурыХранения",          Параметры.ДетализацияСтруктурыХранения);
	ДанныеДокумента.Вставить("РежимПодбораСуществующихУпаковок",      Параметры.РежимПодбораСуществующихУпаковок);
	ДанныеДокумента.Вставить("ПроверкаЭлектронногоДокумента",         Параметры.ПроверкаЭлектронногоДокумента);
	ДанныеДокумента.Вставить("ПараметрыПроверкиКодовМаркировки",      Параметры.ПараметрыПроверкиКодовМаркировки);
	ДанныеДокумента.Вставить("Сценарий",                              Параметры.Сценарий);
	ДанныеДокумента.Вставить("КоличествоНедопустимыхКодовМаркировки", 0);
	ДанныеДокумента.Вставить(
		"КонтролироватьСканируемуюПродукциюПоДокументуОснованию",
		Параметры.КонтролироватьСканируемуюПродукциюПоДокументуОснованию);
	ДанныеДокумента.Вставить(
		"ВозможностьЗагрузкиДанныхБезПодключенияМОТП",
		ПараметрыСканирования.ИСМП И Параметры.ВозможностьЗагрузкиДанныхБезПодключенияМОТП);
	ДанныеДокумента.Вставить("УточнениеКоэффициентовУпаковок",        Неопределено);
	ДанныеДокумента.Вставить("ДополнительноеДействиеЗагрузки",        Неопределено);
	ДанныеДокумента.Вставить("ОбработанЧастично", Параметры.РежимИсправленияОшибокПослеПередачиКодов);
	
	СохраненнаяДетализацияСтруктурыХранения = ПроверкаИПодборПродукцииИС.СохраненнаяДетализацияСтруктурыХранения(Параметры.РежимПодбораСуществующихУпаковок);
	
	ДопустимыеДетализации = ПроверкаИПодборПродукцииИСКлиентСервер.ДопустимыеДетализацииСтруктурыХранения(
		ПараметрыСканирования);
	Если ДопустимыеДетализации.Найти(СохраненнаяДетализацияСтруктурыХранения) = Неопределено Тогда
		СохраненнаяДетализацияСтруктурыХранения = Неопределено;
	КонецЕсли;
	
	Если ПараметрыСканирования.ИСМП Тогда
		МодульЛогированиеЗапросовИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ЛогированиеЗапросовИСМП");
		МодульПроверкаИПодборПродукцииИСМП = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПроверкаИПодборПродукцииИСМП");
		МодульМенеджераРегистрСведенийРезультатыПроверкиСредствамиККТИСМП = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрСведений.РезультатыПроверкиСредствамиККТИСМП");
	КонецЕсли;
	
	ДанныеДокумента.Вставить("СохраненнаяДетализацияСтруктурыХранения", СохраненнаяДетализацияСтруктурыХранения);
	ДанныеДокумента.Вставить("СодержимоеУпаковокНедоступно",       Ложь);
	ДанныеДокумента.Вставить("СтрокаПродукцияБезУпаковки",         Неопределено);
	ДанныеДокумента.Вставить("СтрокаПродукцияОбъемноСортовойУчет", Неопределено);
	ДанныеДокумента.Вставить("СтрокаБлокиБезКоробки",        Неопределено);
	ДанныеДокумента.Вставить("Организация",                  Параметры.ПараметрыСканирования.Организация);
	ДанныеДокумента.Вставить("ПроверяемыйДокумент",          Параметры.ПроверяемыйДокумент);
	ДанныеДокумента.Вставить("ЭтоВосстановлениеДетализации", Параметры.ЭтоВосстановлениеДетализации);
	ДанныеДокумента.Вставить("КешЛогистическихУпаковок",     Новый Соответствие);
	
	Если ПараметрыСканирования.ИСМП Тогда
		ДанныеДокумента.Вставить(
			"ОшибкиПроверкиСредствамиККТ",
			МодульМенеджераРегистрСведенийРезультатыПроверкиСредствамиККТИСМП.ДанныеРезультатовПроверкиДляПроверкиИПодбора(
				Параметры.ПроверяемыйДокумент));
	КонецЕсли;
	
	ДанныеДокумента.Вставить("ЗначенияШтрихкодовОбработанныхСОшибками", Новый Массив);
	ДанныеДокумента.Вставить("ПоддерживаетсяОбъемноСортовойУчет",       Параметры.ПоддерживаетсяОбъемноСортовойУчет);
	ДанныеДокумента.Вставить("ПроверитьСостояниеКодовМаркировкиВГИСМТ", Ложь);
	
	ДанныеДокумента.Вставить("ДопустимаПроизвольнаяЕдиницаУчета",
		ОбщегоНазначенияИС.ИспользуетсяПроизвольнаяЕдиницаУчета()
		Или (ОбщегоНазначенияИСКлиентСервер.ПоддерживаетсяЧастичноеВыбытие(ПараметрыСканирования)
				И ОбщегоНазначенияИС.ИспользуетсяЧастичноеВыбытие()));
	ДанныеДокумента.Вставить("ДопустимУчетМерныхТоваров",
		ДанныеДокумента.ДопустимаПроизвольнаяЕдиницаУчета И ОбщегоНазначенияИС.ЕстьПродукцияТребующаяВзвешивания());
	
	ЭтоПроверкаВходящегоДокумента = Параметры.ПроверкаЭлектронногоДокумента;
	
	// Таблица продукции
	Если Параметры.ПроверкаНеПоДокументу Тогда
		Товары = Параметры.ПроверяемыеДанные.ТаблицаМаркируемойПродукции; // Таблица значений
	Иначе
		Товары = Параметры.ТаблицаПродукции;
	КонецЕсли;
	
	// Список штрихкодов
	Если ЭтоПроверкаВходящегоДокумента Тогда
		Штрихкоды = ШтрихкодыУпаковокВходящегоДокумента(Параметры.ПроверяемыйДокумент, ПараметрыСканирования);
	ИначеЕсли Параметры.ПроверкаНеПоДокументу Тогда
		Штрихкоды = ШтрихкодыУпаковокИзВходящихДанных(Параметры.ПроверяемыеДанные.МассивУпаковок);
	Иначе
		
		Штрихкоды = ШтрихкодированиеИССлужебный.ШтрихкодыУпаковокИзДокумента(
			Параметры.ПроверяемыйДокумент, ПараметрыСканирования); // Таблица значений
		
		Для Каждого ЭлементДанных Из Штрихкоды Цикл
			Если Не ЗначениеЗаполнено(ЭлементДанных.ШтрихкодУпаковки)
				И ЗначениеЗаполнено(ЭлементДанных.Штрихкод) Тогда
				ДанныеДокумента.НачальныйСтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.НеПроверялась;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Детализация дерева
	
	ДетализацияСтруктурыХранения = Параметры.ДетализацияСтруктурыХранения;
	Если ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЭтоМаркировкаТоваровИСМП(ПараметрыСканирования) Тогда // Маркировка
		ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.Полная;
	ИначеЕсли ЭтоПроверкаВходящегоДокумента Тогда // Проверка входящего документа
		Если (Не Параметры.ЭтоВосстановлениеДетализации
			И ДопустимыеДетализации.Найти(ДетализацияСтруктурыХранения) <> Неопределено)
			Или Не ЗначениеЗаполнено(ДетализацияСтруктурыХранения) Тогда
			ДетализацияСтруктурыХранения = ПроверкаИПодборПродукцииИС.ДетализацияНаОснованииСтатистикиПоШтрихкодам(
				Штрихкоды, ПараметрыСканирования, Параметры.ПроверяемыйДокумент);
		КонецЕсли;
	КонецЕсли;
	ПараметрыСканирования.ДетализацияСтруктурыХранения = ДетализацияСтруктурыХранения;
	ДанныеДокумента.ДетализацияСтруктурыХранения       = ДетализацияСтруктурыХранения;
	
	// Настройка параметров сканирования для получения данных дерева
	ПараметрыСканирования.ВыполняетсяЗагрузкаДанныхВФормуПроверкиИПодбора = Истина;
	ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева   = Ложь;
	
	Если ПараметрыСканирования.ИСМП И Параметры.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
		МодульЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(Параметры.ПараметрыЛогированияЗапросовИСМП);
		МодульЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
	КонецЕсли;
	
	Если ПараметрыСканирования.ИСМП Тогда
		ПервоначальнаяНастройкаЗапросаДанныхСервисаИСМП = ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП;
	Иначе
		ПервоначальнаяНастройкаЗапросаДанныхСервисаИСМП = Неопределено;
	КонецЕсли;
	
	// Дерево упаковок
	Если ЭтоПроверкаВходящегоДокумента Тогда
		
		ПараметрыСканирования.СопоставлятьНоменклатуру = Ложь;
		Дерево = ВложенныеШтрихкодыУпаковокВходящегоДокумента(Товары, ПараметрыСканирования, ДанныеДокумента);
		Если Дерево.ПрерватьЗагрузку Тогда
			
			МодульЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(ДанныеДокумента);
			ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 0);
			ПоместитьВоВременноеХранилище(ДанныеДокумента, АдресРезультата);
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		Если ПараметрыСканирования.ИСМП
			И ПараметрыСканирования.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа") Тогда
			// Для отключения запроса подписи при открытии формы проверки
			ПараметрыСканирования.ТребуетсяПроверкаСредствамиККТ = Истина;
		КонецЕсли;
		
		Дерево = ШтрихкодированиеИССлужебный.ВложенныеШтрихкодыУпаковок(Штрихкоды, ПараметрыСканирования);
		Если ПараметрыСканирования.ИСМП И ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП <> Ложь Тогда
			
			Если (Дерево.ТребуетсяОбновлениеКлючаСессии Или Дерево.ТребуетсяОбновлениеКлючаСессииРозница)
				И ДанныеДокумента.ВозможностьЗагрузкиДанныхБезПодключенияМОТП Тогда
				
				ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП = Ложь;
				Дерево = ШтрихкодированиеИССлужебный.ВложенныеШтрихкодыУпаковок(Штрихкоды, ПараметрыСканирования);
				
			ИначеЕсли Не ДанныеДокумента.ВозможностьЗагрузкиДанныхБезПодключенияМОТП
				И МодульПроверкаИПодборПродукцииИСМП.ПрерватьОбработкуЗагрузкиДанных(
					ДанныеДокумента, ПараметрыСканирования, Дерево) Тогда
				
				Дерево.ПрерватьЗагрузку = Истина;
				
				МодульЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(ДанныеДокумента);
				ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 0);
				ПоместитьВоВременноеХранилище(ДанныеДокумента, АдресРезультата);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Дерево.ЕстьОшибки Тогда
		ВызватьИсключение Дерево.ТекстОшибки;
	КонецЕсли;
	
	// Подобранная продукция
	ЗаполнитьТаблицуПодобраннойМаркируемойПродукции(Товары, ДанныеДокумента, ПараметрыСканирования); // Таблица товаров
	ЗаполнитьТаблицуПродукцияПоДокументу(ДанныеДокумента); // Отдельная таблица данных документа
	ДополнитьТаблицуПодобраннойМаркируемойПродукции(Дерево, ДанныеДокумента, ПараметрыСканирования); // Колонка Подобрано / В дереве
	// Дерево
	ЗаполнитьДеревоМаркированнойПродукции(
		Дерево.ВложенныеШтрихкоды.ДеревоУпаковок, ДанныеДокумента, Параметры.ПараметрыСканирования, ДетализацияСтруктурыХранения);
	
	КоличествоДанных = ИнтеграцияИС.КоличествоСтрокДереваЗначений(ДанныеДокумента.ДеревоМаркированнойПродукции)
		+ ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.Количество();
	
	Если ПараметрыСканирования.ИСМП Тогда
		МодульЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(ДанныеДокумента);
	КонецЕсли;
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);
	
	ДанныеДокумента.ПроверитьСостояниеКодовМаркировкиВГИСМТ = (ПараметрыСканирования.ИСМП
		И ПараметрыСканирования.ЗапрашиватьДанныеСервисаИСМП <> ПервоначальнаяНастройкаЗапросаДанныхСервисаИСМП);
	
	ПоместитьВоВременноеХранилище(ДанныеДокумента, АдресРезультата);
	
КонецПроцедуры

// Фоновая операция по фиксации результатов проверки и подбора в документе, 
// 
// Параметры:
// 	Параметры - Структура - содержит следующие значения:
// 	   * СоздаватьАктОРасхождениях    - Булево - признак необходимости создания акта о расхождениях.
// 	   * ПроверяемыйДокумент          - ДокументСсылка - документ, для которого выполнялась проверка и подбор.
// 	   * ДеревоМаркированнойПродукции - ДеревоЗначений - содержит результаты проверки и подбора с иерархией упаковок.
// 	   * ДанныеПроверкиИПодбора       - ХранилищеЗначения      - содержит слепок состояния проверки и подбора, если предусмотрено его хранение по окончании результатов проверки.
// 	   * ПроверкаНеПоДокументу        - Булево - признак того, что проверка и подбор была вызвана из произвольной формы.
// 	   * СохранятьОписаниеGTIN        - Булево - Сохранять описание GTIN, EAN, коэффициенты групповых упаковок.
// 	   * ПодобраннаяМаркируемаяПродукция - ТаблицаЗначений - содержит информацию о подобранной продукции сгруппированную до 
// 	       номенклатуры, характеристики, серии.
// 	   * ПараметрыСканирования        - см. ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования.
// 	   * Сценарий                     - Число - номер сценария проверки/подбора в документе
// 	АдресРезультата - Строка - адрес временного хранилища, в которое будут помещены результаты выполнения
Процедура ЗафиксироватьРезультатПроверкиИПодбора(Параметры, АдресРезультата) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"Обработка.ПроверкаИПодборПродукцииИС.МодульМенеджера.ЗафиксироватьРезультатПроверкиИПодбора");
	
	ЗаполнитьСпецификуСрокиГодности = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗаполнятьСрокГодности(Параметры.ПараметрыСканирования);
	ЗаполнитьДанныеВетИС = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗаполнятьДанныеВЕТИС(Параметры.ПараметрыСканирования);
	ЗаполнитьСправку2 = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗапрашиватьСправку2(Параметры.ПараметрыСканирования);
	
	ПараметрыСканирования = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ПараметрыСканирования);
	// Количество для мультитоварных наборов и монотоварных наборов с отдельной номенклатурой требуется рассчитать заново
	ПараметрыСканирования.СозданиеНаборов = Ложь;
	
	Если Параметры.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(Параметры.ПараметрыЛогированияЗапросовИСМП);
		ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(Параметры.ПараметрыЛогированияЗапросовИСМП);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ПараметрыОкончанияПроверки = ПроверкаИПодборПродукцииИС.ПараметрыОкончанияПроверки();
		ПараметрыОкончанияПроверки.Сценарий                  = Параметры.Сценарий;
		ПараметрыОкончанияПроверки.СоздаватьАктОРасхождениях = Параметры.СоздаватьАктОРасхождениях;
		ПараметрыОкончанияПроверки.ПроверяемыйДокумент       = Параметры.ПроверяемыйДокумент;
		ПараметрыОкончанияПроверки.Сценарий                  = Параметры.Сценарий;
		ПараметрыОкончанияПроверки.ДанныеПроверкиИПодбора    = Параметры.ДанныеПроверкиИПодбора;
		
		ДеревоМаркированнойПродукции = Параметры.ДеревоМаркированнойПродукции.Скопировать();
		ДеревоМаркированнойПродукции.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
		УдалитьСлужебныеСтрокиДерева(ДеревоМаркированнойПродукции.Строки);
		УдалитьПустыеУпаковкиВСтрокахДерева(ДеревоМаркированнойПродукции.Строки);
		
		ТаблицаШтрихкодовВерхнегоУровня        = ПроверкаИПодборПродукцииИС.ПустаяТаблицаШтрихкодовВерхнегоУровня();
		ТаблицаШтрихкодовОбщая                 = ПроверкаИПодборПродукцииИС.ПустаяТаблицаШтрихкодовВерхнегоУровня();
		ТаблицаПодобраннойПровереннойПродукции = ПроверкаИПодборПродукцииИС.ПустаяТаблицаПодобраннойПровереннойПродукции();
		
		// Количество для мультитоварных наборов и монотоварных наборов с отдельной номенклатурой требуется рассчитать заново
		СтрокиДереваНаборов = Новый Массив;
		Если ДеревоМаркированнойПродукции.Колонки.Найти("КоличествоПоДаннымИБ") = Неопределено Тогда
			ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПоДаннымИБ", Новый ОписаниеТипов("Число"));
		КонецЕсли;
		Если ДеревоМаркированнойПродукции.Колонки.Найти("КоличествоПотребительскихУпаковокПоДаннымИБ") = Неопределено Тогда
			ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПотребительскихУпаковокПоДаннымИБ", Новый ОписаниеТипов("Число"));
		КонецЕсли;
		ПроверкаИПодборПродукцииИСМП.ЗаполнитьРекурсивноКоличествоПоДаннымИБПоКолонкеКоличество(ДеревоМаркированнойПродукции.Строки, СтрокиДереваНаборов);
		Если СтрокиДереваНаборов.Количество() Тогда
			ШтрихкодированиеИСМПСлужебный.НормализоватьСвойстваКоллекцииВложенныхШтрихкодов(ДеревоМаркированнойПродукции, ПараметрыСканирования);
			ДеревоМаркированнойПродукции.Колонки.Добавить("СтрокаДерева");
			ДеревоМаркированнойПродукции.Колонки.Добавить("ОбработанСОшибками", Новый ОписаниеТипов("Булево"));
			ШтрихкодированиеИСМПСлужебный.ЗаполнитьСтрокиТаблицыДанныхПоГрупповымУпаковкам(СтрокиДереваНаборов, ПараметрыСканирования);
			Для Каждого СтрокаДерева Из СтрокиДереваНаборов Цикл
				СтрокаДерева.КоличествоПоДаннымИБ = СтрокаДерева.Количество;
			КонецЦикла;
			ШтрихкодированиеИСМПСлужебный.НормализоватьДанныеДереваУпаковок(ДеревоМаркированнойПродукции, ПараметрыСканирования);
		КонецЕсли;
		
		ПараметрыСозданияШтрихкодов = Справочники.ШтрихкодыУпаковокТоваров.ПараметрыСозданияШтрихкодовУпаковокПоДеревуМаркируемойПродукции(
			ДеревоМаркированнойПродукции, Параметры.ПараметрыСканирования);
		Если СтрокиДереваНаборов.Количество() Тогда
			ПараметрыСозданияШтрихкодов.ИмяКолонкиКоличествоПотребительскихУпаковок = "КоличествоПотребительскихУпаковок";
		КонецЕсли;
		
		Справочники.ШтрихкодыУпаковокТоваров.РезультатСозданияШтрихкодовУпаковокПоДеревуМаркируемойПродукции(
			ДеревоМаркированнойПродукции, ТаблицаШтрихкодовВерхнегоУровня, ПараметрыСозданияШтрихкодов);
		
		Если ПараметрыСканирования.ЕГАИС Тогда
			РегистрыСведений.АкцизныеМаркиЕГАИС.ЗафиксироватьРезультатПроверкиИПодбора(
				ДеревоМаркированнойПродукции, ПараметрыСканирования.ОрганизацияЕГАИС);
		КонецЕсли;
		
		Если ЗаполнитьСпецификуСрокиГодности Или ЗаполнитьДанныеВетИС Тогда
			ТаблицаШтрихкодовВерхнегоУровня.Очистить();
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСрокаГодности(ДеревоМаркированнойПродукции.Строки, ТаблицаШтрихкодовВерхнегоУровня);
		ИначеЕсли ЗаполнитьСправку2 Тогда
			ТаблицаШтрихкодовВерхнегоУровня.Очистить();
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСправки2(ДеревоМаркированнойПродукции.Строки, ТаблицаШтрихкодовВерхнегоУровня);
		КонецЕсли;
		
		ЗаполнитьШтрихкодыВерхнегоУровняИдентификаторамиЗапросовГИСМТ(ДеревоМаркированнойПродукции.Строки, ТаблицаШтрихкодовВерхнегоУровня);
		
		ТаблицаШтрихкодовОбщаяПоДаннымДерева(ДеревоМаркированнойПродукции, ТаблицаШтрихкодовОбщая, ЗаполнитьСпецификуСрокиГодности);
		
		РегистрыСведений.ПулКодовМаркировкиСУЗ.ОтразитьАгрегациюКодовМаркировкиВПуле(ДеревоМаркированнойПродукции);
		
		Если Параметры.РежимИсправленияОшибокПослеПередачиКодов Тогда
			
			ШтрихкодыУпаковокОбработанСОшибкойВГИСМТ = ПроверкаИПодборПродукцииИСМП.КодыМаркировкиДляПовторнойОтправки(ДеревоМаркированнойПродукции);
			
			ДанныеЗаписи = Новый Структура;
			ДанныеЗаписи.Вставить("ДокументОснование", Параметры.ПроверяемыйДокумент);
			ДанныеЗаписи.Вставить("Сообщение",         ОбменДаннымиИСМП.СтроковоеПредставлениеПустогоУникальногоИдентификатора());
			ДанныеЗаписи.Вставить("ДанныеСообщения",   Новый ХранилищеЗначения(ШтрихкодыУпаковокОбработанСОшибкойВГИСМТ));
			
			РегистрыСведений.ПакетыКодовМаркировкиИСМП.ВыполнитьЗаписьВРегистр(ДанныеЗаписи);
			
		КонецЕсли;
		
		ПараметрыОкончанияПроверки.ТаблицаШтрихкодовВерхнегоУровня = ТаблицаШтрихкодовВерхнегоУровня;
		ПараметрыОкончанияПроверки.ТаблицаШтрихкодовОбщая          = ТаблицаШтрихкодовОбщая;
		
		ЕстьРасхождения = Ложь;
		СтруктураДатКонтроляПоВидамПродукций = Новый Соответствие();
		
		Для Каждого СтрокаДерева Из Параметры.ПодобраннаяМаркируемаяПродукция Цикл
			
			НоваяСтрока = ТаблицаПодобраннойПровереннойПродукции.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			
			Если ЗаполнитьСпецификуСрокиГодности Тогда
				НоваяСтрока.СрокГодности = СтрокаДерева.ГоденДо;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(НоваяСтрока.Характеристика) Тогда
				НоваяСтрока.Характеристика = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ХарактеристикаНоменклатуры"); 
			КонецЕсли;
				
			Если Не ЗначениеЗаполнено(НоваяСтрока.Серия) Тогда
				НоваяСтрока.Серия = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("СерияНоменклатуры"); 
			КонецЕсли;
			
			Если ПараметрыСканирования.ИСМП Тогда
				
				РазрешенОборотНемаркированныхОстатков = ОбщегоНазначенияИСМППовтИсп.РазрешенОборотНемаркируемыхОстатковПродукции(СтрокаДерева.ВидПродукции, ПараметрыСканирования.ДатаДокумента)
					Или Не ОбщегоНазначенияИСМППовтИсп.ДействуетКонтрольПоВидуОперацииИПродукции(ПараметрыСканирования.ВидОперацииИСМП, СтрокаДерева.ВидПродукции, ПараметрыСканирования.ДатаДокумента);
				Если РазрешенОборотНемаркированныхОстатков
					И СтрокаДерева.Количество > СтрокаДерева.КоличествоПодобрано Тогда
					// немаркированные остатки, не подобранные или частично подобранные
					НоваяСтрока.КоличествоПодобрано = НоваяСтрока.Количество;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НоваяСтрока.Количество <> НоваяСтрока.КоличествоПодобрано Тогда
				ЕстьРасхождения = Истина;
			КонецЕсли;
			
			Если Не СтрокаДерева.ПроизвольнаяЕдиницаУчета Тогда
				НоваяСтрока.КоличествоПотребительскихУпаковок = 0;
			КонецЕсли;
			
			Если СтруктураДатКонтроляПоВидамПродукций.Получить(СтрокаДерева.ВидПродукции) = Неопределено Тогда
				
				НастройкаКонтроляПоВидуПродукции = ПроверкаИПодборПродукцииИС.СтруктураДанныхКонтроляПоРазделеннымДатам(ПараметрыСканирования, СтрокаДерева.ВидПродукции);
				СтруктураДатКонтроляПоВидамПродукций.Вставить(СтрокаДерева.ВидПродукции, НастройкаКонтроляПоВидуПродукции);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыОкончанияПроверки.ДанныеКонтроляВидовПродукцииПоРазделеннымДатам = СтруктураДатКонтроляПоВидамПродукций;
		ПараметрыОкончанияПроверки.ТаблицаПодобраннойПровереннойПродукции         = ТаблицаПодобраннойПровереннойПродукции;
		
		Если Не Параметры.ПроверкаНеПоДокументу Тогда
			
			Если Параметры.СоздаватьАктОРасхождениях Тогда
				
				ПараметрыОкончанияПроверки.ТаблицаРасхожденийШтриховыхКодов = ТаблицаРасхожденийУпаковокПоРезультатамПроверкиИПодбора(Параметры);
				
				Если Параметры.Свойство("ДанныеКлючаСессииИСМП") Тогда
					ПараметрыСеанса.ДанныеКлючаСессииИСМП = Параметры.ДанныеКлючаСессииИСМП;
				КонецЕсли;
				
				ЗапрашиватьДанныеСервисаИСМП = ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования);
				
				ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, Ложь);
				ПараметрыСканирования.СопоставлятьНоменклатуру     = Ложь;
				
				РезультатПоискаПоДаннымДокумента = ШтрихкодированиеИС.ВложенныеШтрихкодыУпаковок(
					ТаблицаШтрихкодовВерхнегоУровня.ВыгрузитьКолонку("ШтрихкодУпаковки"),
					ПараметрыСканирования);
				ДеревоУпаковокПоДаннымДокумента = РезультатПоискаПоДаннымДокумента.ДеревоУпаковок;
				
				// Заполнение по данным УПД
				ДанныеШтрихкодовСписок = Новый Массив;
				ДанныеНоменклатурыПоДаннымУПД = ШтрихкодированиеИСМПСлужебный.ДанныеМаркируемойНоменклатурыПоДаннымУПД(Параметры.ПроверяемыйДокумент);
				
				ДляУпаковокТребоватьПодключениеИСМП = Истина;
				Если Параметры.ВозможностьЗагрузкиДанныхБезПодключенияМОТП = Истина Тогда
					ДляУпаковокТребоватьПодключениеИСМП = Ложь;
				КонецЕсли;
				
				Для Каждого КлючИЗначение Из ДанныеНоменклатурыПоДаннымУПД Цикл
					Штрихкод = КлючИЗначение.Ключ;
					Если ЗначениеЗаполнено(Штрихкод) Тогда
						ДанныеШтрихкодовСписок.Добавить(Новый Структура("Штрихкод, Количество", Штрихкод, 1));
					КонецЕсли;
				КонецЦикла;
				
				ПараметрыСканирования.ДопустимыеВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Истина);
				// Восстановление настроек параметров сканирования.
				ОбщегоНазначенияИСМПКлиентСервер.УстановитьПараметрСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования, ЗапрашиватьДанныеСервисаИСМП);
				
				ПараметрыСканирования.ВыполняетсяЗагрузкаДанныхВФормуПроверкиИПодбора = Истина;
				ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева       = Ложь; // Для нормализации вложенных штрихкодов
				
				РезультатПолученияДереваИСМП = ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкоды(
					ДанныеШтрихкодовСписок, ПараметрыСканирования, ДляУпаковокТребоватьПодключениеИСМП);
				
				Если РезультатПолученияДереваИСМП.ЕстьОшибки Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Ошибка при создании Акта о расхождениях.
						           |%1'"),
						РезультатПолученияДереваИСМП.ТекстОшибки);
					Если РезультатПолученияДереваИСМП.ТребуетсяОбновлениеКлючаСессии
						И Не ОбщегоНазначенияИСМПКлиентСервер.ЗначениеПараметраСканированияЗапрашиватьДанныеСервисаИСМП(ПараметрыСканирования) Тогда
						ТекстОшибки = СтрШаблон(
							НСтр("ru = '%1
							           |Включите опцию ""Запрашивать данные сервиса ГИС МТ""
							           |в панели администрирования ""Интеграция с ИС МП (обувь, одежда, табак...)""
							           |в разделе ""Настройки сканирования кодов маркировки"".'"),
							ТекстОшибки);
					КонецЕсли;
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				
				ДеревоУпаковокПоДаннымИСМП = РезультатПолученияДереваИСМП.ВложенныеШтрихкоды.ДеревоУпаковок;
				
				ШтрихкодыБрак = ШтрихкодированиеИС.ЗначенияНедопустимыхШтрихкодовИзДереваМаркируемойПродукции(
					ДеревоМаркированнойПродукции);
				
				ПараметрыСверки = СверкаКодовМаркировкиИСМП.ИнициализироватьПараметрыСверки();
				ПараметрыСверки.СохраненнаяДетализацияСтруктурыХранения = Параметры.ДетализацияСтруктурыХранения;
				
				ТаблицыТОРГ2 = СверкаКодовМаркировкиИСМП.ТаблицыРасхожденийПоДаннымЭДО(
					ДеревоУпаковокПоДаннымДокумента,
					ДеревоУпаковокПоДаннымИСМП,
					ШтрихкодыБрак,
					ПараметрыСверки);
				
				ДанныеПроверкиИПодбора = Параметры.ДанныеПроверкиИПодбора.Получить();
				ДанныеПроверкиИПодбора.Вставить("ТаблицыТОРГ2", ТаблицыТОРГ2);
				Параметры.ДанныеПроверкиИПодбора = Новый ХранилищеЗначения(ДанныеПроверкиИПодбора);
				
				ПараметрыОкончанияПроверки.ШтрихкодыУпаковокПланЭДО = ТаблицыТОРГ2.ШтрихкодыУпаковокПланЭДО;
				ПараметрыОкончанияПроверки.ШтрихкодыУпаковокФактЭДО = ТаблицыТОРГ2.ШтрихкодыУпаковокФактЭДО;
				
			КонецЕсли;
			
			Если Параметры.СохранятьОписаниеGTIN Тогда
				
				ТаблицаОписанияGTIN = ПроверкаИПодборПродукцииИС.ПустаяТаблицаОписанияGTIN();
				ПараметрыОкончанияПроверки.ТаблицаОписанияGTIN = ТаблицаОписанияGTIN;
				
				ЗаполнитьТаблицуОписанияGTINПоДеревуУпаковок(
					ТаблицаОписанияGTIN,
					Параметры.ДеревоМаркированнойПродукции);
				
			КонецЕсли;
			
			ПараметрыОкончанияПроверки.ДеревоМаркированнойПродукции = ДеревоМаркированнойПродукции;
			
			СохраняемыеДанныеПроверкиИПодбора = Неопределено;
			Если Параметры.ПроверкаЭлектронногоДокумента Тогда
				СохраняемыеДанныеПроверкиИПодбора = Параметры.ДанныеПроверкиИПодбора;
			КонецЕсли;
			
			Если Параметры.СоздаватьАктОРасхождениях
				И ЗначениеЗаполнено(ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях) Тогда
				
				РегистрыСведений.СтатусыПроверкиИПодбораИС.ОтразитьЗавершение(
					ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях,
					СохраняемыеДанныеПроверкиИПодбора,
					Параметры.Сценарий);
				
				РегистрыСведений.СтатусыПроверкиИПодбораИС.ОтразитьЗавершение(
					Параметры.ПроверяемыйДокумент,
					Неопределено,
					Параметры.Сценарий,
					Перечисления.ТребуемоеДействиеДокументЭДО.Подтвердить);
				
			Иначе
				
				Если ЕстьРасхождения Тогда
					ТребуемоеДействие = Перечисления.ТребуемоеДействиеДокументЭДО.Отклонить;
				Иначе
					ТребуемоеДействие = Перечисления.ТребуемоеДействиеДокументЭДО.Подтвердить;
				КонецЕсли;
				
				РегистрыСведений.СтатусыПроверкиИПодбораИС.ОтразитьЗавершение(
					Параметры.ПроверяемыйДокумент,
					СохраняемыеДанныеПроверкиИПодбора,
					Параметры.Сценарий,
					ТребуемоеДействие);
				
				Если ЗначениеЗаполнено(ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях) Тогда
					РегистрыСведений.СтатусыПроверкиИПодбораИС.ОтразитьЗавершение(
						ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях,
						Неопределено,
						Параметры.Сценарий);
				КонецЕсли;
				
			КонецЕсли;
			
			ПроверкаИПодборПродукцииИС.ЗафиксироватьРезультатПроверкиИПодбора(ПараметрыОкончанияПроверки);
			
			Если ТипЗнч(Параметры.ПроверяемыйДокумент) = Тип("ДокументСсылка.ПриемкаТоваровИСМП") Тогда
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Назначение",      Перечисления.НазначениеСообщенийИСМП.ИСМП);
				ДополнительныеПараметры.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиСообщенийИСМП.ЗаявкаОбрабатывается);
				ДополнительныеПараметры.Вставить("ОтражениеРезультатовПроверки", Истина);
				
				Документы.ПриемкаТоваровИСМП.ОбновитьСтатусПослеПолученияДанных(
					Параметры.ПроверяемыйДокумент, Перечисления.ВидыОперацийИСМП.ПолучениеРезультатаОбработкиДокумента, ДополнительныеПараметры);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаголовокСообщения    = НСтр("ru = 'Произошла ошибка при сохранении результатов проверки:'");
		Информация            = ИнформацияОбОшибке();
		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
		
		ТекстыСообщенияЖР = Новый Массив;
		ТекстыСообщенияЖР.Добавить(ЗаголовокСообщения);
		ТекстыСообщенияЖР.Добавить(Символы.ПС);
		ТекстыСообщенияЖР.Добавить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщенияЖР.Добавить(Символы.ПС);
				ТекстыСообщенияЖР.Добавить(Сообщение.Текст);
			КонецЦикла;
		КонецЕсли;
		
		ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			СтрСоединить(ТекстыСообщенияЖР),,
			Метаданные.Обработки.ПроверкаИПодборПродукцииИС);
		
		ТекстыСообщения = Новый Массив;
		ТекстыСообщения.Добавить(ЗаголовокСообщения);
		ТекстыСообщения.Добавить(Символы.ПС);
		ТекстыСообщения.Добавить(ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщения.Добавить(Символы.ПС);
				ТекстыСообщения.Добавить(Сообщение.Текст);
			КонецЦикла;
		Иначе
			ТекстыСообщения.Добавить(Символы.ПС);
			ТекстыСообщения.Добавить(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
		КонецЕсли;
		
		ВызватьИсключение СтрСоединить(ТекстыСообщения);
		
	КонецПопытки;
	
	КоличествоДанных = ИнтеграцияИС.КоличествоСтрокДереваЗначений(ДеревоМаркированнойПродукции);
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоДанных);
	
	РезультатПроверки = Новый Структура();
	
	Если Параметры.ПроверкаНеПоДокументу Тогда
		РезультатПроверки.Вставить("ТаблицаШтрихкодовВерхнегоУровня", ТаблицаШтрихкодовВерхнегоУровня);
		РезультатПроверки.Вставить("ТаблицаПодобраннойПровереннойПродукции", ТаблицаПодобраннойПровереннойПродукции);
	Иначе
		РезультатПроверки.Вставить("СозданныйАктОРасхождениях", ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях);
		Если Параметры.УпрощеннаяИнтеграцияБЭД
			И Не ЗначениеЗаполнено(ПараметрыОкончанияПроверки.СозданныйАктОРасхождениях) Тогда
			РезультатПроверки.Вставить("РасхожденияПоКодам", СверкаКодовМаркировкиИСМП.РасхожденияПриПриемке(ПараметрыОкончанияПроверки));
		КонецЕсли;
	КонецЕсли;
	
	ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(РезультатПроверки);
	
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаРасхожденийУпаковокПоРезультатамПроверкиИПодбора(Параметры)
	
	ТаблицаРасхождений = Новый ТаблицаЗначений;
	ТаблицаРасхождений.Колонки.Добавить("ШтрихкодУпаковки", Новый ОписаниеТипов("СправочникСсылка.ШтрихкодыУпаковокТоваров"));
	ТаблицаРасхождений.Колонки.Добавить("Штрихкод",         ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаРасхождений.Колонки.Добавить("Номенклатура",     Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ТаблицаРасхождений.Колонки.Добавить("Характеристика",   Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ТаблицаРасхождений.Колонки.Добавить("Серия",            Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	ТаблицаРасхождений.Колонки.Добавить("ЭтоИзлишек",       Новый ОписаниеТипов("Булево"));
	ТаблицаРасхождений.Колонки.Добавить("ЗначениеШтрихкода",ОбщегоНазначения.ОписаниеТипаСтрока(200));
	
	Для Каждого СтрокаДерева Из Параметры.ДеревоМаркированнойПродукции.Строки Цикл
		
		ЗаполнитьТаблицуРасхожденийПоСтрокеДерева(СтрокаДерева, ТаблицаРасхождений);
		
	КонецЦикла;
	
	Возврат ТаблицаРасхождений;
	
КонецФункции

Процедура ЗаполнитьТаблицуРасхожденийПоСтрокеДерева(СтрокаДерева, ТаблицаРасхождений)
	
	ЭтоИзлишек = (СтрокаДерева.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.НеЧислилась
		Или СтрокаДерева.СтатусПроверки = СтрокаДерева.НеСодержитсяВДанныхДокумента);
	
	ЭтоНедостача = СтрокаДерева.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.Отсутствует;
	
	ЭтоТипУпаковкиПоКоторомуФиксируютсяРасхождения = (СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка
		Или СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар);
	
	ВозможнаПроверкаПодчиненныхСтрок = (СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка
		Или СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка
		Или СтрокаДерева.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиПотребительскиеУпаковкиБезУпаковки());
	
	Если ЭтоТипУпаковкиПоКоторомуФиксируютсяРасхождения
		И (ЭтоИзлишек Или ЭтоНедостача) Тогда
		
		НоваяСтрокаТаблицы = ТаблицаРасхождений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаДерева);
		НоваяСтрокаТаблицы.ЭтоИзлишек        = ЭтоИзлишек;
		НоваяСтрокаТаблицы.ЗначениеШтрихкода = СтрокаДерева.Штрихкод;
		
		Возврат;
		
	КонецЕсли;
	
	Если ВозможнаПроверкаПодчиненныхСтрок Тогда
		
		Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.Строки Цикл
			
			ЗаполнитьТаблицуРасхожденийПоСтрокеДерева(ПодчиненнаяСтрока, ТаблицаРасхождений);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПодобраннойМаркируемойПродукции(ТаблицаМаркируемойПродукции, ДанныеДокумента, ПараметрыСканирования)
	
	Если ДанныеДокумента.РежимПодбораСуществующихУпаковок
			Или Не ДанныеДокумента.ПроверкаЭлектронногоДокумента Тогда
			
		ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТаблицаМаркируемойПродукции.ВыгрузитьКолонку("Номенклатура"));
		
		НомерСтроки = 1;
		Для Каждого СтрокаИсточника Из ТаблицаМаркируемойПродукции Цикл
			
			СтрокаПодобраннойПродукции = ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, СтрокаИсточника,, "КоличествоПотребительскихУпаковок");
			
			НастройкиНоменклатуры = ОписаниеНоменклатуры.Получить(СтрокаПодобраннойПродукции.Номенклатура);
			Если НастройкиНоменклатуры <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, НастройкиНоменклатуры);
				СтрокаПодобраннойПродукции.ВидПродукции = НастройкиНоменклатуры.КлючВидовПродукции;
			КонецЕсли;
			
			СтрокаПодобраннойПродукции.НоменклатураСопоставлена = ЗначениеЗаполнено(СтрокаПодобраннойПродукции.Номенклатура);
			СтрокаПодобраннойПродукции.ПредставлениеGTIN = ПроверкаИПодборПродукцииИСКлиентСервер.ПредставлениеМассиваGTIN(СтрокаПодобраннойПродукции.КодыGTIN);
			Если СтрокаПодобраннойПродукции.КодыGTIN.Количество() = 1 Тогда
				СтрокаПодобраннойПродукции.GTIN = СтрокаПодобраннойПродукции.КодыGTIN[0].Значение;
			КонецЕсли;
			СтрокаПодобраннойПродукции.НомерСтроки = НомерСтроки;
			
			ПроверкаИПодборПродукцииИСКлиентСервер.УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаПодобраннойПродукции);
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	Иначе
		
		ОписаниеНоменклатуры = ОбщегоНазначенияИС.ОписаниеНоменклатуры(ТаблицаМаркируемойПродукции.ВыгрузитьКолонку("Номенклатура"));
		
		ИменаКолонок = Новый Массив;
		ИменаКолонок.Добавить("Номенклатура");
		ИменаКолонок.Добавить("Характеристика");
		ИменаКолонок.Добавить("Серия");
		ИменаКолонок.Добавить("ГоденДо");
		ИменаКолонок.Добавить("ИдентификаторПроисхожденияВЕТИС");
		ИменаКолонок.Добавить("СкоропортящаясяПродукция");
		ИменаКолонок.Добавить("АлкогольнаяПродукция");
		ИменаКолонок.Добавить("Справка2");
		
		ИменаКолонокСтрокой = СтрСоединить(ИменаКолонок, ",");
		Шаблон = Новый ФиксированнаяСтруктура(ИменаКолонокСтрокой);
		
		Для Каждого СтрокаИсточника Из ТаблицаМаркируемойПродукции Цикл
			
			СтруктураПоиска = Новый Структура(Шаблон);
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаИсточника);
			
			Если СтрокаИсточника.КодыGTIN.Количество() = 1 Тогда
				СтруктураПоиска.Вставить("GTIN", СтрокаИсточника.КодыGTIN[0].Значение);
			ИначеЕсли Не ЗначениеЗаполнено(СтрокаИсточника.Номенклатура)
				И ЗначениеЗаполнено(СтрокаИсточника.GTIN) Тогда
				СтруктураПоиска.Вставить("GTIN", СтрокаИсточника.GTIN); // Требует рассмотрения
			КонецЕсли;
			
			НайденныеСтроки = ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				СтрокаПодобраннойПродукции = ДанныеДокумента.ПодобраннаяМаркируемаяПродукция.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, СтруктураПоиска);
				
				СтрокаПодобраннойПродукции.НоменклатураСопоставлена = ЗначениеЗаполнено(СтрокаПодобраннойПродукции.Номенклатура);
				СтрокаПодобраннойПродукции.КодыGTIN                 = СтрокаИсточника.КодыGTIN;
				СтрокаПодобраннойПродукции.ПредставлениеGTIN        = ПроверкаИПодборПродукцииИСКлиентСервер.ПредставлениеМассиваGTIN(СтрокаПодобраннойПродукции.КодыGTIN);
				
				НастройкиНоменклатуры = ОписаниеНоменклатуры.Получить(СтрокаПодобраннойПродукции.Номенклатура);
				Если НастройкиНоменклатуры <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаПодобраннойПродукции, НастройкиНоменклатуры);
					СтрокаПодобраннойПродукции.ВидПродукции = НастройкиНоменклатуры.КлючВидовПродукции;
				КонецЕсли;
				
			Иначе
				
				СтрокаПодобраннойПродукции = НайденныеСтроки[0];
				
			КонецЕсли;
			
			СтрокаПодобраннойПродукции.Количество = СтрокаПодобраннойПродукции.Количество + СтрокаИсточника.Количество;
			
		КонецЦикла;
		
		НомерСтроки = 0;
		Для Каждого СтрокаПодобраннойПродукции Из ДанныеДокумента.ПодобраннаяМаркируемаяПродукция Цикл
			НомерСтроки = НомерСтроки + 1;
			СтрокаПодобраннойПродукции.НомерСтроки = НомерСтроки;
			ПроверкаИПодборПродукцииИСКлиентСервер.УстановитьИндексКартинкиСостояниеПодбораКодаМаркировки(СтрокаПодобраннойПродукции);
		КонецЦикла;
		
	КонецЕсли;
	
	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(Неопределено, ДанныеДокумента.ПодобраннаяМаркируемаяПродукция, ПараметрыСканирования);
	
КонецПроцедуры

Процедура ДополнитьТаблицуПодобраннойМаркируемойПродукции(ДанныеПроверяемогоДокумента, ДанныеДокумента, ПараметрыСканирования)
	
	ТаблицаМаркируемойПродукции = ДанныеПроверяемогоДокумента.ДанныеКодовМаркировки.СкопироватьКолонки();
	
	Если ТаблицаМаркируемойПродукции.Колонки.Найти("СтрокаДерева") = Неопределено Тогда
		ТаблицаМаркируемойПродукции.Колонки.Добавить("СтрокаДерева");
	КонецЕсли;
	Если ТаблицаМаркируемойПродукции.Колонки.Найти("ВидУпаковки") = Неопределено Тогда
		ТаблицаМаркируемойПродукции.Колонки.Добавить("ВидУпаковки");
	КонецЕсли;
	Если ТаблицаМаркируемойПродукции.Колонки.Найти("ТребуетВзвешивания") = Неопределено Тогда
		ТаблицаМаркируемойПродукции.Колонки.Добавить("ТребуетВзвешивания");
	КонецЕсли;
	Если ТаблицаМаркируемойПродукции.Колонки.Найти("ПроизвольнаяЕдиницаУчета") = Неопределено Тогда
		ТаблицаМаркируемойПродукции.Колонки.Добавить("ПроизвольнаяЕдиницаУчета");
	КонецЕсли;
	Если ТаблицаМаркируемойПродукции.Колонки.Найти("ПредставлениеНоменклатуры") = Неопределено Тогда
		ТаблицаМаркируемойПродукции.Колонки.Добавить("ПредставлениеНоменклатуры");
	КонецЕсли;
	
	ДополнитьТаблицуМаркируемойПродукции(ДанныеПроверяемогоДокумента.ВложенныеШтрихкоды.ДеревоУпаковок, ТаблицаМаркируемойПродукции);
	
	ПроверкаИПодборПродукцииИС.ДополнитьТаблицуПодобраннойМаркируемойПродукции(
		ТаблицаМаркируемойПродукции, ДанныеДокумента, ПараметрыСканирования);
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуКодовМаркировки(ТаблицаКодовМаркировки, СтрокиМаркированнойПродукции)
	
	РодительскаяСтрока = СтрокиМаркированнойПродукции.Родитель;
	
	ТаблицаСостава = Обработки.ВиртуальнаяАгрегацияУпаковокИСМП.НоваяСоставУпаковки();
	ТаблицаСостава.Колонки.Добавить("КодМаркировки",          ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаСостава.Колонки.Добавить("ХешСуммаКодаМаркировки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого СтрокаМаркированнойПродукции Из СтрокиМаркированнойПродукции Цикл
		Если СтрокаМаркированнойПродукции.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			Продолжить;
		ИначеЕсли ИнтеграцияИСКлиентСервер.ЭтоУпаковка(СтрокаМаркированнойПродукции.ТипУпаковки) Тогда
			ЗаполнитьТаблицуКодовМаркировки(ТаблицаКодовМаркировки, СтрокаМаркированнойПродукции.Строки);
		ИначеЕсли СтрокаМаркированнойПродукции.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
			И РодительскаяСтрока <> Неопределено
			И ИнтеграцияИСКлиентСервер.ЭтоУпаковка(РодительскаяСтрока.ТипУпаковки) Тогда
			
			НоваяСтрока = ТаблицаСостава.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМаркированнойПродукции);
			НоваяСтрока.КодМаркировки          = СтрокаМаркированнойПродукции.Штрихкод;
			НоваяСтрока.ХешСуммаКодаМаркировки = ИнтеграцияИС.ХешированиеДанныхSHA256(НоваяСтрока.КодМаркировки);
			НоваяСтрока.Количество = 1;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаСостава.Количество() > 0 Тогда
		
		КопияСостава = ТаблицаСостава.Скопировать();
		КопияСостава.Свернуть("Номенклатура,Характеристика,Серия, GTIN", "Количество");
		ХешСуммаУпаковки = Обработки.ВиртуальнаяАгрегацияУпаковокИСМП.ХешСуммаУпаковки(КопияСостава);
		
		Для Каждого СтрокаСостава Из ТаблицаСостава Цикл
			НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
			НоваяСтрока.КодМаркировки          = СтрокаСостава.КодМаркировки;
			НоваяСтрока.ХешСуммаКодаМаркировки = ИнтеграцияИС.ХешированиеДанныхSHA256(НоваяСтрока.КодМаркировки);
			НоваяСтрока.ШтрихкодУпаковки       = РодительскаяСтрока.ШтрихкодУпаковки;
			НоваяСтрока.ХешСуммаУпаковки       = ХешСуммаУпаковки;
			НоваяСтрока.GTIN                   = СтрокаСостава.GTIN;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПродукцияПоДокументу(ДанныеДокумента)
	
	ПодобраннаяМаркируемаяПродукция = ДанныеДокумента.ПодобраннаяМаркируемаяПродукция;
	
	Если ПодобраннаяМаркируемаяПродукция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПродукцияПоДокументу = ПодобраннаяМаркируемаяПродукция.СкопироватьКолонки();
	
	Для Каждого СтрокаПодобраннойПродукции Из ПодобраннаяМаркируемаяПродукция Цикл
		
		Если СтрокаПодобраннойПродукции.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПродукцияПоДокументу.Добавить(), СтрокаПодобраннойПродукции);
		
	КонецЦикла;
	
	Если ПродукцияПоДокументу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокумента.Вставить("ПродукцияПоДокументу", ПродукцияПоДокументу);
	
КонецПроцедуры

Процедура ЗаполнитьШтрихкодыВерхнегоУровняИдентификаторамиЗапросовГИСМТ(СтрокиДерева, ТаблицаШтрихкодов)
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		СтруктураПоиска = Новый Структура("Штрихкод", Строка.Штрихкод);
		СтрокиТаблицы = ТаблицаШтрихкодов.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			
			СтрокаТаблицы.РазрешительныйРежимИдентификаторЗапросаГИСМТ = Строка.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
			СтрокаТаблицы.РазрешительныйРежимДатаЗапросаГИСМТ          = Строка.РазрешительныйРежимДатаЗапросаГИСМТ;
			СтрокаТаблицы.РазрешительныйРежимИдентификаторЭкземпляраПО = Строка.РазрешительныйРежимИдентификаторЭкземпляраПО;
			СтрокаТаблицы.РазрешительныйРежимВерсияБазы                = Строка.РазрешительныйРежимВерсияБазы;
			
		КонецЦикла;
		
		ЗаполнитьШтрихкодыВерхнегоУровняИдентификаторамиЗапросовГИСМТ(Строка.Строки, ТаблицаШтрихкодов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ТаблицаШтрихкодовОбщаяПоДаннымДерева(ДеревоМаркированнойПродукции, ТаблицаШтрихкодовОбщая, ЕстьСрокГодности)
	
	Для Каждого СтрокаДерева Из ДеревоМаркированнойПродукции.Строки Цикл
		Если ЗначениеЗаполнено(СтрокаДерева.ШтрихкодУпаковки) Тогда
			НоваяСтрока = ТаблицаШтрихкодовОбщая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			Если ЕстьСрокГодности Тогда
				НоваяСтрока.СрокГодности = СтрокаДерева.ГоденДо;
			КонецЕсли;
		КонецЕсли;
		ТаблицаШтрихкодовОбщаяПоДаннымДерева(СтрокаДерева, ТаблицаШтрихкодовОбщая, ЕстьСрокГодности);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуМаркируемойПродукции(ДеревоУпаковок, ТаблицаМаркируемойПродукции)
	
	ЕстьКолонкаТипШтрихкода = Неопределено;
	
	Для Каждого СтрокаДерева Из ДеревоУпаковок.Строки Цикл
		
		ДобавитьСтроку = Ложь;
		
		Если СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			
			ДобавитьСтроку = Истина;
			
		ИначеЕсли СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
			Или СтрокаДерева.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
			
			Если СтрокаДерева.Строки.Количество() = 0 Тогда
				Если ЕстьКолонкаТипШтрихкода = Неопределено Тогда
					ЕстьКолонкаТипШтрихкода = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДерева, "ТипШтрихкода");
				КонецЕсли;
				ДобавитьСтроку = ЕстьКолонкаТипШтрихкода
					И СтрокаДерева.ТипШтрихкода <> Перечисления.ТипыШтрихкодов.SSCC
					И СтрокаДерева.ТипШтрихкода <> Перечисления.ТипыШтрихкодов.SSCC18
					И СтрокаДерева.ТипШтрихкода <> Перечисления.ТипыШтрихкодов.SSCC20;
			Иначе
				ДополнитьТаблицуМаркируемойПродукции(СтрокаДерева, ТаблицаМаркируемойПродукции);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДобавитьСтроку Тогда
			
			СтрокаТЧ = ТаблицаМаркируемойПродукции.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаДерева);
			СтрокаТЧ.СтрокаДерева = СтрокаДерева;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСправки2(СтрокиДерева, ТаблицаШтрихкодов, ЭтоВерхнийУровень = Истина)
	
	//Первый проход: заполнение признака общности упаковок (справки2 для упаковки)
	Если ЭтоВерхнийУровень Тогда
		Для Каждого Строка Из СтрокиДерева Цикл
			ЗаполнитьПризнакиЕГАИСУпаковок(Строка);
		КонецЦикла;
	КонецЕсли;
	
	//Второй проход: заполнение верхнего уровня
	Для Каждого Строка Из СтрокиДерева Цикл
		Если ТипЗнч(Строка.ТипУпаковки) = Тип("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС") Тогда
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСправки2(Строка.Строки, ТаблицаШтрихкодов, Истина);
			Продолжить;
		КонецЕсли;
		Если ЭтоВерхнийУровень Или ЗначениеЗаполнено(Строка.Справка2) Тогда
			НоваяСтрокаШтрихкод = ТаблицаШтрихкодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШтрихкод, Строка);
			НоваяСтрокаШтрихкод.СрокГодности = Строка.ГоденДо;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.Справка2) Тогда
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСправки2(Строка.Строки, ТаблицаШтрихкодов, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьПризнакиЕГАИСУпаковок(СтрокаУпаковок)
	
	Если СтрокаУпаковок.Строки.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаУпаковок.ТипУпаковки) = Тип("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьОбщностьУпаковки = Неопределено;
	Справка2 = Неопределено;
	Для Каждого ВложеннаяСтрока Из СтрокаУпаковок.Строки Цикл
		ЕстьОбщностьУпаковкиСтроки = ЗаполнитьПризнакиЕГАИСУпаковок(ВложеннаяСтрока);
		Если Не ЕстьОбщностьУпаковкиСтроки Тогда
			ЕстьОбщностьУпаковки = Ложь;
		ИначеЕсли ЕстьОбщностьУпаковки = Неопределено Тогда
			ЕстьОбщностьУпаковки = Истина;
			Справка2 = ВложеннаяСтрока.Справка2;
		Иначе
			ЕстьОбщностьУпаковки = ЕстьОбщностьУпаковки И Справка2 = ВложеннаяСтрока.Справка2;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОбщностьУпаковки Тогда
		СтрокаУпаковок.Справка2 = Справка2;
	КонецЕсли;
	
	Возврат ЕстьОбщностьУпаковки;
	
КонецФункции

Процедура ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСрокаГодности(СтрокиДерева, ТаблицаШтрихкодов, ЭтоВерхнийУровень = Истина)
	
	//Первый проход: заполнение признака общности упаковок (идентификатора ВЕТИС и срока годности для упаковки)
	Если ЭтоВерхнийУровень Тогда
		Для Каждого Строка Из СтрокиДерева Цикл
			ЗаполнитьПризнакиВЕТИСУпаковок(Строка);
		КонецЦикла;
	КонецЕсли;
	
	//Второй проход: заполнение верхнего уровня
	Для Каждого Строка Из СтрокиДерева Цикл
		Если ТипЗнч(Строка.ТипУпаковки) = Тип("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС") Тогда
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСрокаГодности(Строка.Строки, ТаблицаШтрихкодов, Истина);
			Продолжить;
		КонецЕсли;
		Если ЭтоВерхнийУровень Или ЗначениеЗаполнено(Строка.ГоденДо) Или ЗначениеЗаполнено(Строка.ИдентификаторПроисхожденияВЕТИС) Тогда
			НоваяСтрокаШтрихкод = ТаблицаШтрихкодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаШтрихкод, Строка);
			НоваяСтрокаШтрихкод.СрокГодности = Строка.ГоденДо;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.ГоденДо)
			И Не ЗначениеЗаполнено(Строка.ИдентификаторПроисхожденияВЕТИС) Тогда
			ЗаполнитьШтрихкодыВерхнегоУровняСоСпецификойСрокаГодности(Строка.Строки, ТаблицаШтрихкодов, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьПризнакиВЕТИСУпаковок(СтрокаУпаковок)
	
	Если СтрокаУпаковок.Строки.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаУпаковок.ТипУпаковки) = Тип("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕстьОбщностьУпаковки = Неопределено;
	ИдентификаторПроисхожденияВЕТИС = Неопределено;
	ГоденДо = Неопределено;
	Для Каждого ВложеннаяСтрока Из СтрокаУпаковок.Строки Цикл
		ЕстьОбщностьУпаковкиСтроки = ЗаполнитьПризнакиВЕТИСУпаковок(ВложеннаяСтрока);
		Если Не ЕстьОбщностьУпаковкиСтроки Тогда
			ЕстьОбщностьУпаковки = Ложь;
		ИначеЕсли ЕстьОбщностьУпаковки = Неопределено Тогда
			ЕстьОбщностьУпаковки = Истина;
			ИдентификаторПроисхожденияВЕТИС = ВложеннаяСтрока.ИдентификаторПроисхожденияВЕТИС;
			ГоденДо = ВложеннаяСтрока.ГоденДо;
		Иначе
			ЕстьОбщностьУпаковки = ЕстьОбщностьУпаковки
				И ИдентификаторПроисхожденияВЕТИС = ВложеннаяСтрока.ИдентификаторПроисхожденияВЕТИС
				И ГоденДо = ВложеннаяСтрока.ГоденДо;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОбщностьУпаковки Тогда
		СтрокаУпаковок.ИдентификаторПроисхожденияВЕТИС = ИдентификаторПроисхожденияВЕТИС;
		СтрокаУпаковок.ГоденДо = ГоденДо;
	КонецЕсли;
	
	Возврат ЕстьОбщностьУпаковки;
	
КонецФункции

Процедура УдалитьПустыеУпаковкиВСтрокахДерева(СтрокиДерева)
	
	КоличествоСтрок = СтрокиДерева.Количество();
	
	Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
		СтрокаДерева = СтрокиДерева[КоличествоСтрок - ОбратныйИндекс];
		
		Если СтрокаДерева.ТипУпаковки <> Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
			ПодчиненныеСтроки = СтрокаДерева.Строки;
			
			Если ПодчиненныеСтроки.Количество() > 0 Тогда
				УдалитьПустыеУпаковкиВСтрокахДерева(ПодчиненныеСтроки);
			КонецЕсли;
			
			Если ПодчиненныеСтроки.Количество() = 0
				И (СтрокаДерева.КоличествоПодчиненныхПотребительскихУпаковок = 0
					Или Не СтрокаДерева.МаркируемаяПродукция) Тогда
				СтрокиДерева.Удалить(СтрокаДерева);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСлужебныеСтрокиДерева(СтрокиДерева)
	
	КоличествоСтрок = СтрокиДерева.Количество();
	Для ОбратныйИндекс = 1 По КоличествоСтрок Цикл
		СтрокаДерева = СтрокиДерева[КоличествоСтрок - ОбратныйИндекс];
		Если ТипЗнч(СтрокаДерева.ТипУпаковки) = Тип("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС")
			И СтрокаДерева.ТипУпаковки <> Перечисления.ПрочиеЗоныПересчетаПродукцииИС.ГруппировкаОбъемноСортовогоУчетаПоGTIN Тогда
			ПеренестиПодчиненныеСтроки(СтрокиДерева, СтрокаДерева.Строки);
			СтрокиДерева.Удалить(СтрокаДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеренестиПодчиненныеСтроки(Приемник, Источник)
	
	Для Каждого СтрокаИсточник Из Источник Цикл
		СтрокаПриемник = Приемник.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
		ПеренестиПодчиненныеСтроки(СтрокаПриемник.Строки, СтрокаИсточник.Строки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОписанияGTINПоДеревуУпаковок(ТаблицаОписанияGTIN, УзелДерева)
	
	Для Каждого СтрокаДерева Из УзелДерева.Строки Цикл
		
		Если СтрокаДерева.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
			ЗаполнитьТаблицуОписанияGTINПоДеревуУпаковок(ТаблицаОписанияGTIN, СтрокаДерева);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаДерева.GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("GTIN",        СтрокаДерева.GTIN);
		СтруктураПоиска.Вставить("ВидУпаковки", СтрокаДерева.ВидУпаковки);
		
		ПоискСтрок = ТаблицаОписанияGTIN.НайтиСтроки(СтруктураПоиска);
		
		Если ПоискСтрок.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаОписанияGTIN.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		
	КонецЦикла;
	
КонецПроцедуры

#Область Загрузка

Функция ПодобраннаяМаркируемаяПродукция() Экспорт
	
	ПодобраннаяМаркируемаяПродукция = Новый ТаблицаЗначений;
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("Номенклатура",                    Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("Характеристика",                  Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("Серия",                           Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("Количество",                      Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПодобрано",             Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ИндексКодаМаркировки",            Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("GTIN",                            Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ПредставлениеНоменклатуры",       Новый ОписаниеТипов("Строка"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("СтатусУказанияСерий",             Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ХарактеристикиИспользуются",      Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ТипНоменклатуры",                 Метаданные.ОпределяемыеТипы.ТипНоменклатуры.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("НомерСтроки",                     Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоИС",                    Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("НоменклатураСопоставлена",        Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС", Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип);
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ГоденДо",                         Новый ОписаниеТипов("Дата"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("СкоропортящаясяПродукция",        Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КодыGTIN",                        Новый ОписаниеТипов("СписокЗначений"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ПредставлениеGTIN",               Новый ОписаниеТипов("Строка"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("НоменклатураСопоставленаПоУПД",   Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПотребительскихУпаковок",                     Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПотребительскихУпаковокВСтруктуреУпаковок",   Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ПроизвольнаяЕдиницаУчета",                              Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ТребуетВзвешивания",                                    Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПотребительскихУпаковокТребующихВзвешивания", Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПодобраноВзвешено",                           Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПодобраноВзвешеноОСУ",                        Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("КоличествоПотребительскихУпаковокОСУ",                  Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("АлкогольнаяПродукция",            Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("Справка2",                        Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("МРЦ",                             Новый ОписаниеТипов("Число"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ВключаетМРЦ",                     Новый ОписаниеТипов("Булево"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("ВидПродукции",                    Новый ОписаниеТипов("СправочникСсылка.КлючиВидовПродукцииИС"));
	ПодобраннаяМаркируемаяПродукция.Колонки.Добавить("МаркируемаяПродукция",            Новый ОписаниеТипов("Булево"));
	
	Возврат ПодобраннаяМаркируемаяПродукция;
	
КонецФункции

Функция ВложенныеШтрихкодыУпаковокВходящегоДокумента(Товары, ПараметрыСканирования, ДанныеДокумента)
	
	ВходящийДокумент = ПараметрыСканирования.СсылкаНаОбъект;
	Если ПараметрыСканирования.ЕГАИС Тогда
		Результат = ШтрихкодированиеИССлужебный.ИнициализацияРезультатаФормированияВложенныхШтрихкодов();
		Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(ВходящийДокумент, "Документ.ТТНВходящаяЕГАИС") Тогда
			Результат.ВложенныеШтрихкоды = Новый Структура("ДеревоУпаковок",
				Документы.ТТНВходящаяЕГАИС.ШтрихкодыУпаковокСообщения(ВходящийДокумент));
			Результат.ДанныеКодовМаркировки = ОбщегоНазначения.СкопироватьРекурсивно(Товары);
			Возврат Результат;
		ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(ВходящийДокумент, "Документ.ТТНИсходящаяЕГАИС") Тогда
			Расхождения = Документы.ТТНИсходящаяЕГАИС.ШтрихкодыУпаковокАктаРасхождений(ВходящийДокумент);
			Результат.ВложенныеШтрихкоды = Новый Структура("ДеревоУпаковок",Расхождения.ДеревоУпаковок);
			Результат.ДанныеКодовМаркировки = Расхождения.МаркированныеТовары;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыСканирования.ИСМП Тогда
		
		Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(ВходящийДокумент, "Документ.ПриемкаТоваровИСМП") Тогда
			ПараметрыСканирования.ОпределениеВидаПродукцииИСМП                    = Истина;
			ПараметрыСканирования.ВыполняетсяЗагрузкаДанныхВФормуПроверкиИПодбора = Истина;
			ПараметрыСканирования.ИспользуетсяСоответствиеШтрихкодовСтрокДерева   = Ложь; // Для нормализации вложенных штрихкодов
			РезультатПолученияДанных = ШтрихкодированиеИСМП.ВложенныеШтрихкодыУпаковокПоДокументу(
				ВходящийДокумент, ПараметрыСканирования, Истина);
			Если (РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии
				Или Не РезультатПолученияДанных.ЕстьОшибки)
				И ПроверкаИПодборПродукцииИСМП.ПрерватьОбработкуЗагрузкиДанных(
					ДанныеДокумента, ПараметрыСканирования, РезультатПолученияДанных) Тогда
				РезультатПолученияДанных.ПрерватьЗагрузку = Истина;
			КонецЕсли;
			Возврат РезультатПолученияДанных;
		КонецЕсли;
		
		ДанныеНоменклатурыПоДаннымУПД = ПроверкаИПодборПродукцииИСМП.ДанныеНоменклатурыДокументаПоДаннымУПД(ВходящийДокумент);
		
		Если Не ИнтеграцияИСМП.ЭтоВходящийЭлектронныйДокумент(ВходящийДокумент) Тогда
			ПроверкаИПодборПродукцииИСМП.ПроверитьДанныеУПДНаНаличиеОшибок(ДанныеДокумента, ДанныеНоменклатурыПоДаннымУПД);
		КонецЕсли;
		
		Штрихкоды = Новый Массив;
		ДобавленныеШтрихкоды = Новый Соответствие;
		
		Для Каждого Строка Из ДанныеНоменклатурыПоДаннымУПД.СтрокиМаркируемойПродукции Цикл
			Если ДобавленныеШтрихкоды[Строка.Штрихкод] = Неопределено Тогда
				Штрихкоды.Добавить(Новый Структура("Штрихкод, Количество, ЗагруженИзЭлектронногоДокумента", Строка.Штрихкод, 1, Истина));
				ДобавленныеШтрихкоды[Строка.Штрихкод] = Истина;
			КонецЕсли;
		КонецЦикла;
		
		ДляУпаковокТребоватьПодключениеМОТП = Истина;
		Если ДанныеДокумента.ВозможностьЗагрузкиДанныхБезПодключенияМОТП = Истина Тогда
			ДляУпаковокТребоватьПодключениеМОТП = Ложь;
		КонецЕсли;
		
		РезультатПолученияДанных = ШтрихкодированиеИСМПСлужебный.ВложенныеШтрихкоды(
			Штрихкоды, ПараметрыСканирования, ДляУпаковокТребоватьПодключениеМОТП, Истина);
		
		Если (РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессии
			Или РезультатПолученияДанных.ТребуетсяОбновлениеКлючаСессииРозница
			Или Не РезультатПолученияДанных.ЕстьОшибки)
			И ПроверкаИПодборПродукцииИСМП.ПрерватьОбработкуЗагрузкиДанных(
				ДанныеДокумента, ПараметрыСканирования, РезультатПолученияДанных) Тогда
			
			РезультатПолученияДанных.ПрерватьЗагрузку = Истина;
			Возврат РезультатПолученияДанных;
			
		КонецЕсли;
		ШтрихкодированиеИСМПСлужебный.СвернутьОднородныеОбъемноСортовыеКоды(
			РезультатПолученияДанных, ДанныеНоменклатурыПоДаннымУПД.ШтрихкодНоменклатураТаблица);
		
		Возврат РезультатПолученияДанных;
		
	КонецЕсли;
	
КонецФункции

Функция ШтрихкодыУпаковокВходящегоДокумента(ВходящийДокумент, ПараметрыСканирования)
	
	Штрихкоды = Новый Массив;
	
	Если ПараметрыСканирования.ИСМП Тогда
		
		Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(ВходящийДокумент, "Документ.ПриемкаТоваровИСМП") Тогда
			Модуль = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПроверкаИПодборПродукцииИСМП");
			Возврат Модуль.ШтрихкодыУпаковокПриемкиТоваров(ВходящийДокумент);
		КонецЕсли;
		
		ДанныеНоменклатурыПоДаннымУПД = ПроверкаИПодборПродукцииИСМП.ДанныеНоменклатурыДокументаПоДаннымУПД(ВходящийДокумент);
		
		Штрихкоды = Новый Массив;
		ДобавленныеШтрихкоды = Новый Соответствие;
		
		Для Каждого Строка Из ДанныеНоменклатурыПоДаннымУПД.СтрокиМаркируемойПродукции Цикл
			Если ДобавленныеШтрихкоды[Строка.Штрихкод] = Неопределено Тогда
				Штрихкоды.Добавить(Новый Структура("Штрихкод, Количество, ЗагруженИзЭлектронногоДокумента", Строка.Штрихкод, 1, Истина));
				ДобавленныеШтрихкоды[Строка.Штрихкод] = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Штрихкоды;
	
КонецФункции

Функция ШтрихкодыУпаковокИзВходящихДанных(МассивУпаковок)
	
	Штрихкоды = Новый ТаблицаЗначений();
	Колонки   = ШтрихкодированиеИС.НовыйЭлементКоллекцииУпаковокДляРаспределенияПоТоварам();
	
	Для Каждого КлючИЗначение Из Колонки Цикл
		Штрихкоды.Колонки.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Штрихкоды.Колонки.Добавить("Справка2");
	Штрихкоды.Колонки.Добавить("АлкогольнаяПродукция");
	Штрихкоды.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС");
	Штрихкоды.Колонки.Добавить("СрокГодности");
	Штрихкоды.Колонки.Добавить("Количество");
	
	Для Каждого СтрокаДанных Из МассивУпаковок Цикл
		НоваяСтрока = Штрихкоды.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Количество = НоваяСтрока.ЧастичноеВыбытиеКоличество;
	КонецЦикла;
	
	Возврат Штрихкоды;
	
КонецФункции

Функция КэшОбщихМодулей()

	Кэш = Новый Структура;
	Кэш.Вставить("ПроверкаИПодборПродукцииИСМПКлиентСервер");
	Кэш.Вставить("ПроверкаИПодборПродукцииМОТПКлиентСервер");
	Если ОбщегоНазначенияИС.ПодсистемаСуществует("ИСМП") Тогда
		Кэш.ПроверкаИПодборПродукцииИСМПКлиентСервер = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПроверкаИПодборПродукцииИСМПКлиентСервер");
		Кэш.ПроверкаИПодборПродукцииМОТПКлиентСервер = ОбщегоНазначенияИСПовтИсп.ОбщийМодуль("ПроверкаИПодборПродукцииМОТПКлиентСервер");
	КонецЕсли;
	
	Возврат Кэш;
	
КонецФункции

#Область ДеревоМаркированнойПродукции

Процедура ЗаполнитьДеревоМаркированнойПродукции(ДеревоУпаковокДокумента, ДанныеДокумента, ПараметрыСканирования, ПринудительнаяДетализация)
	
	Если ЗначениеЗаполнено(ПринудительнаяДетализация) Тогда
		
		ДанныеДокумента.ДетализацияСтруктурыХранения = ПринудительнаяДетализация;
		
	Иначе
		
		ДетализацияСтруктурыХраненияДанныхДокумента = ПроверкаИПодборПродукцииИС.ДетализацияСтруктурыХраненияДерева(ДеревоУпаковокДокумента);
		
		Если ДанныеДокумента.СохраненнаяДетализацияСтруктурыХранения <> Неопределено Тогда
			Если ДеревоУпаковокДокумента.Строки.Количество() = 0 Тогда
				ДанныеДокумента.ДетализацияСтруктурыХранения = ДанныеДокумента.СохраненнаяДетализацияСтруктурыХранения;
			ИначеЕсли ДетализацияСтруктурыХраненияДанныхДокумента <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
				ДанныеДокумента.ДетализацияСтруктурыХранения = ДетализацияСтруктурыХраненияДанныхДокумента;
			Иначе
				ДанныеДокумента.ДетализацияСтруктурыХранения = ДанныеДокумента.СохраненнаяДетализацияСтруктурыХранения;
			КонецЕсли;
		Иначе
			ДанныеДокумента.ДетализацияСтруктурыХранения = ДетализацияСтруктурыХраненияДанныхДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСканирования.ДетализацияСтруктурыХранения = ДанныеДокумента.ДетализацияСтруктурыХранения;
	
	КоллекцияСтрокПриемника = ДанныеДокумента.ДеревоМаркированнойПродукции.Строки;
	
	Если ДанныеДокумента.ПараметрыПроверкиКодовМаркировки.КонтролироватьСоставАгрегатаПриИзмененииСтрокиДерева Тогда
		ДанныеДокумента.ПараметрыПроверкиКодовМаркировки.КонтролироватьСоставАгрегатаПриИзмененииСтрокиДерева = Ложь;
		ДанныеДокумента.ПараметрыПроверкиКодовМаркировки.КонтролироватьСоставАгрегата = Истина;
	КонецЕсли;
	
	КэшОбщихМодулей = КэшОбщихМодулей();
	Для Каждого СтрокаДереваУпаковок Из ДеревоУпаковокДокумента.Строки Цикл
		ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
			СтрокаДереваУпаковок, КоллекцияСтрокПриемника, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей);
	КонецЦикла;
	
	Если ДанныеДокумента.СтрокаПродукцияБезУпаковки = Неопределено
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
		ДобавленнаяСтрокаПродукцияБезУпаковки(ДанныеДокумента, ПараметрыСканирования.ЕГАИС, ПараметрыСканирования.ИСМП);
	КонецЕсли;
	
	Если ДанныеДокумента.СтрокаБлокиБезКоробки = Неопределено
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
		ДобавленнаяСтрокаБлокиБезКоробки(ДанныеДокумента);
	КонецЕсли;
	
	Если ДанныеДокумента.СтрокаПродукцияОбъемноСортовойУчет = Неопределено
		И ДанныеДокумента.ПоддерживаетсяОбъемноСортовойУчет Тогда
		ДобавленнаяСтрокаПродукцияОбъемноСортовогоУчета(ДанныеДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(СтрокаИсточника, КоллекцияСтрокПриемника, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей, ЭтоОСУ = Ложь)
	
	КешЛогистическихУпаковок = ДанныеДокумента.КешЛогистическихУпаковок;
	
	Если СтрокаИсточника.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Тогда
		
		Если ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
			
			НоваяСтрока = ДанныеДокумента.СтрокаПродукцияБезУпаковки;
			
			Если НоваяСтрока = Неопределено Тогда
				НоваяСтрока = ДобавленнаяСтрокаПродукцияБезУпаковки(ДанныеДокумента, ПараметрыСканирования.ЕГАИС, ПараметрыСканирования.ИСМП);
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаПродукции Из СтрокаИсточника.Строки Цикл
				ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
					СтрокаПродукции, КоллекцияСтрокПриемника, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей);
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаИсточника.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиГрупповыеУпаковкиБезКоробки() Тогда
		
		Если ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки
			И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
			
			НоваяСтрока = ДанныеДокумента.СтрокаБлокиБезКоробки;
			
			Если НоваяСтрока = Неопределено Тогда
				НоваяСтрока = ДобавленнаяСтрокаБлокиБезКоробки(ДанныеДокумента);
			КонецЕсли;
			
		Иначе
			
			Для Каждого СтрокаИсточникаБлок Из СтрокаИсточника.Строки Цикл
				Если ДанныеДокумента.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
					ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
						СтрокаИсточникаБлок, КоллекцияСтрокПриемника, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей);
				Иначе
					Для Каждого СтрокаИсточникаПачка Из СтрокаИсточникаБлок.Строки Цикл
						ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
							СтрокаИсточникаПачка, КоллекцияСтрокПриемника, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли СтрокаИсточника.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиОбъемноСортовойУчет() Тогда
		
		НоваяСтрока = ДанныеДокумента.СтрокаПродукцияОбъемноСортовойУчет;
		
		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = ДобавленнаяСтрокаПродукцияОбъемноСортовогоУчета(ДанныеДокумента);
		КонецЕсли;
		
	ИначеЕсли СтрокаИсточника.Родитель = Неопределено
		И (СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет
			Или СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.НеЯвляетсяУпаковкой) Тогда
		
		ЭлементГруппировкиПоGTIN = СтрокаОбъемноСортовогоУчетаПоGTIN(ДанныеДокумента, СтрокаИсточника);
		
		Если СтрокаИсточника.Строки.Количество() = 0 Тогда
			НоваяСтрока = ЭлементГруппировкиПоGTIN.Строки.Добавить();
		Иначе
			Для Каждого ПодчиненнаяСтрокаИсточника Из СтрокаИсточника.Строки Цикл
				ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
					ПодчиненнаяСтрокаИсточника, ЭлементГруппировкиПоGTIN.Строки, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей);
			КонецЦикла;
			Возврат;
		КонецЕсли;
		
	ИначеЕсли СтрокаИсточника.Родитель = Неопределено
		И СтрокаИсточника.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки Тогда
		
		СтрокаПродукцияБезУпаковки = ДанныеДокумента.СтрокаПродукцияБезУпаковки;
		
		Если СтрокаПродукцияБезУпаковки = Неопределено Тогда
			СтрокаПродукцияБезУпаковки = ДобавленнаяСтрокаПродукцияБезУпаковки(ДанныеДокумента, ПараметрыСканирования.ЕГАИС, ПараметрыСканирования.ИСМП);
		КонецЕсли;
		
		НоваяСтрока = СтрокаПродукцияБезУпаковки.Строки.Добавить();
		
	ИначеЕсли СтрокаИсточника.Родитель = Неопределено
		И (ПроверкаИПодборПродукцииИСКлиентСервер.ЭтоГрупповаяУпаковка(СтрокаИсточника)
			Или ПроверкаИПодборПродукцииИСКлиентСервер.ЭтоНабор(СтрокаИсточника))
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ПотребительскиеУпаковки
		И ДанныеДокумента.ДетализацияСтруктурыХранения <> Перечисления.ДетализацияСтруктурыХраненияИС.ГрупповыеУпаковкиСПотребительскими Тогда
		
		СтрокаБлокиБезКоробки = ДанныеДокумента.СтрокаБлокиБезКоробки;
		
		Если СтрокаБлокиБезКоробки = Неопределено Тогда
			СтрокаБлокиБезКоробки = ДобавленнаяСтрокаБлокиБезКоробки(ДанныеДокумента);
		КонецЕсли;
		
		НоваяСтрока = СтрокаБлокиБезКоробки.Строки.Добавить();
		НоваяСтрока.СтатусПроверки = ДанныеДокумента.НачальныйСтатусПроверки;
		
	ИначеЕсли СтрокаИсточника.Родитель <> Неопределено
		И (ПроверкаИПодборПродукцииИСКлиентСервер.ЭтоГрупповаяУпаковка(СтрокаИсточника.Родитель)
			Или ПроверкаИПодборПродукцииИСКлиентСервер.ЭтоНабор(СтрокаИсточника.Родитель))
		И СтрокаИсточника.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
		И ДанныеДокумента.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками Тогда
		
		Возврат;
		
	Иначе
		
		НоваяСтрока = КоллекцияСтрокПриемника.Добавить();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточника);
	
	НоваяСтрока.СтатусПроверки = ДанныеДокумента.НачальныйСтатусПроверки;
	Если ПараметрыСканирования.ИСМП Тогда
		НоваяСтрока.СтатусКодаМаркировки = СтрокаИсточника.Статус;
	
	Если СтрокаИсточника.ДанныеРазрешительнойДокументации <> Неопределено Тогда
		НоваяСтрока.СтатусРД = СтрокаИсточника.ДанныеРазрешительнойДокументации.ОбщаяГруппаСтатуса;
	КонецЕсли;
	
	Если СтрокаИсточника.СписокОрганизацийБлокировкиКМ <> Неопределено
		И СтрокаИсточника.СписокОрганизацийБлокировкиКМ.Количество() Тогда
		НоваяСтрока.ОрганыБлокировкиКМ = СтрСоединить(
			ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(СтрокаИсточника.СписокОрганизацийБлокировкиКМ));
	КонецЕсли;
	
		ОшибкаПроверкиККТ = ДанныеДокумента.ОшибкиПроверкиСредствамиККТ.Получить(НоваяСтрока.Штрихкод);
		Если ОшибкаПроверкиККТ <> Неопределено Тогда
			НоваяСтрока.ТекстОшибкиПроверкиСредствамиККТ = ОшибкаПроверкиККТ.ОписаниеОшибок;
			Если ОшибкаПроверкиККТ.ТребуетсяПолныйКодМаркировки Тогда
				НоваяСтрока.СостояниеТребованияПолногоКодаККТ = 1;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИСМП.ОбработкаСтрокиЧастичногоВыбытияПриВосстановленииДанных(
		НоваяСтрока,
		СтрокаИсточника,
		ПараметрыСканирования);
	
	Если ПараметрыСканирования.ИСМП Тогда
		Если ДанныеДокумента.ЗначенияШтрихкодовОбработанныхСОшибками.Найти(НоваяСтрока.Штрихкод) <> Неопределено Тогда
			НоваяСтрока.ТекстОбработанСОшибкойВГИСМТ = НСтр("ru = 'Пакет обработан с ошибкой в ГИС МТ'");
			НоваяСтрока.ОбработанСОшибкойВГИСМТ      = Истина;
		КонецЕсли;
		
		ПроверкаИПодборПродукцииИСМПКлиентСервер.ЗаполнитьСвойствоВключаетМРЦ(
			НоваяСтрока.ВидПродукции, НоваяСтрока, СтрокаИсточника);
		
	КонецЕсли;
	
	Если НоваяСтрока.ТипУпаковки = Перечисления.ТипыУпаковок.ПустаяСсылка() Тогда
		НоваяСтрока.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	ИначеЕсли НоваяСтрока.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
		И НЕ ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
		НоваяСтрока.ПредставлениеСодержимоеУпаковки         = СтрокаИсточника.ПредставлениеНоменклатуры;
		НоваяСтрока.ПредставлениеСодержимогоДоСопоставления = СтрокаИсточника.ПредставлениеНоменклатуры;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеДокумента.ПроверяемыйДокумент) = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		
		ОтрезатьСодержимоеГрупповыхУпаковок     = Ложь;
		ОтрезатьСодержимоеЛогистическойУпаковки = Ложь;
		
	Иначе
		
		ОтрезатьСодержимоеГрупповыхУпаковок =
			(СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Или СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
			И (ДанныеДокумента.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.КоробаСГрупповымиУпаковками
				Или ДанныеДокумента.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
				Или (СтрокаИсточника.КоличествоПотребительскихУпаковок > 0 И СтрокаИсточника.Строки.Количество() = 0));
		
		ОтрезатьСодержимоеЛогистическойУпаковки =
			(СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
				Или СтрокаИсточника.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет)
			И (ЗначениеЗаполнено(СтрокаИсточника.Номенклатура) И СтрокаИсточника.КоличествоПотребительскихУпаковок > 0 И ЗначениеЗаполнено(СтрокаИсточника.GTIN))
			И (ДанныеДокумента.ДетализацияСтруктурыХранения = Перечисления.ДетализацияСтруктурыХраненияИС.ПалетыСМонотоварнымиКоробами
				Или СтрокаИсточника.Строки.Количество() = 0);
		Если ОтрезатьСодержимоеЛогистическойУпаковки
			И СтрокаИсточника.СоставКодаМаркировки <> Неопределено
			И Не СтрокаИсточника.СоставКодаМаркировки.Свойство("GTIN") Тогда
			ОтрезатьСодержимоеЛогистическойУпаковки = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока.КоличествоПодчиненныхПотребительскихУпаковок = СтрокаИсточника.КоличествоПотребительскихУпаковок;
	
	Если (НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
		Или НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор)
		И ОтрезатьСодержимоеГрупповыхУпаковок Тогда
		НоваяСтрока.НеПересчитыватьКоличествоПотребительскихУпаковок = Истина;
	КонецЕсли;
	
	Если (НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая
		Или НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет)
		И ОтрезатьСодержимоеЛогистическойУпаковки Тогда
		НоваяСтрока.НеПересчитыватьКоличествоПотребительскихУпаковок = Истина;
	КонецЕсли;
	
	Если НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.НеЯвляетсяУпаковкой Тогда
		НоваяСтрока.НеПересчитыватьКоличествоПотребительскихУпаковок = Истина;
	КонецЕсли;
	
	Если (НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет
		Или НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.НеЯвляетсяУпаковкой)
		И НоваяСтрока.СтатусПроверки = Перечисления.СтатусыПроверкиНаличияПродукцииИС.ВНаличии Тогда
			НоваяСтрока.КоличествоПодчиненныхВНаличии = НоваяСтрока.КоличествоПодчиненныхПотребительскихУпаковок;
	КонецЕсли;
	
	ПроверкаИПодборПродукцииИСКлиентСервер.УстановитьДоступностьУпаковкиДляПроверки(НоваяСтрока, ДанныеДокумента.ДоступныеДляПроверкиУпаковки);
	ПроверкаИПодборПродукцииИСКлиентСервер.СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(
		НоваяСтрока, ПараметрыСканирования.ЕГАИС, ПараметрыСканирования.ИСМП, ПараметрыСканирования.Прочее);
	ПроверкаИПодборПродукцииИСКлиентСервер.СформироватьПредставлениеСодержимогоУпаковки(НоваяСтрока);
	
	СтрокаРодитель = НоваяСтрока.Родитель;
	
	ЭтоОСУ = Ложь;
	Если СтрокаРодитель <> Неопределено
		И СтрокаРодитель.ТипУпаковки = Перечисления.ПрочиеЗоныПересчетаПродукцииИС.ГруппировкаОбъемноСортовогоУчетаПоGTIN Тогда
		ЭтоОСУ = Истина;
	ИначеЕсли НоваяСтрока.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
		ЭтоОСУ = Истина;
	КонецЕсли;
	
	Если ПараметрыСканирования.ИСМП И (
		Не ДанныеДокумента.ПараметрыПроверкиКодовМаркировки.РежимИсправленияОшибокПослеПередачиКодов
			Или НоваяСтрока.ОбработанСОшибкойВГИСМТ
			Или (НоваяСтрока.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
				И НоваяСтрока.Родитель <> Неопределено
				И НоваяСтрока.Родитель.ОбработанСОшибкойВГИСМТ)) Тогда
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(НоваяСтрока.ВидПродукции) Тогда
			КэшОбщихМодулей.ПроверкаИПодборПродукцииИСМПКлиентСервер.ПроверитьДопустимостьКодаМаркировки(НоваяСтрока, ДанныеДокумента.ПараметрыПроверкиКодовМаркировки,, ЭтоОСУ);
		ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(НоваяСтрока.ВидПродукции) Тогда
			КэшОбщихМодулей.ПроверкаИПодборПродукцииМОТПКлиентСервер.ПроверитьДопустимостьКодаМаркировки(НоваяСтрока, ДанныеДокумента.ПараметрыПроверкиКодовМаркировки,, ЭтоОСУ);
		КонецЕсли;
	КонецЕсли;
	
	Если НоваяСтрока.СодержимоеНедоступно Тогда
		ДанныеДокумента.СодержимоеУпаковокНедоступно = Истина;
	КонецЕсли;
	
	Если ИнтеграцияИСКлиентСервер.ЭтоУпаковка(НоваяСтрока.ТипУпаковки) Тогда
		ДанныеДокумента.УпаковкиДокумента.Добавить(НоваяСтрока.Штрихкод);
	КонецЕсли;

	КоллекцияСтрокНовойСтроки = НоваяСтрока.Строки;
	
	Для Каждого ПодчиненнаяСтрокаИсточника Из СтрокаИсточника.Строки Цикл
		ДобавитьСтрокуДереваМаркированнойПродукцииПриЗагрузке(
			ПодчиненнаяСтрокаИсточника, КоллекцияСтрокНовойСтроки, ДанныеДокумента, ПараметрыСканирования, КэшОбщихМодулей, ЭтоОСУ);
	КонецЦикла;
	
	Если ДанныеДокумента.ПараметрыПроверкиКодовМаркировки.КонтролироватьСоставАгрегата
		И НоваяСтрока.ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Логистическая")
		И КешЛогистическихУпаковок.Получить(НоваяСтрока.НормализованныйШтрихкод) = Неопределено Тогда
		
		ПроверкаИПодборПродукцииИСМПКлиентСервер.ПроверитьСоставАгрегата(НоваяСтрока, ДанныеДокумента.ПараметрыПроверкиКодовМаркировки);
		КешЛогистическихУпаковок.Вставить(НоваяСтрока.НормализованныйШтрихкод, Истина);
		
	КонецЕсли;
	
	Если НоваяСтрока.НедопустимыйКодМаркировки Тогда
		ДанныеДокумента.КоличествоНедопустимыхКодовМаркировки = ДанныеДокумента.КоличествоНедопустимыхКодовМаркировки + 1;
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавленнаяСтрокаПродукцияБезУпаковки(ДанныеДокумента, ЕГАИС, ИСМП)
	
	НоваяСтрока = ДанныеДокумента.ДеревоМаркированнойПродукции.Строки.Вставить(0);
	
	ПроверкаИПодборПродукцииИСКлиентСервер.ЗаполнитьСтрокуПродукцияБезУпаковки(НоваяСтрока, ЕГАИС, ИСМП);
	
	ДанныеДокумента.СтрокаПродукцияБезУпаковки = НоваяСтрока;
	
	Возврат НоваяСтрока;

КонецФункции

Функция ДобавленнаяСтрокаБлокиБезКоробки(ДанныеДокумента)
	
	СтрокиДерева = ДанныеДокумента.ДеревоМаркированнойПродукции.Строки;
	
	Если СтрокиДерева.Количество() = 0 Тогда
		НоваяСтрока = СтрокиДерева.Вставить(0);
	ИначеЕсли СтрокиДерева[0].ТипУпаковки <> ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиПотребительскиеУпаковкиБезУпаковки() Тогда
		НоваяСтрока = СтрокиДерева.Вставить(0);
	Иначе
		НоваяСтрока = СтрокиДерева.Вставить(1);
	КонецЕсли;
	
	НоваяСтрока.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиГрупповыеУпаковкиБезКоробки();
	ПроверкаИПодборПродукцииИСКлиентСервер.СформироватьПредставлениеДляСтрокиДереваМаркированнойПродукции(НоваяСтрока);
	НоваяСтрока.ИндексКартинкиТипУпаковки = 3;
	
	ДанныеДокумента.СтрокаБлокиБезКоробки = НоваяСтрока;
	
	Возврат НоваяСтрока;

КонецФункции

Функция ДеревоМаркированнойПродукции()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипЧисло  = Новый ОписаниеТипов("Число");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата   = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя);
	
	ТипыВидовПродукции = Новый Массив;
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.КлючиВидовПродукцииИС"));
	ТипыВидовПродукции.Добавить(Тип("СправочникСсылка.ВидыПродукцииИС"));
	
	ДеревоМаркированнойПродукции = Новый ДеревоЗначений();
	ДеревоМаркированнойПродукции.Колонки.Добавить("СтатусПроверки",                      Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыПроверкиНаличияПродукцииИС"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПредставлениеПроверкиПодчиненных",    ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТипУпаковки",                         Новый ОписаниеТипов("ПеречислениеСсылка.ПрочиеЗоныПересчетаПродукцииИС, ПеречислениеСсылка.ТипыУпаковок"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхУпаковок",       ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхВНаличии",       ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхОтсутствует",    ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Штрихкод",                            ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВсяУпаковкаПроверена",                ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИндексКартинкиТипУпаковки",           ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИндексКартинкиСтатусПроверки",        ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТребуетсяПеремаркировка",             ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Представление",                       ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПредставлениеСодержимоеУпаковки");
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПредставлениеСодержимогоДоСопоставления",      ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхОтложено",                ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхПотребительскихУпаковок", ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НомерСтикераОтложено",                ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НеСодержитсяВДанныхДокумента",        ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НеСоответствуетОтбору",               ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИдетПроверкаДаннойУпаковки",          ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхНеЧислилось",    ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхНеПроверялось",  ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхВсего",          ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ХешСумма",                            ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Номенклатура",                        Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Характеристика",                      Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Серия",                               Метаданные.ОпределяемыеТипы.СерияНоменклатуры.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИдентификаторСтроки",                 ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВУпаковкеРазныеСерии",                ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВУпаковкеРазнаяНоменклатура",         ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВУпаковкеРазныеХарактеристики",       ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИННВладельца",                        ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("СтатусКодаМаркировки",                Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("GTIN",                                Метаданные.ОпределяемыеТипы.GTIN.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВУпаковкеРазныйGTIN",                 ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПредставлениеПроверкиКодаМаркировки", ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НедопустимыйКодМаркировки",           ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("СодержимоеНедоступно",                ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИдентификаторПроисхожденияВЕТИС",     Метаданные.ОпределяемыеТипы.ИдентификаторПроисхожденияВЕТИС.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ГоденДо",                             Новый ОписаниеТипов("Дата"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("СкоропортящаясяПродукция",            ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТипШтрихкода",                        Новый ОписаниеТипов("ПеречислениеСсылка.ТипыШтрихкодов"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ХешСуммаНормализации",                ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВидУпаковки",                         Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУпаковокИС"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("СпособВводаВОборот",                  Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВводаВОборотСУЗ"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТекстОшибкиПроверкиСредствамиККТ",    ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("СостояниеТребованияПолногоКодаККТ",   ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Количество",                          ОбщегоНазначения.ОписаниеТипаЧисло(18, 8));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПроизвольнаяЕдиницаУчета",            ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТребуетВзвешивания",                  ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НеПересчитыватьКоличествоПотребительскихУпаковок", ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("Коэффициент",                                      ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("КоличествоПодчиненныхГрупповыхУпаковок",           ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ЧастичноеВыбытие",                    ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ЧастичноеВыбытиеВариантУчета",        Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыУчетаЧастичногоВыбытияИС"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ЧастичноеВыбытиеНоменклатура",        Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ЧастичноеВыбытиеХарактеристика",      Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПлановоеКоличествоПотребительскихУпаковок", ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("НормализованныйШтрихкод",             ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ТекстОбработанСОшибкойВГИСМТ",        ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ОбработанСОшибкойВГИСМТ",             ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ОбъемноСортовойУчет",                 ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("СтатусRFID",                          ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("РазрешительныйРежимДатаЗапросаГИСМТ",          ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("РазрешительныйРежимИдентификаторЭкземпляраПО", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("РазрешительныйРежимВерсияБазы",                Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	ДеревоМаркированнойПродукции.Колонки.Добавить("СтатусРД",                                     Новый ОписаниеТипов("ПеречислениеСсылка.ГруппыСтатусовРазрешительныхДокументовИСМП"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ОрганыБлокировкиКМ",                           ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ПродажаПоДаннымОффлайнРежима",                 ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ДатаВводаВОборот",                             ТипДата);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ДатаПроизводства",                             ТипДата);
	ДеревоМаркированнойПродукции.Колонки.Добавить("АлкогольнаяПродукция",                Новый ОписаниеТипов("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("Справка2",                            Новый ОписаниеТипов("СправочникСсылка.Справки2ЕГАИС"));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВыбытиеБутылки",                      ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ЕстьОшибкаПоПротоколуОбменаЕГАИС",    ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ДлинаАкцизнойМаркиЕГАИС",             ТипЧисло);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВидПродукции",                        Новый ОписаниеТипов(ТипыВидовПродукции));
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВСеройЗоне",                          ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ВключаетМРЦ",                         ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("ИННПроизводителя",                    ТипСтрока);
	ДеревоМаркированнойПродукции.Колонки.Добавить("МаркируемаяПродукция",                ТипБулево);
	ДеревоМаркированнойПродукции.Колонки.Добавить("МРЦ",                                 Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Возврат ДеревоМаркированнойПродукции;
	
КонецФункции

Функция ДобавленнаяСтрокаПродукцияОбъемноСортовогоУчета(ДанныеДокумента)
	
	СтрокиДерева = ДанныеДокумента.ДеревоМаркированнойПродукции.Строки;
	
	Если СтрокиДерева.Количество() = 0 Тогда
		НоваяСтрока = СтрокиДерева.Добавить();
	Иначе
		ТекущийИндекс            = 0;
		МаксимальныйИндексСтроки = 2;
		Для ТекущийИндекс = 0 По Мин(СтрокиДерева.Количество() - 1, МаксимальныйИндексСтроки) Цикл
			Если СтрокиДерева[ТекущийИндекс].ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиПотребительскиеУпаковкиБезУпаковки()
				Или СтрокиДерева[ТекущийИндекс].ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиГрупповыеУпаковкиБезКоробки() Тогда
				Продолжить;
			КонецЕсли;
			Прервать;
		КонецЦикла;
		НоваяСтрока = СтрокиДерева.Вставить(ТекущийИндекс);
	КонецЕсли;
	
	НоваяСтрока.ТипУпаковки = ПроверкаИПодборПродукцииИСКлиентСервер.ТипУпаковкиОбъемноСортовойУчет();
	НоваяСтрока.Представление = НСтр("ru = 'Продукция объемно-сортового учета'");
	НоваяСтрока.ИндексКартинкиТипУпаковки = 5;
	
	ДанныеДокумента.СтрокаПродукцияОбъемноСортовойУчет = НоваяСтрока;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция СтрокаОбъемноСортовогоУчетаПоGTIN(ДанныеДокумента, ДанныеШтрихкода, СоздаватьСтроки = Истина) Экспорт
	
	СтрокаОбъемноСортовогоУчета = ДанныеДокумента.СтрокаПродукцияОбъемноСортовойУчет;
	
	Если СтрокаОбъемноСортовогоУчета = Неопределено Тогда
		Если Не СоздаватьСтроки Тогда
			Возврат Неопределено;
		КонецЕсли;
		СтрокаОбъемноСортовогоУчета = ДобавленнаяСтрокаПродукцияОбъемноСортовогоУчета(ДанныеДокумента);
	КонецЕсли;
	
	ЭлементыОбъемноСортовогоУчета = СтрокаОбъемноСортовогоУчета.Строки;
	
	ЭлементГруппировкиПоGTIN = Неопределено;
	Если ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.ОбъемноСортовойУчет Тогда
		GTIN = ДанныеШтрихкода.GTIN;
	Иначе
		GTIN = "";
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ЭлементыОбъемноСортовогоУчета Цикл
		Если СтрокаДерева.GTIN = GTIN Тогда
			
			ЭлементГруппировкиПоGTIN = СтрокаДерева;
			
			Если ЭлементГруппировкиПоGTIN.Номенклатура <> ДанныеШтрихкода.Номенклатура Тогда
				ЭлементГруппировкиПоGTIN.Номенклатура   = Неопределено;
				ЭлементГруппировкиПоGTIN.Характеристика = Неопределено;
				ЭлементГруппировкиПоGTIN.Серия          = Неопределено;
			ИначеЕсли ЭлементГруппировкиПоGTIN.Характеристика <> ДанныеШтрихкода.Характеристика Тогда
				ЭлементГруппировкиПоGTIN.Характеристика = Неопределено;
				ЭлементГруппировкиПоGTIN.Серия          = Неопределено;
			ИначеЕсли ЭлементГруппировкиПоGTIN.Серия <> ДанныеШтрихкода.Серия Тогда
				ЭлементГруппировкиПоGTIN.Серия          = Неопределено;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементГруппировкиПоGTIN = Неопределено Тогда
		
		Если Не СоздаватьСтроки Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЭлементГруппировкиПоGTIN = ЭлементыОбъемноСортовогоУчета.Добавить();
		
		ЭлементГруппировкиПоGTIN.GTIN = GTIN;
		ЗаполнитьЗначенияСвойств(ЭлементГруппировкиПоGTIN, ДанныеШтрихкода);
		ЭлементГруппировкиПоGTIN.АлкогольнаяПродукция = Неопределено; //представление итогов немаркируемой продукции
		
		ПроверкаИПодборПродукцииИСКлиентСервер.ЗаполнитьСтрокуГруппировкаОбъемноСортовогоУчетаПоGTIN(
			ЭлементГруппировкиПоGTIN);
		
	КонецЕсли;
	
	Возврат ЭлементГруппировкиПоGTIN;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли