#Область ПрограммныйИнтерфейс

// Это списание кодов маркировки.
// 
// Параметры:
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП - Операция
//  ВключатьОперацииСУЗ - Булево - Включать операции СУЗ
// 
// Возвращаемое значение:
//  Булево - Это списание кодов маркировки
Функция ЭтоСписаниеКодовМаркировки(Операция) Экспорт
	
	ОперацииСписания = ИнтеграцияИСМПКлиентСервер.ОперацииСписанияКодовМаркировки();
	Возврат ОперацииСписания.Найти(Операция) <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЭлементыКонструктораВидовПродукции

// Соответствие операций списания элементам конструктора.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//    * Ключ - ПеречислениеСсылка.ВидыОперацийИСМП - Вид операции списания
//    * Значение - СправочникСсылка.ЭлементыКонструктораВидовПродукцииИС - Элемент конструктора
Функция СоответствиеОперацийСписанияЭлементамКонструктора() Экспорт

	Результат = Новый Соответствие();

	Результат.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезГИСМТОбщийДокумент"),
		ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезГИСМТОбщийДокумент"));

	Результат.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезСУЗ"),
		ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезСУЗ"));

	Результат.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезГИСМТ"),
		ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезГИСМТ"));
		
	Результат.Вставить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.СписаниеЧерезСУЗМех"),
		ПредопределенноеЗначение("Справочник.ЭлементыКонструктораВидовПродукцииИС.СписаниеЧерезСУЗМех"));

	Возврат Результат;
	
КонецФункции

// Доступные причины списания.
// 
// Параметры:
//  ВидыПродукции - Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции
//  Операция - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Операция
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ПричиныВыводаИзОборотаИСМП - Доступные причины списания
Функция ДоступныеПричиныСписания(ВидыПродукции, Операция = Неопределено) Экспорт
	
	ПричиныСписания = Новый Массив;
	
	ЭлементыОпераций = СоответствиеОперацийСписанияЭлементамКонструктора();
	
	Если Операция = Неопределено Тогда
		Для Каждого Элемент Из ЭлементыОпераций Цикл
			ПричиныСписанияЭлемента = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
				Элемент.Значение, ВидыПродукции);
			
			Если ТипЗнч(ПричиныСписанияЭлемента) = Тип("Массив") Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПричиныСписания, ПричиныСписанияЭлемента, Истина);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элемент = ЭлементыОпераций[Операция];
		Если Элемент = Неопределено Тогда
			Возврат ПричиныСписания;
		КонецЕсли;
		
		ПричиныСписанияЭлемента = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			Элемент, ВидыПродукции);
		
		Если ТипЗнч(ПричиныСписанияЭлемента) = Тип("Массив") Тогда
			ПричиныСписания = ПричиныСписанияЭлемента;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПричиныСписания;
	
КонецФункции

// Доступные операции списания.
// 
// Параметры:
//  ВидыПродукции - Массив из СправочникСсылка.ВидыПродукцииИС - Виды продукции
//  ПричинаСписания - СправочникСсылка.ПричиныВыводаИзОборотаИСМП
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыОперацийИСМП - Доступные операции списания
Функция ДоступныеОперацииСписания(ВидыПродукции, ПричинаСписания) Экспорт

	ДоступныеОперации = Новый Массив;
	ЭлементыОпераций = СоответствиеОперацийСписанияЭлементамКонструктора();

	Для Каждого Элемент Из ЭлементыОпераций Цикл
		ПричиныСписанияЭлемента = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			Элемент.Значение, ВидыПродукции);

		Если ПричиныСписанияЭлемента.Найти(ПричинаСписания) <> Неопределено Тогда
			ДоступныеОперации.Добавить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;

	Возврат ДоступныеОперации;

КонецФункции

Функция ПроверятьЗаполнениеПоляКодФиас(ВидПродукцииТоварнаяГруппа, ПричинаСписания) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляКодФИАС"),
		ВидПродукцииТоварнаяГруппа,
		ПричинаСписания);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой(ВидПродукцииТоварнаяГруппа, ПричинаСписания) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой"),
		ВидПродукцииТоварнаяГруппа,
		ПричинаСписания);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляПроизводственныйОбъект(ВидПродукцииТоварнаяГруппа, ПричинаСписания) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПроизводственныйОбъект"),
		ВидПродукцииТоварнаяГруппа,
		ПричинаСписания);
	
КонецФункции

Функция ПроверятьЗаполнениеПоляПричинаСписанияВТабличнойЧасти(ВидПродукцииТоварнаяГруппа, Операция, ПричинаСписания) Экспорт
	
	Значения = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПроверятьЗаполнениеПоляПричинаСписанияВТабличнойЧасти"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
	Возврат Не (Значения.Найти(Операция) = Неопределено Или Значения.Найти(ПричинаСписания) = Неопределено);
	
КонецФункции

Функция ДоступноПолеПричинаСписанияВТабличнойЧасти(ВидПродукцииТоварнаяГруппа, Операция) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПричинаСписанияВТабличнойЧасти"),
		ВидПродукцииТоварнаяГруппа,
		Операция);
	
КонецФункции

Функция ДоступноПредставлениеАдресаПроизводственногоОбъекта(ВидПродукцииТоварнаяГруппа, ПричинаСписания = Неопределено) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеПредставлениеАдресаПроизводственногоОбъекта"),
		ВидПродукцииТоварнаяГруппа,
		ПричинаСписания);
	
КонецФункции

Функция ДоступноПолеКодФИАС(ВидПродукцииТоварнаяГруппа, ПричинаСписания) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ПолеКодФИАС"),
		ВидПродукцииТоварнаяГруппа,
		ПричинаСписания);
	
КонецФункции

Функция ВОтчетеОНанесенииИспользоватьНеполныйКод(ВидПродукцииТоварнаяГруппа, ПричинаСписания) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЭлементКонструктораСодержитЗначение(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ВОтчетеОСписанииИспользоватьНеполныйКод"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа),
		ПричинаСписания);
	
КонецФункции

Функция ДоступноСписаниеВложенныхЭлементов(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		ПредопределенноеЗначение(
			"Справочник.ЭлементыКонструктораВидовПродукцииИС.ДоступноСписаниеВложенныхЭлементов"),
		КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукции(ВидПродукцииТоварнаяГруппа));
	
КонецФункции

#КонецОбласти

#КонецОбласти