
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбновитьДанныеФормы();

	Элементы.ДокументОснование.Доступность = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ТипыДокументаОснованияНастроеныДляТитула(5);
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("Группа2");

	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	
	ТумблерЗаполненИД = ЗначениеЗаполнено(Объект.ИдДокОснДовОргСост);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьДокумент();
	ПоказатьСкрытьГруппы(ЭтаФорма);
	УправлениеВидимостьюСумм(ЭтаФорма);
	
	ЗаполнитьСуммуДляРасчета();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		// ДА КАК ЖЕ ТЕБЯ ОБНОВИТЬ так чтобы требуемые действия отобразились?
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		// пока что это единственный найденный способ, приводящий к обновлению требуемых действий.
		// вот список НЕ работающих (возможно они не считают форму активной, поэтому не работают)
		// ОбновитьДанныеФормы();
		// Элементы.Товары.Обновить();
		// ОбновитьОтображениеДанных();
		// ОбновитьИнтерфейс();
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ПерепроверитьДокумент" Тогда
		
		ПодключитьОбработчикОжидания("ПроверитьДокумент", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	УправлениеЭлементамиФормыВЗависимостиОтСтатуса();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Объект.ДокументЭТРН, Истина);
	КодТекущегоСтатусаДокументооборота = ТекущийСтатусДокументооборота.Код;
	
	ПерешелВЛогистическиеСтатус = ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена;
	Элементы.ТекущийСтатус.Видимость = Не ПерешелВЛогистическиеСтатус;
	Элементы.ТекущийСтатусДокументооборота.Видимость = ПерешелВЛогистическиеСтатус;
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование ,Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		ИЛИ ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена Тогда
		ДоступнаОсновнаяКнопкаПоУмолчанию = Истина;
	Иначе
		ДоступнаОсновнаяКнопкаПоУмолчанию = Ложь;
	КонецЕсли;
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = ДоступнаОсновнаяКнопкаПоУмолчанию;
	
	Если КодТекущегоСтатусаДокументооборота = "c-rejected" Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Заголовок = "Создать Титул 5 с уточнениями";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию.Видимость = Истина;
	КонецЕсли;
	
	Титул1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1, Объект.ДокументЭТРН);
	Титул2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, Объект.ДокументЭТРН);
	
	Титул3 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ3Основную(Объект.ДокументЭТРН);
	Титул4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиПриемкуТрнТ4Основную(Объект.ДокументЭТРН);
	
	Титул8ЗаменаВодителя = Документы.КонтурЛогистика_ТрН_Титул8.ПоследняяЗамена(Объект.ДокументЭТРН, "НовыеВодители");
	
	Если ЗначениеЗаполнено(Титул8ЗаменаВодителя) Тогда 
		ВодительНаВыгрузке = Титул8ЗаменаВодителя.НовыеВодители[0].Водитель;
	Иначе
		ВодительНаВыгрузке = Титул1.Водитель;
	КонецЕсли;
		
	ПрицепВЭТрНеУказан = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп);
	Прицеп2ВЭТрНеУказан = ЗначениеЗаполнено(Объект.ДокументЭТРН.Прицеп2);
	
	ВсеПереадресации = Документы.КонтурЛогистика_ТрН_Титул7.ВсеПереадресации(Объект.ДокументЭТРН);
	ПерадресацииИВозвраты.Загрузить(ВсеПереадресации);
	
	ВсеЗамены = Документы.КонтурЛогистика_ТрН_Титул8.ВсеЗамены(Объект.ДокументЭТРН);
	ЗаменыВодителейТС.Загрузить(ВсеЗамены);
	
	Для Каждого Замена Из ЗаменыВодителейТС Цикл 
		Замена.ЕстьЗаменаВодителя 	= Замена.Ссылка.НовыеВодители.Количество();
		Замена.ЕстьЗаменаТС 		= Замена.Ссылка.НовыеТранспортныеСредства.Количество();
		Замена.ЕстьЗаменаПрицепа 	= Замена.Ссылка.НовыеПрицепы.Количество();
	КонецЦикла;
	
	ВсеОтметки = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеОтметкиПоЭТрН(Объект.ДокументЭТРН);
	Отметки.Загрузить(ВсеОтметки);
	
	ВсеАкты = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеАктыПоЭТрН(Объект.ДокументЭТРН);
	Акты.Загрузить(ВсеАкты);
	
	ВсеШтрафы = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.ВсеШтрафыПоЭТрН(Объект.ДокументЭТРН);
	Штрафы.Загрузить(ВсеШтрафы);
	
	ДатаПрибытияПогрПВ 	= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрПриб), Титул2.ЗамДатВрПриб, "не указал");
	ДатаПостПогрПВ 		= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрПосПрием), Титул2.ЗамДатВрПосПрием, "не указал");
	ДатаУбытияПогрПВ 	= ?(ЗначениеЗаполнено(Титул2.ЗамДатВрУбыт), Титул2.ЗамДатВрУбыт, "не указал");
	
	ДатаПрибытияВыгрПВ 	= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрПриб), Титул4.ЗамДатВрПриб, "не указал");
	ДатаПостВыгрПВ 		= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрПосВыгр), Титул4.ЗамДатВрПосВыгр, "не указал");
	ДатаУбытияВыгрПВ 	= ?(ЗначениеЗаполнено(Титул4.ЗамДатВрУбыт), Титул4.ЗамДатВрУбыт, "не указал");
		
	ДатыПрибытияНаПогрОтличаются 	= ЗначениеЗаполнено(ДатаПрибытияПогрПВ) И ДатаПрибытияПогрПВ <> "не указал" И Титул1.ДатаВремяПрибытия <> ДатаПрибытияПогрПВ;
	ДатыПрибытияНаВыгрОтличаются 	= ЗначениеЗаполнено(ДатаПрибытияВыгрПВ) И ДатаПрибытияВыгрПВ <> "не указал" И Титул3.ФДатВрПриб <> ДатаПрибытияВыгрПВ;
	ДатыУбытияНаПогрОтличаются 		= ЗначениеЗаполнено(ДатаУбытияПогрПВ) И ДатаУбытияПогрПВ <> "не указал" И Титул1.ДатаВремяУбытия <> ДатаУбытияПогрПВ;
	ДатыУбытияНаВыгрОтличаются 		= ЗначениеЗаполнено(ДатаУбытияВыгрПВ) И ДатаУбытияВыгрПВ <> "не указал" И Титул3.ФДатВрУбыт <> ДатаУбытияВыгрПВ;
	
	ЗамечанияВодителяНаПогр = Титул2.ЗамечанияВодителя;
	ЗамечанияВодителяНаВыгр = Титул4.ЗамечанияВодителя;
	
	ЗамечанияПеревозчикаНаПогр = КонтурЛогистика_ПечатьСервер.ОписаниеЗамечанийПеревозчика(Титул2,, Истина);
	ЗамечанияПеревозчикаНаВыгр = КонтурЛогистика_ПечатьСервер.ОписаниеЗамечанийПеревозчика(Титул4, Истина, Истина);
	
	ЭтоЭкспедиция = Объект.ДокументЭТрН.ЭтоЭкспедиция;
	
	ЕстьРасхожденияПоМассе 		= Не Титул1.МассаБруттоКг = Титул3.МассаБруттоКг;
	ЕстьРасхожденияПоКоличеству = Не Титул1.КоличествоМест = Титул3.КоличествоМестПринято;
	
	// установка заголовков страниц
		
	Элементы.ГруппаТоварыИзТ1.Заголовок 			= "Грузы при оформлении (" + Титул1.Товары.Количество() + ")";	
	Элементы.ГруппаТоварыИзТ3.Заголовок 			= "Грузы на приемке (" + Титул3.Товары.Количество() + ")";
	Элементы.СтраницаПереадресации.Заголовок 		= "Переадресации и возвраты (" + ПерадресацииИВозвраты.Количество() + ")";
	Элементы.СтраницаЗаменыВодителейТС.Заголовок 	= "Замены водителей | ТС (" + ЗаменыВодителейТС.Количество() + ")";
	Элементы.СтраницаОтметки.Заголовок 				= "Отметки, Акты, Штрафы (" + Отметки.Количество() + ")";
	
	// заголовок Т3
	
	Элементы.ГруппаТоварыИзТ3.Картинка = БиблиотекаКартинок.КонтурЛогистика_Коробка;
	
	Если ЕстьРасхожденияПоКоличеству Или ЕстьРасхожденияПоМассе Тогда 
		
		Элементы.ГруппаТоварыИзТ3.Картинка = БиблиотекаКартинок.КонтурЛогистика_ВосклицаниеКрасное;
		
		Если ЕстьРасхожденияПоКоличеству И ЕстьРасхожденияПоМассе Тогда 
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по количеству и массе)";
		ИначеЕсли ЕстьРасхожденияПоКоличеству Тогда 
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по количеству)";
		Иначе	
			Элементы.ГруппаТоварыИзТ3.Заголовок = "Грузы на приемке (" + Титул3.Товары.Количество() + ", есть расхождения по массе)";
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьПоказателиРасчетаСумм(ЭтаФорма);
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");	
	Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыВЗависимостиОтСтатуса()
		
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик 
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		Или (ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка И ЗначениеЗаполнено(Объект.ДокументЭТРН.УИД))
		Или КодТекущегоСтатусаДокументооборота = "c-rejected" Тогда
		
		ТолькоПросмотр = Макс(Ложь, ТолькоПросмотр);
		Элементы.ГруппаИсправление.Видимость = Объект.НомИспр > 0;
		
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		ТолькоПросмотр = Истина;
		Элементы.ГруппаИсправление.Видимость = Истина;
		Если Элементы.Найти("ВнестиИсправлениеТитула") <> Неопределено Тогда
			Элементы.ВнестиИсправлениеТитула.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюИДоступностью(Форма)
	
	Элементы 	= Форма.Элементы;
	Объект 		= Форма.Объект;
	
	Элементы.ГруппаПодписьПеревозчика.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	Элементы.ИдДок.Видимость 			= Форма.ТумблерЗаполненИД;
	Элементы.ГруппаДокумент.Видимость 	= Не Форма.ТумблерЗаполненИД;
		
	СтавкаРавнаБезНДС = Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС")
						Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС0"); 
						
	Элементы.СуммаНДС.Видимость 		= Не СтавкаРавнаБезНДС;
	Элементы.СтоимостьСНДС.Видимость 	= Не СтавкаРавнаБезНДС;
	
	Элементы.ГруппаПрицеп.Видимость = Форма.ПрицепВЭТрНеУказан;
	Элементы.ГруппаПрицеп2.Видимость = Форма.Прицеп2ВЭТрНеУказан;
	Элементы.ГруппаЭкспедиция.Видимость = Форма.ЭтоЭкспедиция;
	
	Элементы.СтраницаОтметки.Видимость 				= ЗначениеЗаполнено(Форма.Отметки); 
	Элементы.СтраницаПереадресации.Видимость 		= ЗначениеЗаполнено(Форма.ПерадресацииИВозвраты);
	Элементы.СтраницаЗаменыВодителейТС.Видимость 	= ЗначениеЗаполнено(Форма.ЗаменыВодителейТС);	
	
	Элементы.ЗамечанияВодителяПогр.Видимость 	= ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.БезЗамечВодитПогр.Видимость 		= Не ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.ЗамечанияПеревозчикаПогр.Видимость = ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
	Элементы.БезЗамечПВПогр.Видимость 			= Не ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
		
	Элементы.ЗамечанияВодителяВыгр.Видимость 	= ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр);
	Элементы.БезЗамечВодитВыгр.Видимость 		= Не ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр);
	Элементы.ЗамечанияПеревозчикаВыгр.Видимость = ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр);
	Элементы.БезЗамечПВВыгр.Видимость 			= Не ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьСкрытьГруппы(Форма)
	
	Элементы 	= Форма.Элементы;
	
	// поведение группы "Погрузка"
		
	Если Форма.ДатыПрибытияНаПогрОтличаются Или Форма.ДатыУбытияНаПогрОтличаются Тогда
		Элементы.ГруппаПогрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаПогрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - есть расхождения";
		
		Элементы.ВосклицаниеДатыПогр.Видимость = Истина;
		Элементы.ГруппаПогрузка.Показать();
	Иначе
		Элементы.ГруппаПогрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаПогрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - расхождений нет";
		
		Элементы.ВосклицаниеДатыПогр.Видимость = Ложь;
		Элементы.ГруппаПогрузка.Скрыть();
	КонецЕсли;
	
	// поведение группы "Выгрузка"
	
	Если Форма.ДатыПрибытияНаВыгрОтличаются Или Форма.ДатыУбытияНаВыгрОтличаются Тогда
		Элементы.ГруппаВыгрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаВыгрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - есть расхождения";
		
		Элементы.ВосклицаниеДатыРазг.Видимость = Истина;
		Элементы.ГруппаВыгрузка.Показать();
	Иначе
		Элементы.ГруппаВыгрузка.Заголовок 						= "Даты и время";
		Элементы.ГруппаВыгрузка.ЗаголовокСвернутогоОтображения 	= "Даты и время - расхождений нет";
		
		Элементы.ВосклицаниеДатыРазг.Видимость = Ложь;
		Элементы.ГруппаВыгрузка.Скрыть();
	КонецЕсли;
	
	// поведение группы "ГруппаВодительНаПогрузке"
	
	Если ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр) Или ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр) Тогда
		Элементы.ГруппаВодительНаПогрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодительНаПогрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - есть замечания";
		
		Элементы.ВосклицаниеЗамечанияПогр.Видимость = Истина;
		Элементы.ГруппаВодительНаПогрузке.Показать();
	Иначе
		Элементы.ГруппаВодительНаПогрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодительНаПогрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - замечаний нет";
		
		Элементы.ВосклицаниеЗамечанияПогр.Видимость = Ложь;
		Элементы.ГруппаВодительНаПогрузке.Скрыть();
	КонецЕсли;	
	
	Элементы.ЗамечанияВодителяПогр.Видимость 	= ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.БезЗамечВодитПогр.Видимость 		= Не ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаПогр);
	Элементы.ЗамечанияПеревозчикаПогр.Видимость = ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
	Элементы.БезЗамечПВПогр.Видимость 			= Не ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаПогр);
	
	// поведение группы "ГруппаВодителяНаВыгрузке"
	
	Если ЗначениеЗаполнено(Форма.ЗамечанияВодителяНаВыгр) Или ЗначениеЗаполнено(Форма.ЗамечанияПеревозчикаНаВыгр) Тогда
		Элементы.ГруппаВодителяНаВыгрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодителяНаВыгрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - есть замечания";
		
		Элементы.ВосклицаниеЗамечанияРазг.Видимость = Истина;
		Элементы.ГруппаВодителяНаВыгрузке.Показать();
	Иначе
		Элементы.ГруппаВодителяНаВыгрузке.Заголовок 						= "Водитель и замечания";
		Элементы.ГруппаВодителяНаВыгрузке.ЗаголовокСвернутогоОтображения 	= "Водитель и замечания - замечаний нет";
		
		Элементы.ВосклицаниеЗамечанияРазг.Видимость = Ложь;
		Элементы.ГруппаВодителяНаВыгрузке.Скрыть();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "c-rejected");

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, КодТекущегоСтатусаДокументооборота = "c-rejected");
	
	УправлениеВидимостьюИДоступностью(ЭтаФорма);
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ТрН_Титул5.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура СвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Истина;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьШапку(Команда)

	ШапкаНаОтдельнойЗакладке = Ложь;
	УстановитьПоложениеШапки();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоложениеШапки()

	Если ШапкаНаОтдельнойЗакладке Тогда

		текАктивнаяЗакладка = Элементы.Страницы.ТекущаяСтраница;

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Ложь;
		Элементы.РазвернутьШапку.Видимость = Истина;

		ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
		Если Не ПанельОшибокРазвернута Тогда
			ПанельОшибокСвернутьРазвернутьВызовОМ();
		КонецЕсли;

		Элементы.Страницы.ТекущаяСтраница = текАктивнаяЗакладка;

	Иначе

		ПереместитьШапкуВызовСервера();
		Элементы.СвернутьШапку.Видимость = Истина;
		Элементы.РазвернутьШапку.Видимость = Ложь;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПереместитьШапкуВызовСервера()

	Если ШапкаНаОтдельнойЗакладке Тогда
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаДанные,
															   Элементы.СтраницаШапка);
	Иначе
		КонтурЛогистика_ПанельОшибокСервер.ПереместитьЭлементы(ЭтаФорма,
															   Элементы.ГруппаШапкаДанные,
															   Элементы.ГруппаШапкаМестоположение);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьВызовОМ()

	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокСвернутьРазвернуть(Команда)
	ПанельОшибокСвернутьРазвернутьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПанельОшибокСвернутьРазвернутьНаСервере()
	КонтурЛогистика_ПанельОшибокСервер.ПанельОшибокСвернутьРазвернуть(ЭтаФорма);
КонецПроцедуры

// Обслуживание панели ошибок

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ТумблерЗаполненИД(Элемент)
	
	ОчиститьДанныеДокумента(Объект, "ОснДовОргСост");
			
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Функция ОчиститьДанныеДокумента(ОбъектДокумента, ПостФикс = "") 
	
	ОбъектДокумента["ИдДок" + ПостФикс] = "";
	ОбъектДокумента["НаимДок" + ПостФикс] = "";
	ОбъектДокумента["НомерДок" + ПостФикс] = "";
	ОбъектДокумента["ДатаДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСведДок" + ПостФикс] = "";
	ОбъектДокумента["СтороныСостДок" + ПостФикс] = "";
	ОбъектДокумента["ДопСостДок" + ПостФикс] = "";
		
КонецФункции

&НаКлиенте
Процедура СтоимостьБезНДСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьСНДСПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ЗаполнитьПоказателиРасчетаСумм(ЭтаФорма);
	РассчитатьСуммы(ЭтаФорма);
	
	ПроверитьДокумент();
	УправлениеВидимостьюСумм(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммы(Форма)
	
	Объект = Форма.Объект;
	
	Если Форма.НеРассчитыватьСуммы Тогда 			
		
		Объект.СтоимостьБезНДС 	= Форма.СуммаДляРасчетов;
		Объект.СуммаНДС 		= 0;
		Объект.СтоимостьСНДС 	= 0;
		
	Иначе
		
		Если Форма.НДСВСумме Тогда 
			
			Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10_110") Тогда 
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 10 / 110;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20_120") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 20 / 120;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22_122") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 22 / 122;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5_105") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 5 / 105;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7_107") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 7 / 107;
			КонецЕсли;	
			
			Объект.СтоимостьСНДС 	= Форма.СуммаДляРасчетов;
			Объект.СтоимостьБезНДС 	= Объект.СтоимостьСНДС - Объект.СуммаНДС;
			
		Иначе
			
			Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10") Тогда 
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 10 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 20 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 22 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 5 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 7 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС9_09") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 9.09 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС16_67") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 16.67 / 100;
			ИначеЕсли Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС18_03") Тогда	
				Объект.СуммаНДС = Форма.СуммаДляРасчетов * 18.03 / 100;
			КонецЕсли;
			
			Объект.СтоимостьБезНДС 	= Форма.СуммаДляРасчетов;
			Объект.СтоимостьСНДС 	= Объект.СтоимостьБезНДС + Объект.СуммаНДС;
			
		КонецЕсли;	
		
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюСумм(Форма)

	Элементы = Форма.Элементы;
	
	Если Форма.НеРассчитыватьСуммы Тогда
		
		Элементы.СуммаДляРасчетов.Заголовок = "Сумма без НДС";
		Элементы.СуммаНДС.Заголовок 		= "Сумма НДС";
		
		Элементы.СуммаНДС.Видимость 		= Ложь;
		Элементы.СтоимостьБезНДС.Видимость 	= Ложь;
		Элементы.СтоимостьСНДС.Видимость 	= Ложь;
		
	Иначе
		
		Если Не Форма.НДСВСумме Тогда
			
			Элементы.СуммаДляРасчетов.Заголовок = "Сумма без НДС";
			Элементы.СуммаНДС.Заголовок 		= "Сумма НДС";
			
			Элементы.СтоимостьБезНДС.Видимость 	= Ложь;			
			Элементы.СтоимостьСНДС.Видимость 	= Истина;
			
		Иначе
			
			Элементы.СуммаДляРасчетов.Заголовок = "Сумма с НДС";
			Элементы.СуммаНДС.Заголовок 		= "Сумма НДС (в т.ч.)";
			
			Элементы.СтоимостьБезНДС.Видимость 	= Истина;			
			Элементы.СтоимостьСНДС.Видимость 	= Ложь;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПоказателиРасчетаСумм(Форма)

	Объект = Форма.Объект;
	
	Форма.НеРассчитыватьСуммы = Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС")
							Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС0")
							Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДСИсчисляетсяНалоговымАгентом");
						
	Форма.НДСВСумме = Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС10_110")
					Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС20_120")
					Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС22_122")
					Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС5_105")
					Или Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.НДС7_107");


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуДляРасчета()
	
	Если НеРассчитыватьСуммы Тогда
		
		СуммаДляРасчетов = Объект.СтоимостьБезНДС;
		
	Иначе
		
		Если Не НДСВСумме Тогда
			
			СуммаДляРасчетов = Объект.СтоимостьБезНДС;
			
		Иначе
			
			СуммаДляРасчетов = Объект.СтоимостьСНДС;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
		
	Если Объект.СуммаНДС = 0 Тогда 
		
		Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтавкиНДС.БезНДС");
				
	КонецЕсли;	
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура БИКПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ИдДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НаимДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура НомерДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура СтороныСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДопСостПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ДопСведПриИзменении(Элемент)
	ПроверитьДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ОтметкиПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элементы.Акты.ОтборСтрок 			= Неопределено;
		Элементы.Штрафы.ОтборСтрок 			= Неопределено;
		
	Иначе
		
		Элементы.Акты.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		Элементы.Штрафы.ОтборСтрок 			= Новый ФиксированнаяСтруктура("ИдентификаторСтрокиОтметки", Элемент.ТекущиеДанные.ИдентификаторСтроки);    
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерадресацииИВозвратыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПерадресацииИВозвратыСсылка" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	ИначеЕсли Поле.Имя = "ПерадресацииИВозвратыГрузополучатель" Тогда
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Грузополучатель);
	ИначеЕсли Поле.Имя = "ПерадресацииИВозвратыМестоПрибытия" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.МестоДоставки);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаВодителейТСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаменаВодителейТССсылка" Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.ПоказатьЗначение_КонтурЛогистика(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДляРасчетовПриИзменении(Элемент)
	
	ЗаполнитьПоказателиРасчетаСумм(ЭтаФорма);
	РассчитатьСуммы(ЭтаФорма);
	
	ПроверитьДокумент();
	УправлениеВидимостьюСумм(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры
