////////////////////////////////////////////////////////////////////////////////
// Предоставляет методы с повторным использованием для работы с функциональными 
// опциями.
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает полный набор функциональных опций.
//
// Возвращаемое значение:
//   Соответствие из см. КонтурЛогистика_ФункциональныеОпции.ФункциональныеОпции
//
Функция ФункциональныеОпции() Экспорт
	
	Возврат КонтурЛогистика_ФункциональныеОпции.ФункциональныеОпции();	
	
КонецФункции 

#КонецОбласти