
#Область ПрограммныйИнтерфейс

#Область ПодключаемыеКоманды

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация
	
	// Анкета (Microsoft Word)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АнкетаMicrosoftWord";
	КомандаПечати.Представление = НСтр("ru = 'Анкета (%1 %2)'");
	КомандаПечати.Представление = СтрШаблон(КомандаПечати.Представление, "Microsoft", "Word");
	КомандаПечати.ТребуетсяРасширениеРаботыСФайлами = Истина;
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив Из СправочникСсылка - Ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - Дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - Сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений Из ЭлементСпискаЗначений:
//                                              *Значение - СправочникСсылка - Ссылка на объект;
//                                              *Представление - Строка - Имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - Дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
//++ Локализация
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АнкетаMicrosoftWord") Тогда
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АнкетаMicrosoftWord");
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ИмяМакета = "ПФ_DOC_Анкета" + "_" + ОбщегоНазначения.КодОсновногоЯзыка();
			МакетИДанныеОбъекта = УправлениеПечатью.МакетыИДанныеОбъектовДляПечати("Справочник.КартыЛояльности", 
				ИмяМакета, МассивОбъектов);
			
			ОписаниеШаблонаПредставления = Новый Структура;
			ОписаниеШаблонаПредставления.Вставить("Шаблон", НСтр("ru = 'Анкета карты [Владелец]-[Наименование]'"));
			ОписаниеШаблонаПредставления.Вставить("Реквизиты", "Владелец,Наименование");
			
			ПечатнаяФорма.ОфисныеДокументы = ПечатьАнкетыКартыЛояльностиOpenXMLПоКоллекцииОбъектов(МассивОбъектов, МакетИДанныеОбъекта, ИмяМакета, ОписаниеШаблонаПредставления);
			ПечатнаяФорма.СинонимМакета    = НСтр("ru = 'Анкета карты лояльности'");

		КонецЕсли;
	КонецЕсли;
	
//-- Локализация
	
КонецПроцедуры

//++ Локализация

//-- Локализация

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация
Функция ПечатьАнкетыКартыЛояльностиOpenXMLПоКоллекцииОбъектов(МассивОбъектов, МакетИДанныеОбъекта, ИмяМакета, ОписаниеШаблонаПредставления)
	ОфисныеДокументы = Новый Соответствие;
	
	Шаблон = ОписаниеШаблонаПредставления.Шаблон;
	ЗначенияРеквизитовЭлементов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектов, 
		ОписаниеШаблонаПредставления.Реквизиты);
		
	Для Каждого Ссылка Из МассивОбъектов Цикл
		АдресХранилищаОфисныйДокумент = ПечатьАнкетыКартыЛояльностиOpenXML(Ссылка, МакетИДанныеОбъекта, ИмяМакета);
	
		ИмяДокумента = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ЗначенияРеквизитовЭлементов[Ссылка]);
		ОфисныеДокументы.Вставить(АдресХранилищаОфисныйДокумент, ИмяДокумента);
	КонецЦикла;

	Возврат ОфисныеДокументы;
КонецФункции

//// Формирует печатную форму Анкета карты лояльности с использованием макета
// в формате офисного документа Office Open XML.
//
// Параметры:
//  СправочникСсылка      - ЛюбаяСсылка - объект, по которому требуется сформировать печатную форму.
//  МакетИДанныеОбъекта - Соответствие Из КлючИЗначение - коллекция ссылок на объекты и их данные.
//  ИмяМакета           - Строка - наименование макета для печати.
//
// Возвращаемое значение:
//  Строка - адрес хранилища, куда помещается сформированный файл.
//
Функция ПечатьАнкетыКартыЛояльностиOpenXML(СправочникСсылка, МакетИДанныеОбъекта, ИмяМакета)
	
	АдресХранилищаПечатнойФормы = "";
	
	ДвоичныеДанныеМакетов	= МакетИДанныеОбъекта.Макеты.ДвоичныеДанныеМакетов;
	Секции					= МакетИДанныеОбъекта.Макеты.ОписаниеСекций;
	ДанныеОбъекта = МакетИДанныеОбъекта.Данные[СправочникСсылка][ИмяМакета];
	
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(ДвоичныеДанныеМакетов[ИмяМакета], "");
	Если Макет = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму("",,Макет);
		Если ПечатнаяФорма = Неопределено Тогда
			УправлениеПечатью.ОчиститьСсылки(Макет);
			Возврат "";
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет,Секции[ИмяМакета]["Заголовок"]);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		Если ДанныеОбъекта.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Штриховая")
			ИЛИ ДанныеОбъекта.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Смешанная") Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет,Секции[ИмяМакета].Штрихкод);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		КонецЕсли;
		
		Если ДанныеОбъекта.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Магнитная")
			ИЛИ ДанныеОбъекта.ТипКарты = ПредопределенноеЗначение("Перечисление.ТипыКарт.Смешанная") Тогда
			Область = УправлениеПечатью.ОбластьМакета(Макет,Секции[ИмяМакета].МагнитныйКод);
			УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		КонецЕсли;
		
		Область = УправлениеПечатью.ОбластьМакета(Макет,Секции[ИмяМакета].Подвал);
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
		
	Исключение
		
		АдресХранилищаПечатнойФормы = "";
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
	УправлениеПечатью.ОчиститьСсылки(Макет);

	Возврат АдресХранилищаПечатнойФормы;
	
КонецФункции

//-- Локализация

#КонецОбласти