#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	//++ Локализация
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуетсяОбменСБанками = Константы.ИспользоватьОбменСБанками.Получить();
	ИспользуютсяПисьма = Константы.ПисьмаОбменСБанками.Получить();
	ИспользуютсяДепозиты = Константы.ИспользоватьДепозитыОбменСБанками.Получить();
	Если ИспользуетсяОбменСБанками И Не ИспользуютсяПисьма И ОбменСБанкамиСлужебный.ЕстьПоддержкаПисем() Тогда
		Константы.ПисьмаОбменСБанками.Установить(Истина);
	ИначеЕсли НЕ ИспользуетсяОбменСБанками И ИспользуютсяПисьма Тогда
		Константы.ПисьмаОбменСБанками.Установить(Ложь);
	КонецЕсли;
	Если ИспользуетсяОбменСБанками И Не ИспользуютсяДепозиты
		И ОбменСБанкамиДепозитыСлужебный.ЕстьПоддержкаДепозитов() Тогда
		Константы.ИспользоватьДепозитыОбменСБанками.Установить(Истина);
	ИначеЕсли Не ИспользуетсяОбменСБанками И ИспользуютсяДепозиты Тогда
		Константы.ИспользоватьДепозитыОбменСБанками.Установить(Ложь);
	КонецЕсли;
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли