&НаКлиенте
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте
Перем ПараметрыОбработки,
	СтруктураРезультата;


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВидОбработки = "" Тогда
		ВидОбработки = "ИнтеграционнаяОбработка";
	КонецЕсли;
		
	Если ТипОбработки = "" Тогда
		ТипОбработки = "ФайлНаДиске";
	КонецЕсли;

	ПутьКФайлу = ?(ТипОбработки="ФайлНаДиске",ПутьКОбработке,"");
	СсылкаНаЭлемент = ?(ТипОбработки="СправочникСсылка",ПутьКОбработке,Неопределено);

	ЗаполнитьСписокВыбораТипаОбработки();
	ЗаполнитьСписокВыбораОбработок();
	ОбновитьВидимостьЭлементов();
	
	Обработка = ?(ТипОбработки="Встроенная",ПутьКОбработке,Неопределено);
	
	Если ВидОбработки = "ОсновнаяОбработка" Тогда
		ЭтаФорма.Заголовок = НСтр("be = 'Форма выбару асноўнай апрацоўкі'; en = 'Form for selecting main processing'; es = 'Forma de selección de procesamiento principal'; ka = 'ძირითადი პროცესის არჩევადაში ფორმა'; kk = 'Негізгі өңдеуді таңдау пішімі'; ro = 'Formular de selectare a procesului principal'; ru = 'Форма выбора основной обработки'; tr = 'Ana işlem seçim formu'; uk = 'Форма вибору основної обробки'; uz = 'Asosiy obrabotkani tanlash shakli'");
		ЗаполнитьВерсиюОсновнойОбработки();
	Иначе
		ЭтаФорма.Заголовок = НСтр("be = 'Форма выбару інтэграцыйнай апрацоўкі'; en = 'Form for selecting integration processing'; es = 'Forma de selección de procesamiento de integración'; ka = 'ინტეგრაციონალური პროცესის არჩევადაში ფორმა'; kk = 'Интеграциялық өңдеуді таңдау пішімі'; ro = 'Formular de selectare a procesului de integrare'; ru = 'Форма выбора интеграционной обработки'; tr = 'Entegrasyon işlemi seçim formu'; uk = 'Форма вибору інтеграційної обробки'; uz = 'Integratsion obrabotkani tanlash shakli'");
	КонецЕсли;

	#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
		ОбновитьОтображениеДанных();
	#КонецЕсли
	
	//Клеверенс Автотестирование. Текст проверки должен быть последним!
	Если АвтоТестОткрытияФормы и ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
		РезОткрытия = Новый Структура;
		РезОткрытия.Вставить("ВремяЗакрытия",ТекущаяУниверсальнаяДатаВМиллисекундах());
		#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
        	РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.ИмяФормы);
		#Иначе	
			РезОткрытия.Вставить("ИмяФормы",ЭтаФорма.Заголовок);
		#КонецЕсли
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, РезОткрытия);
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ОписаниеОповещенияОЗакрытии <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии,СтруктураРезультата);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовСобытийФормы

&НаКлиенте
Процедура Подтвердить(Команда)
	Если ЭтаФорма.Модифицированность = Ложь Тогда
		Закрыть();
	ИначеЕсли ВидОбработки = "ОсновнаяОбработка" Тогда
				
		СтруктураРезультата = ПолучитьСтруктуруРезультата();
		
		Закрыть(СтруктураРезультата);
	Иначе
		Если ИнтеграционнаяОбработкаПодключена = Истина Тогда
			Если ИнформацияСовместимостиПолучена Тогда
				СтруктураРезультата = ПолучитьСтруктуруРезультата();
				Закрыть(СтруктураРезультата);
			Иначе
				ОповещениеВопросОшибкаПолученияИнформацииЗавершение = Новый ОписаниеОповещения("ВопросОшибкаПолученияинформацииЗавершение", ЭтаФорма);
				ТекстВопроса = НСтр("be = 'Інтэграцыйная апрацоўка падключана, але не атрымана інфармацыя сумяснасці. Захаваць?'; en = 'Integration processing connected, but compatibility information not received. Save?'; es = 'El proceso de integración está conectado, pero no se ha recibido información de compatibilidad. ¿Guardar?'; ka = 'ინტეგრაციის პროცესი დაკავშირებულია, მაგრამ სიმპატიის ინფორმაცია არ მიიღო. შენახვა?'; kk = 'Интеграциялық өңдеу қосылды, бірақ сәйкестік ақпараттары алынбады. Сақтау керек пе?'; ro = 'Procesul de integrare este conectat, dar nu s-a primit informația de compatibilitate. Salvați?'; ru = 'Интеграционная обработка подключена, но не получена информация совместимости. Сохранить?'; tr = 'Entegrasyon İşlemi Bağlı, ancak Uyum Bilgisi Alınamadı. Kaydedilsin mi?'; uk = 'Інтеграційна обробка підключена, але не отримана інформація про сумісність. Зберегти?'; uz = ""Integratsion jarayon ulangan, lekin moslik ma'lumoti olinmadi. Saqlansinmi?""");
				ПоказатьВопрос(ОповещениеВопросОшибкаПолученияИнформацииЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
			КонецЕсли;
		Иначе
			ОповещениеВопросОшибкаПодключенияЗавершение = Новый ОписаниеОповещения("ВопросОшибкаПодключенияЗавершение", ЭтаФорма);
			ТекстВопроса = НСтр("be = 'Інтэграцыйная апрацоўка не падключана. Закрыць форму?'; en = 'Integration processing not connected. Close the form?'; es = 'El proceso de integración no está conectado. ¿Cerrar formulario?'; ka = 'ინტეგრაციის პროცესი არ არის დაკავშირებული. დახურვა ფორმა?'; kk = 'Интеграциялық өңдеу қосылмаған. Пішімді жабу керек пе?'; ro = 'Procesul de integrare nu este conectat. Închideți formularul?'; ru = 'Интеграционная обработка не подключена. Закрыть форму?'; tr = 'Entegrasyon İşlemi Bağlı Değil. Formu Kapatılsın mı?'; uk = 'Інтеграційна обробка не підключена. Закрити форму?'; uz = 'Integratsion jarayon ulanmagan. Shu sahifani yopish?'");
			ПоказатьВопрос(ОповещениеВопросОшибкаПодключенияЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруРезультата()
	СтруктураРезультата = Новый Структура();
	СтруктураРезультата.Вставить("ВерсияОбработки", ВерсияОбработки);
	СтруктураРезультата.Вставить("КонфигурацияИнтеграции", КонфигурацияИнтеграции);
	СтруктураРезультата.Вставить("ПоддерживаемыеВерсии", ПоддерживаемыеВерсии);
	СтруктураРезультата.Вставить("ТипОбработки", ТипОбработки);

	Если ТипОбработки = "ФайлНаДиске" Тогда
		СтруктураРезультата.Вставить("ПутьКОбработке", ПутьКФайлу);
	ИначеЕсли ТипОбработки = "СправочникСсылка" Тогда
		СтруктураРезультата.Вставить("ПутьКОбработке", СсылкаНаЭлемент);
	ИначеЕсли ТипОбработки = "Встроенная" Тогда
		СтруктураРезультата.Вставить("ПутьКОбработке", СсылкаНаЭлемент);	
	Иначе
		СтруктураРезультата.Вставить("ПутьКОбработке", ПутьКОбработке);	
	КонецЕсли;
	
	Если ПараметрыОбработки <> Неопределено Тогда
		Если ПараметрыОбработки.Свойство("ИмяОбработки") Тогда
			Если ВидОбработки = "ОсновнаяОбработка" Тогда
				СтруктураРезультата.Вставить("ИмяОбработки", ПараметрыОбработки.ИмяОбработки);
			Иначе
				СтруктураРезультата.Вставить("ИмяИнтеграционнойОбработки", ПараметрыОбработки.ИмяОбработки);
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыОбработки.Свойство("ПутьОбработки") Тогда
			Если ВидОбработки = "ОсновнаяОбработка" Тогда
				СтруктураРезультата.Вставить("ПутьОбработки", ПараметрыОбработки.ПутьОбработки);
			Иначе
				СтруктураРезультата.Вставить("ПутьИнтеграционнойОбработки", ПараметрыОбработки.ПутьОбработки);
			КонецЕсли;			
		КонецЕсли;
		Если ПараметрыОбработки.Свойство("РабочийКаталог") Тогда
			СтруктураРезультата.Вставить("РабочийКаталог", ПараметрыОбработки.РабочийКаталог);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
КонецФункции

&НаКлиенте
Процедура ТипОбработкиПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
	ИнтеграционнаяОбработкаПодключена = Ложь;
	ПутьКОбработке = Неопределено;
	
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаЭлементПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда 
		ПараметрыОбработки = Новый Структура("ИмяОбработки, ПутьОбработки, ТипОбработки", Строка(СсылкаНаЭлемент), СсылкаНаЭлемент, ТипОбработки); 
		
		ПодключитьИВывестиИнформацию(ПараметрыОбработки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("be = 'Выбар файла'; en = 'Select file'; es = 'Seleccionar archivo'; ka = 'ფაილის არჩევა'; kk = 'Файлды таңдау'; ro = 'Alegeți fișierul'; ru = 'Выбор файла'; tr = 'Dosya seç'; uk = 'Вибір файлу'; uz = 'Faylni tanlash'");
	Диалог.Фильтр = НСтр("be = 'Знешнія апрацоўкі 1С'; en = 'External 1C processing'; es = 'Procesamientos externos de 1C'; ka = '1C-ის გარე დამუშავებები'; kk = '1С сыртқы өңдеулері'; ro = 'Procesele externe 1C'; ru = 'Внешние обработки 1С'; tr = '1C dış işlemleri'; uk = 'Зовнішні обробки 1С'; uz = '1С ташқи обработкалари'")
			+ " (*.epf)|*.epf";
	Диалог.ИндексФильтра = 0;
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПроверятьСуществованиеФайла = Истина;
	Диалог.МножественныйВыбор = Ложь;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма, Диалог);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, Диалог) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() Тогда
		ЭтаФорма.Модифицированность = Истина;
		ВыбранныйКаталог = Диалог.Каталог;
		ПолныйПуть = Диалог.ПолноеИмяФайла;
		ИмяФайла = СтрЗаменить(ПолныйПуть, ВыбранныйКаталог, "");
		ПараметрыОбработки = Новый Структура("ИмяОбработки, ПутьОбработки, ТипОбработки", ИмяФайла, ВыбранныйКаталог, ТипОбработки);
		
		ПодключитьИВывестиИнформацию(ПараметрыОбработки);
		
		ПутьКФайлу = ПолныйПуть;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
	Если ЗначениеЗаполнено(Обработка) Тогда 
		ПараметрыОбработки = Новый Структура("ИмяОбработки, ПутьОбработки, ТипОбработки", Строка(Обработка), Обработка, ТипОбработки); 
		
		ПодключитьИВывестиИнформацию(ПараметрыОбработки);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИВывестиИнформацию(ПараметрыОбработки)
	
	Если ВидОбработки = "ОсновнаяОбработка" Тогда
		// Получение версии обработки
		ЗаполнитьВерсиюОсновнойОбработки();
		Возврат;
	Иначе
		// Для ИО необходимо чтобы структура содержала ключи: ИмяИнтеграционнойОбработки, ПутьИнтеграционнойОбработки
		// т.к. в процедурах подключения ИО есть обращения по этим ключам
		ПараметрыОбработки.Вставить("ИмяИнтеграционнойОбработки", ПараметрыОбработки.ИмяОбработки);
		ПараметрыОбработки.Вставить("ПутьИнтеграционнойОбработки", ПараметрыОбработки.ПутьОбработки);
	КонецЕсли;
	
	РезультатПодключения = _ЛокКонтекст.ЛокЯдро_ПодключитьИнтеграционнуюОбработку("НаКлиенте", ПараметрыОбработки);
	
	Если РезультатПодключения = Истина Тогда
		ПолучитьИнформациюСовместимостиОбработкиСервер(_ЛокКонтекст._ИнтеграционнаяОбработкаАдрес);
	Иначе
		//Сообщить("Ошибка подключения: "+РезультатПодключения);
		ВерсияОбработки = "Ошибка подключения интеграционной обработки";
		КонфигурацияИнтеграции = "";
		ПоддерживаемыеВерсии = "";
		ИнтеграционнаяОбработкаПодключена = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

// Вызывает методы интеграционной обработки на стороне сервера
// 
// Параметры:
// 	_ИнтеграционнаяОбработкаАдрес - Строка - Адрес временного хранилища с обработкой
// Возвращаемое значение:
// 	Структура - Информация совместимости
&НаСервере
Функция ПолучитьИнформациюСовместимостиОбработкиСервер(_ИнтеграционнаяОбработкаАдрес)
	Если ЭтоАдресВременногоХранилища(_ИнтеграционнаяОбработкаАдрес) Тогда
		СтруктураОбработки = ПолучитьИзВременногоХранилища(_ИнтеграционнаяОбработкаАдрес);
		
		Если (ТипЗнч(СтруктураОбработки) = Тип("Структура") Или ТипЗнч(СтруктураОбработки) = Тип("ФиксированнаяСтруктура")) 
			И СтруктураОбработки.Свойство("ИнтеграционнаяОбработка")
			И СтруктураОбработки.ИнтеграционнаяОбработка <> Неопределено Тогда
			
			Попытка
				ИнформацияСовместимости = СтруктураОбработки.ИнтеграционнаяОбработка.ИнформацияСовместимости();
				ИнформацияСовместимости.Вставить("ПутьКФайлу",СтруктураОбработки.ПутьКФайлу);
				ВерсияОбработки = "API: v"+Строка(ИнформацияСовместимости.ВерсияAPI)+", "+ИнформацияСовместимости.ВерсияИнтеграции;
				КонфигурацияИнтеграции = ИнформацияСовместимости.ПоддерживаемаяКонфигурацияСиноним;
				ПоддерживаемыеВерсии = ИнформацияСовместимости.ПоддерживаемыеВерсииКонфигурации;
				ИнформацияСовместимостиПолучена = Истина;
			Исключение
				ИнформацияСовместимостиПолучена = Ложь;
			КонецПопытки;
			
		Иначе
			ИнформацияСовместимостиПолучена = Ложь;			
		КонецЕсли;
		
		Если ИнформацияСовместимостиПолучена = Ложь Тогда
			ВерсияОбработки = "Не удалось получить информацию совместимости";
			КонфигурацияИнтеграции = "";
			ПоддерживаемыеВерсии = "";
		КонецЕсли;
		
		ИнтеграционнаяОбработкаПодключена = Истина;
	Иначе
		ВерсияОбработки = "Ошибка подключения интеграционной обработки";
		КонфигурацияИнтеграции = "";
		ПоддерживаемыеВерсии = "";
		ИнтеграционнаяОбработкаПодключена = Ложь;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	Возврат ИнформацияСовместимости;
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	Если ВидОбработки = "ОсновнаяОбработка" Тогда
		Элементы.КонфигурацияИнтеграции.Видимость 	= Ложь;
		Элементы.ПоддерживаемыеВерсии.Видимость 	= Ложь;
	Иначе
		Элементы.КонфигурацияИнтеграции.Видимость 	= Истина;
		Элементы.ПоддерживаемыеВерсии.Видимость 	= Истина;
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипОбработки = "ФайлНаДиске" Тогда
			Элементы.ПанельОбработка.Страницы.СтраницаПутьКФайлу.Видимость = Истина;
			Элементы.ПанельОбработка.Страницы.СтраницаСсылкаНаЭлемент.Видимость = Ложь;
			Элементы.ПанельОбработка.Страницы.СтраницаОбработка.Видимость = Ложь;
		ИначеЕсли ТипОбработки = "СправочникСсылка" Тогда
			Элементы.ПанельОбработка.Страницы.СтраницаПутьКФайлу.Видимость = Ложь;
			Элементы.ПанельОбработка.Страницы.СтраницаСсылкаНаЭлемент.Видимость = Истина;
			Элементы.ПанельОбработка.Страницы.СтраницаОбработка.Видимость = Ложь;
		ИначеЕсли ТипОбработки = "Встроенная" Тогда
			Элементы.ПанельОбработка.Страницы.СтраницаПутьКФайлу.Видимость = Ложь;
			Элементы.ПанельОбработка.Страницы.СтраницаСсылкаНаЭлемент.Видимость = Ложь;
			Элементы.ПанельОбработка.Страницы.СтраницаОбработка.Видимость = Истина;
		КонецЕсли;
		Если ВидОбработки <> "ОсновнаяОбработка" Тогда
			Элементы.ТипОбработки.Кнопки.ФайлНаДиске.Пометка = ТипОбработки = "ФайлНаДиске";
		КонецЕсли;
		Элементы.ТипОбработки.Кнопки.СправочникСсылка.Пометка = ТипОбработки = "СправочникСсылка";
		Элементы.ТипОбработки.Кнопки.Встроенная.Пометка = ТипОбработки = "Встроенная";
	#Иначе	
		Если ТипОбработки = "ФайлНаДиске" Тогда
			Элементы.ПутьКФайлу.Видимость = Истина;
			Элементы.СсылкаНаЭлемент.Видимость = Ложь;
			Элементы.Обработка.Видимость = Ложь;
		ИначеЕсли ТипОбработки = "СправочникСсылка" Тогда
			Элементы.ПутьКФайлу.Видимость = Ложь;
			Элементы.СсылкаНаЭлемент.Видимость = Истина;
			Элементы.Обработка.Видимость = Ложь;
		ИначеЕсли ТипОбработки = "Встроенная" Тогда
			Элементы.ПутьКФайлу.Видимость = Ложь;
			Элементы.СсылкаНаЭлемент.Видимость = Ложь;
			Элементы.Обработка.Видимость = Истина;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбработок()
	
	СписокВсехОбработок = Метаданные.Обработки;
	Для Каждого Элем Из СписокВсехОбработок Цикл
		Элементы.Обработка.СписокВыбора.Добавить(Элем.Имя,Элем.Синоним);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВерсиюОсновнойОбработки()
	
	Версия = "";
	
	Если ТипОбработки = "СправочникСсылка" Тогда
		// Не подключаем ОО по ссылке, т.к. это привести к ошибке "Неизвестный идентификатр формы"
		Попытка
			Версия = СсылкаНаЭлемент.Версия;
		Исключение
		КонецПопытки;
	ИначеЕсли ТипОбработки = "Встроенная" Тогда
		Попытка
			Версия = Обработки[Обработка].Создать().СведенияОВнешнейОбработке().Версия;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ВерсияОбработки =  Версия;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораТипаОбработки()

	СписокЗначенийВыбора = ПолучитьСписокЗначенийВыбораТипаОбработки();
	
	Если ВидОбработки = "ОсновнаяОбработка" Тогда
		// Для основной обработки не доступен вариант "Файл на диске"
		ЗначениеВыбора_ФайлНаДиске = СписокЗначенийВыбора.НайтиПоЗначению("ФайлНаДиске");
		Если ЗначениеВыбора_ФайлНаДиске <> Неопределено Тогда
			СписокЗначенийВыбора.Удалить(ЗначениеВыбора_ФайлНаДиске);
		КонецЕсли;
		#Область СовместимыйКодFresh
		//// Во фреше для основной обработки не доступен вариант "СправочникСсылка"
		//ЗначениеВыбора_СправочникСсылка = СписокЗначенийВыбора.НайтиПоЗначению("СправочникСсылка");
		//Если ЗначениеВыбора_СправочникСсылка <> Неопределено Тогда
		//	СписокЗначенийВыбора.Удалить(ЗначениеВыбора_СправочникСсылка);
		//КонецЕсли;
		#КонецОбласти //СовместимыйКодFresh
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		КнопкиВыбора = Элементы.ТипОбработки.Кнопки;
		
		КнопкиВыбора.Очистить();
		
		Для каждого ЗначениеВыбора Из СписокЗначенийВыбора Цикл
			
			КнопкиВыбора.Добавить(ЗначениеВыбора.Значение, ТипКнопкиКоманднойПанели.Действие, ЗначениеВыбора.Представление, Новый Действие("ТипОбработки" + ЗначениеВыбора.Значение));
			
		КонецЦикла;
	#Иначе
		СписокВыбора = Элементы.ТипОбработки.СписокВыбора;
		
		// В веб-клиенте не отображается поле переключателя, если в него не добавлен хотя бы один элемент не программно
		СписокВыбора.Очистить();
				
		Для каждого ЗначениеВыбора Из СписокЗначенийВыбора Цикл
			
			ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), ЗначениеВыбора);
			
		КонецЦикла;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокЗначенийВыбораТипаОбработки()

	СписокЗначенийВыбора = Новый СписокЗначений;
	
	СписокЗначенийВыбора.Добавить("ФайлНаДиске", 
		НСтр("be = 'Файл на дыску'; en = 'File on disk'; es = 'Archivo en disco'; ka = 'ფაილი დისკზე'; kk = 'Дисктеғі файл'; ro = 'Fișier pe disc'; ru = 'Файл на диске'; tr = 'Diskteki dosya'; uk = 'Файл на диску'; uz = 'Diskdagi fayl'")
	);
	СписокЗначенийВыбора.Добавить("СправочникСсылка", 
		НСтр("be = 'Элемент даведніка'; en = 'Directory item'; es = 'Elemento de directorio'; ka = 'რეფერენსის ელემენტი'; kk = 'Көмекшік элементі'; ro = 'Element de dicționar'; ru = 'Элемент справочника'; tr = 'Rehber öğesi'; uk = 'Елемент довідника'; uz = ""Ma'lumotnoma elementi""")
	);
	СписокЗначенийВыбора.Добавить("Встроенная", 
		НСтр("be = 'Убудаваны'; en = 'Built-in'; es = 'Incorporado'; ka = 'ჩაშენებული'; kk = 'Жергілікті'; ro = 'Încorporat'; ru = 'Встроенная'; tr = 'Gömülü'; uk = 'Вбудована'; uz = 'Ichki'")
	);
	
	Возврат СписокЗначенийВыбора;

КонецФункции

#КонецОбласти

#Область ОписанияОповещений

&НаКлиенте
Процедура ВопросОшибкаПодключенияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВопросОшибкаПолученияинформацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СтруктураРезультата = ПолучитьСтруктуруРезультата();
		Закрыть(СтруктураРезультата);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Закрыть();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТипОбработкиФайлНаДиске(Кнопка)
	ТипОбработки = "ФайлНаДиске";
	ТипОбработкиПриИзменении("");
КонецПроцедуры

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	Процедура ТипОбработкиСправочникСсылка(Кнопка)
		ТипОбработки = "СправочникСсылка";
		ТипОбработкиПриИзменении("");
	КонецПроцедуры

	Процедура ТипОбработкиВстроенная(Кнопка)
		ТипОбработки = "Встроенная";
		ТипОбработкиПриИзменении("");
	КонецПроцедуры
	
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = ЭлементыФормы;
	Объект = ЭтотОбъект;
#КонецЕсли