#Область ПрограммныйИнтерфейс

#Область ДлительныеОперации

// Подготавливает сообщения к передаче в сервис ИСМП.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - Структура со свойствами:
//   * Организация - ОпределяемыйТип.Организация - Организация
//   * Интервал - Структура - Структура со свойствами:
//     ** НачалоПериода - Дата - Дата начала периода.
//     ** КонецПериода - Дата - Дата окончания периода.
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы.
// 
// Возвращаемое значение:
//  Структура - см. функцию ПодготовитьСообщенияКПередаче().
//
Функция ЗагрузитьВходящиеДокументы(ПараметрыЗагрузки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыОбмена = ОбменДаннымиИСМП.ПараметрыОбмена(ПараметрыЗагрузки.Организация, УникальныйИдентификатор);
	
	Если УникальныйИдентификатор <> Неопределено И Не ОбщегоНазначенияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		ВозвращаемоеЗначение.Вставить("МОДКПроверкеРегистрации",        Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка входящих документов из ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ПараметрыЗагрузки", ПараметрыЗагрузки);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",   ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС", ОбменДаннымиИСМП.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыУниверсально(ПараметрыЗагрузки, ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Запуск в фоне расчета проблем
// 
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапуститьРасчетПроблем(УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Расчет проблем'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияИСМП.ВыполнитьРасчетПроблем",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиУчета

// Возвращает дату обязательной маркировки маркируемой продукци переданного вида.
// 
// Параметры:
//  ВидМаркируемойПродукции - СправочникСсылка.ВидыПродукцииИС - вид маркируемой продукции
// Возвращаемое значение:
// 	Дата - дата обязательной маркировки маркируемой продукции.
//
Функция ДатаОбязательнойМаркировкиПродукции(ВидМаркируемойПродукции) Экспорт
	
	ДатаОбязательнойМаркировки = '00010101';
	ДатаНачалаПроизводства = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПроизводства(ВидМаркируемойПродукции);
	Если ЗначениеЗаполнено(ДатаНачалаПроизводства) Тогда
		ДатаОбязательнойМаркировки = ДатаНачалаПроизводства;
	КонецЕсли;
	
	Возврат ДатаОбязательнойМаркировки;

КонецФункции

// Возвращает виды продукции, по которым доступно заполнение документа ИСМП
//
// Параметры:
//   ПолноеИмяДокумента - Строка - создаваемый вводом на основании документ
//   Ссылка - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ по которому происходит обработка заполнения
//
// Возвращаемое значение:
//   Массив Из СправочникСсылка.ТоварныеГруппыГИСМТ - различные товарные в документе ИСМП, заполненном 
//     по основанию без фильтра.
Функция ТоварныеГруппыДанныхЗаполнения(ПолноеИмяДокумента, Ссылка) Экспорт
	
	ДоступныеВидыПродукции = Новый Массив;
	
	Если НЕ ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	ВидыПродукцииИСМП = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Истина);
	Для Каждого ВидПродукцииИСМП Из ВидыПродукцииИСМП Цикл
		Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(ВидПродукцииИСМП) Тогда
			ДоступныеВидыПродукции.Добавить(ВидПродукцииИСМП);
		КонецЕсли;
	КонецЦикла;
	
	ДоступныеТоварныеГруппы = КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
		Справочники.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ, ДоступныеВидыПродукции);
	Если ДоступныеТоварныеГруппы.Количество() < 2 Тогда
		Возврат ДоступныеТоварныеГруппы;
	КонецЕсли;
	
	ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
	Предзаполнение = Документы[ИмяДокумента].СоздатьДокумент();
	Если Предзаполнение.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	Предзаполнение.Заполнить(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.МаркировкаТоваровИСМП")
		И ИнтеграцияИС.ЕстьРеквизитТабЧастиОбъекта("GTIN", Предзаполнение.Метаданные(), "Товары")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Операция") = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура, GTIN");
		ПараметрыЗаполненияПоКодамОстатков = Новый Структура;
		ПараметрыЗаполненияПоКодамОстатков.Вставить("Организация", Предзаполнение.Организация);
	Иначе
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура");
		Товары.Колонки.Добавить("GTIN", Метаданные.ОпределяемыеТипы.GTIN.Тип);
		ПараметрыЗаполненияПоКодамОстатков = Неопределено;
	КонецЕсли;
	
	Товары.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	ДоступныеТоварныеГруппы = ИнтеграцияИСМП.ТоварныеГруппыПоТаблицеНоменклатуры(Товары, ПараметрыЗаполненияПоКодамОстатков);
	
	Возврат ДоступныеТоварныеГруппы;
	
КонецФункции

// см. ОбщегоНазначенияИС.ОписаниеНоменклатуры
Функция ОписаниеНоменклатуры(Номенклатура) Экспорт
	Возврат ОбщегоНазначенияИС.ОписаниеНоменклатуры(Номенклатура);
КонецФункции

#КонецОбласти

// Функция - Документы ИСМП по документу основанию
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание по которому надо получить документы ИСМП
// 
// Возвращаемое значение:
//  см. ИнтеграцияИС.ДокументыИСПоДокументуОснованию
//
Функция ДокументыИСМППоДокументуОснованию(ДокументОснование) Экспорт
	
	ДокументыИСМП = ИнтеграцияИС.ДокументыИСПоДокументуОснованию(
		ДокументОснование,
		Метаданные.РегистрыСведений.СтатусыДокументовИСМП);
	
	Возврат ДокументыИСМП;
	
КонецФункции

// Возвращает имена документов ИСМП, основанием для которых может являться указанный документ.
//
// Параметры:
//   ДокументОснование - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ-основание для документа ИСМП
//
// Возвращаемое значение:
//   Массив из Строка - имена документов ИСМП
//
Функция ИменаДокументовДляДокументаОснования(ДокументОснование) Экспорт
	
	Возврат РасчетСтатусовОформленияИСМП.ИменаДокументовДляДокументаОснования(ДокументОснование);
	
КонецФункции

// см. РегистрыСведений.СтатусыОформленияДокументовИСМП.АрхивироватьРаспоряженияКОформлению
Функция АрхивироватьРаспоряженияКОформлению(Основания, Документ) Экспорт
	
	Возврат РегистрыСведений.СтатусыОформленияДокументовИСМП.АрхивироватьРаспоряженияКОформлению(Основания, Документ);
	
КонецФункции

// Заполняет форматированную строку (связи с документами ИСМП) для формы прикладного документа со статусом оформления ИСМП
//
// Параметры:
//   ДокументОснование - ДокументСсылка - ссылка на прикладной документ
//
// Возвращаемое значение:
//  Структура:
//  * ТекстНадписи - ФорматированнаяСтрока, Строка - описание доступных действий ИСМП
//  * ДанныеОписания - Массив из см. ИнтеграцияИСМП.ОписаниеОформленныхДокументовИСМП
Функция ДанныеПоляИнтеграцииВФормеДокументаОснования(Знач ДокументОснование) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстНадписи",   "");
	ВозвращаемоеЗначение.Вставить("ДанныеОписания", Новый Массив);
	
	// Получим структуру вида ИмяДокументаИСМП - Статус
	СтатусыОформления = РегистрыСведений.СтатусыОформленияДокументовИСМП.СтатусыДокументовИСМППоДокументуОснованию(ДокументОснование);
	
	Если НЕ ЗначениеЗаполнено(СтатусыОформления) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	// Получим структуру вида ИмяДокументаИСМП - Массив(ДокументыИСМПДанногоВида)
	ДокументыИСМП = ДокументыИСМППоДокументуОснованию(ДокументОснование);
	
	ТекстыНадписиПоДокументам = Новый Массив;
	
	Для Каждого КлючИЗначение Из СтатусыОформления Цикл
		
		МетаданныеДокумента = Метаданные.Документы[КлючИЗначение.Ключ];
		
		Если ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(МетаданныеДокумента).Тип.СодержитТип(ТипЗнч(ДокументОснование)) Тогда
			
			// Получим структуру с ключами "Представление, МассивДокументов, СтатусОформления, МетаданныеДокумента"
			Описание = ИнтеграцияИСМП.ОписаниеОформленныхДокументов(МетаданныеДокумента, ДокументОснование, ДокументыИСМП, СтатусыОформления);
			
			Если Описание = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекстыНадписиПоДокументам.Количество() > 0 Тогда
				ТекстыНадписиПоДокументам.Добавить(", ");
			КонецЕсли;
			
			ТекстыНадписиПоДокументам.Добавить(Описание.ТекстНадписи);
			
			Описание.Удалить("МетаданныеДокумента");
			ВозвращаемоеЗначение.ДанныеОписания.Добавить(Описание);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВозвращаемоеЗначение.ТекстНадписи = Новый ФорматированнаяСтрока(ТекстыНадписиПоДокументам);
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ИнформацияСертификатовНоменклатуры(СписокНоменклатуры) Экспорт
	
	СертификатыНоменклатуры = Новый Соответствие;
	ИнтеграцияИСПереопределяемый.ПриЗаполненииСертификатовНоменклатуры(СписокНоменклатуры, СертификатыНоменклатуры);
	
	Возврат СертификатыНоменклатуры;
	
КонецФункции

Функция ТребуетсяПерейтиВПул(Знач ДокументОснование) Экспорт
	
	Возврат Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ТребуетсяПерейтиВПул(ДокументОснование);
	
КонецФункции

// Возвращает шаблоны кодов маркировки СУЗ по видам продукции ИС и типам кодов маркировки.
// 
// Возвращаемое значение:
//  см. Справочники.ШаблоныКодовМаркировкиСУЗ.ШаблоныКодовМаркировки
//
Функция ШаблоныКодовМаркировки() Экспорт
	
	Возврат Справочники.ШаблоныКодовМаркировкиСУЗ.ШаблоныКодовМаркировки();
	
КонецФункции

Функция ЭлектронныйДокументПоОбъектуУчета(ОбъектыУчета) Экспорт
	
	Результат = Новый Соответствие();
	
	Если ТипЗнч(ОбъектыУчета) = Тип("Массив") Тогда
		Источник = ОбъектыУчета;
	Иначе
		Источник = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;
	
	Для Каждого ОбъектУчета Из Источник Цикл
		Если ЗначениеЗаполнено(ОбъектУчета) Тогда
			Результат.Вставить(
				ОбъектУчета,
				ОбменСКонтрагентами.СтатусДокументооборота(ОбъектУчета).ЭлектронныйДокумент);
		Иначе
			Результат.Вставить(
				ОбъектУчета,
				Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает данные по электронному документу и результатам проверки ГИС МТ
//  для определения возможности формирования разрешения на отгрузку ГИС МТ.
// 
// Параметры:
//  ОбъектыУчета - ДокументСсылка, Массив из ДокументСсылка - ссылки на проверяемые документы.
//  ЭлектронныеДокументы - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО, Массив из ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - массив электронных документов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//		* Ключ - ДокументСсылка - ссылка на проверяемый документ
//		* Значение - Структура из КлючИЗначение:
//			** ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументИсходящийЭДО,
//                                   ДокументСсылка.ЭлектронныйДокументВходящийЭДО,
//                                   Неопределено - ссылка на электронный документ. Если в
//                                          параметре "Документ" передан учетный документ, возвращается актуальный
//                                          для него электронный. Если передан электронный - возвращается та же ссылка.
//			** РезультатПроверкиГИСМТ - см. ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния.
//
Функция ДанныеЭлектронногоДокументаИСостоянияПоОбъектуУчета(ОбъектыУчета, ЭлектронныеДокументы = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие();
	
	Если ТипЗнч(ОбъектыУчета) = Тип("Массив") Тогда
		Источник = ОбъектыУчета;
	Иначе
		Источник = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;
	
	МассивИдентификаторовЭД = Новый Массив;
	
	Если ЭлектронныеДокументы <> Неопределено Тогда
		Если ТипЗнч(ЭлектронныеДокументы) = Тип("Массив") Тогда
			
			Для Каждого ЭлектронныйДокумент Из ЭлектронныйДокумент Цикл
				
				СведенияОбЭлектронномДокументе = ОбменСКонтрагентами.СведенияОбЭлектронномДокументе(ЭлектронныйДокумент);
				ИдентификаторЭлектронногоДокумента = СведенияОбЭлектронномДокументе.Сообщения.ДанныеОтправителя.ИмяФайлаБезРасширения;
				
				МассивИдентификаторовЭД.Добавить(ИдентификаторЭлектронногоДокумента);
				
			КонецЦикла;
			
		Иначе
			
			СведенияОбЭлектронномДокументе = ОбменСКонтрагентами.СведенияОбЭлектронномДокументе(ЭлектронныеДокументы);
			ИдентификаторЭлектронногоДокумента = СведенияОбЭлектронномДокументе.Сообщения.ДанныеОтправителя.ИмяФайлаБезРасширения;
			
			МассивИдентификаторовЭД = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЭлектронногоДокумента);
			
		КонецЕсли;
	КонецЕсли;
	
	СоответствиеИдентификаторовЭДО = СоответствиеТребованиямГИСМТ.СоответствиеСтатусовЭДО(Источник);
	РезультатыОбработкиДокументов  = СоответствиеТребованиямГИСМТ.РезультатПроверкиПоМассивуДокументов(Источник, МассивИдентификаторовЭД);
	
	ПроверкаДоступностиФормированияЭД = ЭлектронноеВзаимодействиеИСМП.ПроверитьДоступностьВыполненияДействийПоЭДО();
	
	Для Каждого ОбъектУчета Из Источник Цикл
		
		РезультатПоДокументу = ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния();
		
		Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
			ВозвращаемоеЗначение.Вставить(ОбъектУчета, РезультатПоДокументу);
			Продолжить;
		КонецЕсли;
		
		РезультатПоДокументу.ДоступноФормированиеЭД               = ПроверкаДоступностиФормированияЭД.ДоступноФормированиеЭД;
		РезультатПоДокументу.ТекстОшибкиДоступностиФормированияЭД = ПроверкаДоступностиФормированияЭД.ТекстОшибки;
		
		ДанныеЭДО = СоответствиеИдентификаторовЭДО.Получить(ОбъектУчета);
		
		РезультатПоДокументу.ЭлектронныйДокумент = ДанныеЭДО.ЭлектронныйДокумент;
		РезультатПроверкиГИСМТ                   = РезультатыОбработкиДокументов.Получить(ОбъектУчета);
		
		Если Не РезультатПроверкиГИСМТ = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(РезультатПоДокументу, РезультатПроверкиГИСМТ);
			РезультатПоДокументу.ТребуетсяОформлениеРазрешенияПоДатеПроизводства = РезультатПроверкиГИСМТ.ТребуетсяПроверкаМОДУчастников;
			
		Иначе
			// если не используется проверка документов на соответствие требованиям ГИС МТ, формировать разрешение без проверки
			РезультатПоДокументу.ТребуетсяОформлениеРазрешенияПоДатеПроизводства = Истина;
		КонецЕсли;
		
		ВозвращаемоеЗначение.Вставить(ОбъектУчета, РезультатПоДокументу);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьРезультатПроверкиЭлектронногоДокументаИСостояния()
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ЭлектронныйДокумент",                             Неопределено);
	СтруктураВозврата.Вставить("ВыполненаПредварительнаяПроверка",                Ложь);
	СтруктураВозврата.Вставить("ОтправленНаПредварительнуюПроверку",              Ложь);
	СтруктураВозврата.Вставить("ПроверкаОтключена",                               Ложь);
	СтруктураВозврата.Вставить("Статус",                                          Перечисления.СтатусыОбработкиДокументовИСМП.ПустаяСсылка());
	СтруктураВозврата.Вставить("СтатусДокументаВСервисе",                         Перечисления.СтатусыДокументовИСМП.ПустаяСсылка());
	СтруктураВозврата.Вставить("СтатусОтправки",                                  Перечисления.СтатусОтправкиГИСМТ.ПустаяСсылка());
	СтруктураВозврата.Вставить("ТребуетсяОформлениеРазрешенияПоДатеПроизводства", Ложь);
	СтруктураВозврата.Вставить("ДоступноФормированиеЭД",                          Ложь);
	СтруктураВозврата.Вставить("ТекстОшибкиДоступностиФормированияЭД",            "");
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
