////////////////////////////////////////////////////////////////////////////////
// Хранение данных аутентификации
//
// Храним данные только одной учетной записи для одной организации.
//
// Хранение токенов:
//   ТокенДоступа - храним в безопасном хранилище, где
//     * Владелец - КонтурЛогистика_ОрганизацииДиадок
//     * Данные   - токен доступа
//     * Ключ     - "ТокенДоступа"
//   ТокенОбновления - храним в безопасном хранилище, где
//     * Владелец - КонтурЛогистика_ОрганизацииДиадок
//     * Данные   - токен обновления
//     * Ключ     - "ТокенОбновления"
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выбирает сессии из хранилища.
//
// Параметры:
//   Отбор - Структура - см. Авторизатор.ОтборСессий
//
// Возвращаемое значение:
//   ВыборкаИзРезультатаЗапроса - выборка с данными сессий.
Функция ВыбратьСессии(Отбор) Экспорт
	
	Организация = Отбор.КлючОбъекта;
	
	Если Организация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка() Тогда
		ВладелецДанных = "ОрганизацияПустаяСсылка";
	Иначе
		ВладелецДанных = Организация;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ТокеныДоступа = КонтурЛогистика_ОбщегоНазначенияСервер.ПрочитатьДанныеИзБезопасногоХранилища(
		ВладелецДанных, "ТокенДоступа, ТокенОбновления");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТокеныДоступа = Неопределено Тогда
		ТокенДоступа = "";
		ТокенОбновления = "";
	Иначе
		ТокенДоступа = ТокеныДоступа["ТокенДоступа"];
		ТокенОбновления = ТокеныДоступа["ТокенОбновления"];
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТокенДоступа", ТокенДоступа);
	Запрос.УстановитьПараметр("ТокенОбновления", ТокенОбновления);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_Аутентификация.Организация КАК Организация,
	|	&ТокенДоступа КАК ТокенДоступа,
	|	&ТокенОбновления КАК ТокенОбновления,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК ДатаОкончания,
	|	КонтурЛогистика_Аутентификация.ВремяЖизни КАК ВремяЖизни,
	|	КонтурЛогистика_Аутентификация.УниверсальнаяДатаОкончания КАК УниверсальнаяДатаОкончания,
	|	КонтурЛогистика_Аутентификация.УниверсальнаяДатаОкончанияМС КАК УниверсальнаяДатаОкончанияМС,
	|	КонтурЛогистика_Аутентификация.Тип КАК Тип,
	|	КонтурЛогистика_Аутентификация.ПортальныйИд КАК ПортальныйИд,
	|	КонтурЛогистика_Аутентификация.Имя КАК Имя,
	|	КонтурЛогистика_Аутентификация.Фамилия КАК Фамилия,
	|	КонтурЛогистика_Аутентификация.Отчество КАК Отчество,
	|	КонтурЛогистика_Аутентификация.ФИО КАК ФИО,
	|	КонтурЛогистика_Аутентификация.Телефон КАК Телефон,
	|	КонтурЛогистика_Аутентификация.Почта КАК Почта
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|ГДЕ
	|	КонтурЛогистика_Аутентификация.Организация = &Организация";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Сохраняет сессию в хранилище общих настроек
//
// Параметры:
//	Отбор 	- Структура - см. Авторизатор.ОтборСессий
//	Сессия	- Структура - см. Авторизатор.МодельОтветТокен
//			Если указан пользователь, не являющийся текущим пользователем, 
//			т.е. делается попытка обратиться к настройкам, не принадлежащим текущему пользователю, 
//			то требуется наличие у текущего пользователя права АдминистрированиеДанных.
//
Процедура СохранитьСессию(Отбор, Сессия) Экспорт
	
	Организация = Отбор.КлючОбъекта;
	
	Если Организация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка() Тогда
		ВладелецДанных = "ОрганизацияПустаяСсылка";
	Иначе
		ВладелецДанных = Организация;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Организация = Организация;
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Сессия);
	
	// Запишем токены
	УстановитьПривилегированныйРежим(Истина);
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьДанныеВБезопасноеХранилище(
		ВладелецДанных, Сессия.ТокенДоступа, "ТокенДоступа");
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьДанныеВБезопасноеХранилище(
		ВладелецДанных, Сессия.ТокенОбновления, "ТокенОбновления");
	УстановитьПривилегированныйРежим(Ложь);
	
	НоваяЗапись.ДатаОкончания = МестноеВремя(НоваяЗапись.УниверсальнаяДатаОкончания);
	
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Удаляет сессию в хранилище общих настроек
//
// Параметры:
//	Отбор 						- Структура - см. Авторизатор.ОтборСессий
//	УведомлятьАдминистратора 	- Булево - отправлять уведомление администратору
//
Процедура УдалитьСессию(Отбор, УведомлятьАдминистратора = Истина) Экспорт
	
	Организация = Отбор.КлючОбъекта;
	ДанныеПользователя = Новый Структура("ФИО, Телефон, Почта");
	
	Если ТипЗнч(Организация) <> Тип("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		ДанныеПользователя.ФИО = НаборЗаписей[0].ФИО;
		ДанныеПользователя.Телефон = НаборЗаписей[0].Телефон;
		ДанныеПользователя.Почта = НаборЗаписей[0].Почта;
	КонецЕсли;
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	Если ЗначениеЗаполнено(Организация) И УведомлятьАдминистратора Тогда
		
		// Отправим уведомления администратору о разлогировании
		
		// Телефон
		КонтактыАдминистратора_Телефоны = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(
			"КонтактыАдминистратора_Телефоны");
		ИспользоватьОтправкуВТелеграм = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользоватьОтправкуВТелеграм");
		Если ЗначениеЗаполнено(КонтактыАдминистратора_Телефоны) И ИспользоватьОтправкуВТелеграм Тогда
			Телефоны = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(КонтактыАдминистратора_Телефоны, ";", Ложь);
			ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(Телефоны, Организация, ДанныеПользователя);
		КонецЕсли;
		
		// Электронные адреса
		КонтактыАдминистратора_Адреса = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(
			"КонтактыАдминистратора_АдресаЭлектронныхПочт");
		ИспользоватьОтправкуНаПочту = КонтурЛогистика_РаботаСПочтовымиСообщениями.НастройкиОтправкиПочтыЗаполнены();
		Если ЗначениеЗаполнено(КонтактыАдминистратора_Адреса) И ИспользоватьОтправкуНаПочту Тогда
			ОтправитьСообщениеНаАдресЭлектроннойПочты(КонтактыАдминистратора_Адреса, Организация, ДанныеПользователя);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подменяет общую аутентификацию под конкретные организации
//
// Параметры:
//  ОрганизацииПодмены	 - Массив	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок
//
Процедура ПодменитьОбщуюАутентификациюПодКонкретные(ОрганизацииПодмены) Экспорт
	
	Если ОрганизацииПодмены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Найдем общую запись и токены
	НаборЗаписейОбщей = СоздатьНаборЗаписей();
	НаборЗаписейОбщей.Отбор.Организация.Установить(Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	НаборЗаписейОбщей.Прочитать();
	
	Если НаборЗаписейОбщей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТокеныДоступа = КонтурЛогистика_ОбщегоНазначенияСервер.ПрочитатьДанныеИзБезопасногоХранилища(
		"ОрганизацияПустаяСсылка", "ТокенДоступа, ТокенОбновления");
	Если ТокеныДоступа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяЗапись = НаборЗаписейОбщей[0];
	ТокенДоступа = ТокеныДоступа["ТокенДоступа"];
	ТокенОбновления = ТокеныДоступа["ТокенОбновления"];
	
	// Установим для каждой организации
	Для Каждого ТекущаяОрганизация Из ОрганизацииПодмены Цикл
		
		НаборЗаписейТекущий = СоздатьНаборЗаписей();
		НаборЗаписейТекущий.Отбор.Организация.Установить(ТекущаяОрганизация);
		
		НоваяЗапись = НаборЗаписейТекущий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ОбщаяЗапись);
		НоваяЗапись.Организация = ТекущаяОрганизация;
		
		// Запишем токены
		КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьДанныеВБезопасноеХранилище(
			ТекущаяОрганизация, ТокенДоступа, "ТокенДоступа");
		КонтурЛогистика_ОбщегоНазначенияСервер.ЗаписатьДанныеВБезопасноеХранилище(
			ТекущаяОрганизация, ТокенОбновления, "ТокенОбновления");
		
		НаборЗаписейТекущий.Записать();
		
	КонецЦикла;
	
	// Очистим общую
	НаборЗаписейОбщей.Очистить();
	НаборЗаписейОбщей.Записать();
	
КонецПроцедуры

// Данные аутентификации по организации
//
// Параметры:
//  Организация	 - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок	 - организация.
//  boxID		 - Строка	 - boxID организации.
// 
// Возвращаемое значение:
//  Структура - состоит из:
//   * Успех         - Булево - признак успеха
//   * ТокенДоступа  - Строка - токена доступа
//   * DiadocBoxId   - Строка - boxId организации
//   * Организация   - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация под которой идет аутентификация
//   * ДатаОкончания - Дата - дата окончания действия токена
//   * ФИО           - Строка - ФИО пользователя
//   * ПортальныйИд  - Строка - портальный ИД
//
Функция ДанныеАутентификацииПоОрганизации(Знач Организация = Неопределено, Знач boxID = Неопределено) Экспорт
	
	ДанныеАутентификации = Новый Структура;
	ДанныеАутентификации.Вставить("Успех", Ложь);
	ДанныеАутентификации.Вставить("ТокенДоступа");
	ДанныеАутентификации.Вставить("DiadocBoxId");
	ДанныеАутентификации.Вставить("Организация");
	ДанныеАутентификации.Вставить("ДатаОкончания");
	ДанныеАутентификации.Вставить("ФИО");
	ДанныеАутентификации.Вставить("ПортальныйИд");
	
	Если Не ЗначениеЗаполнено(Организация) И Не ЗначениеЗаполнено(boxID) Тогда
		Возврат ДанныеАутентификации;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЕстьОтборПоОрганизации", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("boxID", boxID);
	Запрос.УстановитьПараметр("ЕстьОтборПоboxID", ЗначениеЗаполнено(boxID));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_Аутентификация.Организация КАК Организация,
	|	КонтурЛогистика_Аутентификация.Организация.ID КАК DiadocBoxId,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК ДатаОкончания,
	|	КонтурЛогистика_Аутентификация.ФИО КАК ФИО,
	|	КонтурЛогистика_Аутентификация.ПортальныйИд КАК ПортальныйИд
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|ГДЕ
	|	(&ЕстьОтборПоОрганизации
	|				И КонтурЛогистика_Аутентификация.Организация = &Организация
	|			ИЛИ НЕ &ЕстьОтборПоОрганизации)
	|	И (&ЕстьОтборПоboxID
	|				И КонтурЛогистика_Аутентификация.Организация.ID = &boxID
	|			ИЛИ НЕ &ЕстьОтборПоboxID)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДанныеАутентификации.DiadocBoxId = Выборка.DiadocBoxId;
		ДанныеАутентификации.Организация = Выборка.Организация;
		ДанныеАутентификации.ДатаОкончания = Выборка.ДатаОкончания;
		ДанныеАутентификации.ФИО = Выборка.ФИО;
		ДанныеАутентификации.ПортальныйИд = Выборка.ПортальныйИд;
		
		УстановитьПривилегированныйРежим(Истина);
		ТокеныДоступа = КонтурЛогистика_ОбщегоНазначенияСервер.ПрочитатьДанныеИзБезопасногоХранилища(
			Выборка.Организация, "ТокенДоступа");
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ТокеныДоступа <> Неопределено Тогда
			ДанныеАутентификации.ТокенДоступа = ТокеныДоступа["ТокенДоступа"];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеАутентификации;
	
КонецФункции

// Данные аутентификации по любой организации
//
// Возвращаемое значение:
//  Структура - состоит из:
//   * ТокенДоступа  - Строка - токена доступа
//   * DiadocBoxId   - Строка - boxId организации
//   * Организация   - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация под которой идет аутентификация
//   * ДатаОкончания - Дата - дата окончания действия токена
//
Функция ДанныеАутентификацииЛюбойОрганизации() Экспорт
	
	ДанныеАутентификации = Новый Структура;
	ДанныеАутентификации.Вставить("Успех", Ложь);
	ДанныеАутентификации.Вставить("ТокенДоступа");
	ДанныеАутентификации.Вставить("DiadocBoxId");
	ДанныеАутентификации.Вставить("Организация");
	ДанныеАутентификации.Вставить("ДатаОкончания");
	ДанныеАутентификации.Вставить("ФИО");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_Аутентификация.Организация КАК Организация,
	|	КонтурЛогистика_Аутентификация.Организация.ID КАК DiadocBoxId,
	|	КонтурЛогистика_Аутентификация.ДатаОкончания КАК ДатаОкончания,
	|	КонтурЛогистика_Аутентификация.ФИО КАК ФИО
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ДанныеАутентификации.DiadocBoxId = Выборка.DiadocBoxId;
		ДанныеАутентификации.Организация = Выборка.Организация;
		ДанныеАутентификации.ДатаОкончания = Выборка.ДатаОкончания;
		ДанныеАутентификации.ФИО = Выборка.ФИО;
		
		Если Выборка.Организация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка() Тогда
			ВладелецДанных = "ОрганизацияПустаяСсылка";
		Иначе
			ВладелецДанных = Выборка.Организация;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ТокеныДоступа = КонтурЛогистика_ОбщегоНазначенияСервер.ПрочитатьДанныеИзБезопасногоХранилища(
			ВладелецДанных, "ТокенДоступа");
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ТокеныДоступа <> Неопределено Тогда
			ДанныеАутентификации.ТокенДоступа = ТокеныДоступа["ТокенДоступа"];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеАутентификации;
	
КонецФункции

// Есть хотя бы одна авторизация авторизации
// 
// Возвращаемое значение:
//  Булево - признак наличия авторизации
//
Функция ЕстьАвторизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_Аутентификация.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_Аутентификация КАК КонтурЛогистика_Аутентификация
	|ГДЕ
	|	КонтурЛогистика_Аутентификация.Организация <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Очистить все авторизации
//
Процедура ОчиститьВсеАвторизации() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоставитьСообщениеВОчередьНаОтправкуВТелеграм(Телефоны, Организация, ДанныеПользователя)
	
	ТекстЗаголовка = "Требуется повторная авторизация в модуле Контур.Диадок.Логистика 1С";
	
	ФорматHTML = Ложь;
	ТекстСообщения = ТекстСообщенияОРазлогировании(ТекстЗаголовка, Организация, ДанныеПользователя, ФорматHTML);
	
	НовоеСообщение = КонтурЛогистика_РаботаСТелеграм.МанифестСообщения();
	НовоеСообщение.Тип = "text";
	НовоеСообщение.Данные = КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьДвоичныеДанныеИзСтроки_КонтурЛогистика(ТекстСообщения);
	
	Сообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовоеСообщение);
	
	Для Каждого Телефон Из Телефоны Цикл
		РегистрыСведений.КонтурЛогистика_ОчередьОтправкиСообщенийВТелеграм.ДобавитьВОчередь(Телефон, Сообщения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьСообщениеНаАдресЭлектроннойПочты(Адреса, Организация, ДанныеПользователя)
	
	ТекстЗаголовка = "Требуется повторная авторизация в модуле Контур.Диадок.Логистика 1С";
	
	ФорматHTML = Истина;
	ТекстСообщения = ТекстСообщенияОРазлогировании(ТекстЗаголовка, Организация, ДанныеПользователя, ФорматHTML);
	
	ШаблонПисьма = ШаблонПисьмаHTML();
	ТекстПисьма = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонПисьма, ТекстСообщения);
	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = ТекстЗаголовка;
	Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
	
	Получатели = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(Адреса, ";", Ложь);
	Для Каждого Получатель Из Получатели Цикл
		Письмо.Получатели.Добавить(Получатель);
	КонецЦикла;
	
	Попытка
		
		ТекстОшибкиОтправки = КонтурЛогистика_РаботаСПочтовымиСообщениями.ОтправитьПисьмо(Письмо);
		
		Если ЗначениеЗаполнено(ТекстОшибкиОтправки) Тогда
			ЗаписьЖурналаРегистрации("КонтурЛогистика_Аутентификация",
				УровеньЖурналаРегистрации.Ошибка,, Организация, ТекстОшибкиОтправки);
		КонецЕсли;
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибкиОтправкиПочты = "Аутентификация: " + Строка(ДанныеПользователя.ФИО) + "
			|Текст ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Организация, ТекстОшибкиОтправкиПочты);
		
	КонецПопытки;
	
КонецПроцедуры

Функция ТекстСообщенияОРазлогировании(ТекстЗаголовка, Организация, ДанныеПользователя, ФорматHTML)
	
	Попытка
		ИмяБазыДанных = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		Если Не ЗначениеЗаполнено(ИмяБазыДанных) Тогда
			ИмяБазыДанных = СтрокаСоединенияИнформационнойБазы();
		КонецЕсли;
	Исключение
		ИмяБазыДанных = "<не удалось получить>";
	КонецПопытки;
	
	
	ШаблонСтрокиСсылки = "<a href=""%1"">%2</a>";
	Если ФорматHTML Тогда
		ШаблонЗаголовка = "<b>%1</b>";
		ШаблонСтроки = "<tr><th>%1</th><td>%2</td></tr>";
		ШаблонСтрокиДопИнформации = "<p>%1</p>";
	Иначе
		ШаблонЗаголовка = "<b>%1</b>";
		ШаблонСтроки = "<b><u>%1:</u></b> %2";
		ШаблонСтрокиДопИнформации = "<i>%1</i>";
	КонецЕсли;
	
	Строки = Новый Массив;
	
	// Заголовок для Телеграм
	Если Не ФорматHTML Тогда
		Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонЗаголовка, ТекстЗаголовка));
	КонецЕсли;
	
	// Требуемое действие
	СсылкаАвторизации = "https://support.kontur.ru/logistika-1s/82041-avtorizaciya_v_module";
	
	ТекстСсылки = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
		ШаблонСтрокиСсылки, СсылкаАвторизации, "Инструкция");
	ТекстТребуемоеДействие = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
		"Обмен с сервисом Диадок.Логистика для организации ""%1"" прекращен. Авторизуйтесь повторно в модуле 1С. "
		+ ТекстСсылки, Строка(Организация));
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтрокиДопИнформации,
		?(ФорматHTML, "<br>", Символы.ПС) + ТекстТребуемоеДействие));
	
	// Начало таблицы
	Если ФорматHTML Тогда
		Строки.Добавить("<br><br>");
		Строки.Добавить("<table class=""table table-condensed"">");
		Строки.Добавить("<tbody>");
	КонецЕсли;
	
	// Организация
	ОтправительПредставление = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПодробноеПредставлениеОрганизацииДиадок(Организация);
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
		?(ФорматHTML, "", Символы.ПС) + "Организация", ОтправительПредставление));
	
	// Представление пользователя
	ПредставлениеПользователя = ДанныеПользователя.ФИО;
	Если ЗначениеЗаполнено(ДанныеПользователя.Телефон) Или ЗначениеЗаполнено(ДанныеПользователя.Почта) Тогда
		
		ПредставлениеПользователя = ПредставлениеПользователя + " (";
		
		Если ЗначениеЗаполнено(ДанныеПользователя.Телефон) Тогда
			ПредставлениеПользователя = ПредставлениеПользователя + ДанныеПользователя.Телефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПользователя.Почта) Тогда
			ПредставлениеПользователя = ПредставлениеПользователя
				+ ?(ЗначениеЗаполнено(ДанныеПользователя.Телефон), ", ", "")
				+ ДанныеПользователя.Почта;
		КонецЕсли;
		
		ПредставлениеПользователя = ПредставлениеПользователя + ")";
	КонецЕсли;
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
		?(ФорматHTML, "", Символы.ПС) + "Пользователь", ПредставлениеПользователя));
	
	// Путь к базе
	Строки.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(ШаблонСтроки,
		?(ФорматHTML, "", Символы.ПС) + "Путь к базе 1С", ИмяБазыДанных));
	
	// Конец таблицы
	Если ФорматHTML Тогда
		Строки.Добавить("</tbody></table>");
	КонецЕсли;
	
	ТекстСообщения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СоединитьСтроку(Строки, Символы.ПС);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ШаблонПисьмаHTML()
	
	Возврат
	"<!DOCTYPE html PUBLIC ""-//W3C//DTD HTML 4.0 Transitional//EN"">
	|<html>
	|<head content=""text/html"" http-equiv=""Content-Type"" charset="""">
	|<meta name=""format-detection""></meta>
	|<style type=""text/css"">
	| body {margin: 0; padding: 1px;}
	| p {line-height: 1.15; margin: 0; white-space: pre-wrap;}
	| p.gray {color: gray}
	| ol,ul {margin-top: 0; margin-bottom: 0;}
	| img {border: none;}
	| .css-body {font-family: ""Lab Grotesque"",-apple-system,system-ui,BlinkMacSystemFont,""Segoe UI"",""FSegoeUI"",Roboto,rouble,""Helvetica Neue"",Ubuntu,Arial,Tahoma,sans-serif;}
	| table {background-color: transparent}
	| th {text-align: left}
	| .table {max-width: 100%;}
	| .table>thead>tr>th,.table>tbody>tr>th,.table>tfoot>tr>th,.table>thead>tr>td,.table>tbody>tr>td,.table>tfoot>tr>td {padding: 1px;line-height: 1.42857143;vertical-align: top;border-top: 1px solid #ddd}
	|</style>
	|</head>
	|<body class=""css-body"">
	|	%1
	|	<br><div class=""css-line""></div>
	|	<p class=""gray"">Письмо сформировано автоматически, отвечать на него не нужно. Получение уведомлений можно отключить в модуле Контур.Диадок.Логистика 1С в основных настройках ""Контакты администратора"".</p>
	|</body></html>";
	
КонецФункции

#КонецОбласти

#КонецЕсли