
&ИзменениеИКонтроль("ЗаполнитьНоменклатуруПоНоменклатуреПартнера")
Процедура АУ_ЗаполнитьНоменклатуруПоНоменклатуреПартнера(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)

	ДанныеПоСтроке = ДанныеДляОбработкиСтроки("ЗаполнитьНоменклатуруПоНоменклатуреПартнера", КэшированныеЗначения);
	Если ДанныеПоСтроке <> Неопределено Тогда

		Результат = ДанныеПоСтроке[0];

		Если Результат.НеобходимоПерезаполнитьНоменклатуру Тогда
			ТекущаяСтрока.Номенклатура = Результат.Номенклатура;
		КонецЕсли;

		Если Результат.НеобходимоПерезаполнитьХарактеристики Тогда

			#Удаление
			ТекущаяСтрока.Характеристика = Результат.Характеристика;
			#КонецУдаления
			ТекущаяСтрока.ХарактеристикиИспользуются = Результат.ХарактеристикиИспользуются;

		КонецЕсли;

		Если Результат.НеобходимоПерезаполнитьУпаковки Тогда

			ТекущаяСтрока.Упаковка = Результат.Упаковка;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
