////////////////////////////////////////////////////////////////////////////////
// ОПИСАНИЕ ПЕРЕМЕННЫХ

// Кэш клиент
&НаКлиенте
Перем
КлиентСтдЛок;

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

&НаКлиенте
Процедура ПроверитьКонфигурациюПриложения(Значение) Экспорт
	
	ПропускатьЗаполнение = Новый Массив;
	ПропускатьЗаполнение.Добавить("КаталогОтладки");
	
	Результат = ПроверитьКоллекцию(МодельКонфигурацияПриложения(), Значение, ПропускатьЗаполнение);
	
	Если Результат.Количество() Тогда
		Ошибки = _Стд().Стр().СтрСоединитьЛок(Результат, ", ");
		Сообщение = _Стд().Стр().СтрШаблонЛок("При проверке конфигурации приложения обнаружены ошибки: %1", Ошибки);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Ид, ОсновнойМодуль) Экспорт
	
	Имя = _Стд().Стр().СтрШаблонЛок("ВнешняяОбработка.%1.Форма.КлиентскиеВызовы", Ид);
	
	ПараметрыФормы = Новый Структура;
	
	// BSLLS:GetFormMethod-off
	ПлагинКлиент = ПолучитьФорму(Имя, ПараметрыФормы, ОсновнойМодуль);
	// BSLLS:GetFormMethod-on
	ПлагинКлиент.ОткрытьНастройки();
	
КонецПроцедуры

// ЗАВИСИМОСТИ

&НаКлиенте
Функция _Стд() Экспорт

	Если КлиентСтдЛок = Неопределено Тогда	
		Если ЭтоВнешняяОбработка Тогда
			// BSLLS:GetFormMethod-off
			КлиентСтдЛок = ПолучитьФорму("ВнешняяОбработка.КонтурДиадокСтд.Форма.Клиент");
			// BSLLS:GetFormMethod-on
		Иначе
			// BSLLS:GetFormMethod-off
			КлиентСтдЛок = ПолучитьФорму("Обработка.КонтурДиадокСтд.Форма.Клиент");	
			// BSLLS:GetFormMethod-on
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлиентСтдЛок; 
	
КонецФункции

// МОДЕЛИ

// Модель конфигурации приложения. Используется для хранения и передачи параметров текущего приложения.
//
// Возвращаемое значение:
//   Стуктура:
//   * Имя      - Строка - Имя приложения, по которому будет производиться поиск и сохранения плагинов в базе 1С
//   * Каталог  - Строка - родитель элементов спраовчника, где хранятся плагины
//	   КаталогОтладки - Строка - Каталог, где будет происходить поиск плагинов для отладки
//
&НаКлиенте
Функция МодельКонфигурацияПриложения() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("Имя");
	Модель.Вставить("Каталог");
	Модель.Вставить("КаталогОтладки");
	
	Возврат Модель;
	
КонецФункции

// Модель конфигурации обновлятора. Содержит параметры подключения к сервису обновлений.
//
// Возвращаемое значение:
//	Структура:
//   * Локация 	- Строка - Локация сервиса
//   * КлючАПИ 	- Строка - X-Kontur-Apikey
//   * КлючИБ 	- Строка - X-Kontur-Secret-Key
//   * Приложение  - Строка - Имя приложения в сервисе обновлений
//
&НаКлиенте
Функция МодельКонфигурацияОбновлятора() Экспорт
	
	Модель = Новый Структура;
	Модель.Вставить("Локация");
	Модель.Вставить("КлючАПИ");
	Модель.Вставить("КлючИБ");
	Модель.Вставить("Приложение");
	
	Возврат Модель;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоВнешняяОбработка = Объект_()._ЭтоВнешняяОбработка();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// ЗАВИСИМОСТИ

&НаСервере
Функция Объект_()
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат Объект;
	#Иначе
		Возврат РеквизитФормыВЗначение("Объект");
	#КонецЕсли
	
КонецФункции

// ПРОЧЕЕ

&НаКлиенте
Функция ПроверитьКоллекцию(Модель, Коллекция, ПропускатьЗаполнение = Неопределено)
	
	Если ПропускатьЗаполнение = Неопределено Тогда
		ПропускатьЗаполнение = Новый Массив;
	КонецЕсли;
	
	Ошибки = Новый Массив;
	Для Каждого Элемент Из Модель Цикл
		Если Коллекция.Свойство(Элемент.Ключ) = Ложь Тогда
				Ошибки.Добавить(_Стд().Стр().СтрШаблонЛок("Не найден ключ: %1", Элемент.Ключ));
			Продолжить;
		КонецЕсли;
		Если ПропускатьЗаполнение.Найти(Элемент.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеКоллекцииЗаполнено(Коллекция[Элемент.Ключ]) = Ложь Тогда
			Ошибки.Добавить(_Стд().Стр().СтрШаблонЛок("Пустое значение ключа: %1", Элемент.Ключ));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеКоллекцииЗаполнено(Значение)
	
	ТипЗнч = ТипЗнч(Значение);
	
	Если ТипЗнч = Тип("Строка") Тогда
		Результат = Значение <> "";
	ИначеЕсли ТипЗнч = Тип("Массив") Тогда
		Результат = Значение.Количество() > 0;
	ИначеЕсли Значение = Неопределено Тогда
		Результат = Ложь;
	ИначеЕсли ТипЗнч = Тип("Булево") Или ТипЗнч = Тип("Число") Тогда
		Результат = Истина;
	Иначе
		ВызватьИсключение "Неопределенный ключ конфигурации";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции