//@strict-types
//@skip-check bsl-variable-name-invalid
//@skip-check method-too-many-params

////////////////////////////////////////////////////////////////////////////////
// Copyright 2024 ПАО СКБ Контур
// Лицензировано согласно Apache License, Версия 2.0 (далее - "Лицензия");
// вы не можете использовать этот файл иначе, чем в соответствии с Лицензией.
// Вы можете получить копию Лицензии по следующему адресу:
//
// http://www.apache.org/licenses/LICENSE-2.0
//
// Если это не требуется действующим законодательством или не согласовано в
// письменной форме, программное обеспечение, распространяемое на основании
// Лицензии, предоставляется "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ,
// явных или подразумеваемых. См. Лицензию для получения более подробной
// информации о правах и ограничениях, установленных Лицензией.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Расчитать хеш MD5.
// 
// Параметры:
//  ДанныеДляХеширования - ДвоичныеДанные, Строка - Двоичные данные для хеш
// 
// Возвращаемое значение:
//  Строка - хеш MD5
Функция MD5Лок(Знач ДанныеДляХеширования) Экспорт
	СтруктураПременных = ИнициализацияСтруктурыПеременных();

	Если ТипЗнч(ДанныеДляХеширования) = Тип("Строка") Тогда
		ДанныеДляХеширования =
		КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
		.ПолучитьДвоичныеДанныеИзСтрокиЛок(ДанныеДляХеширования);
	КонецЕсли;

	СтруктураЧтениеДанных =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ЧтениеДанных(ДанныеДляХеширования);

	Расчет(СтруктураПременных, СтруктураЧтениеДанных);
	СтруктураПременных.A = 0;
	СтруктураПременных.B = 0;
	СтруктураПременных.C = 0;
	СтруктураПременных.D = 0;

	Для i = 0 По 31 Цикл
		Степ = СтруктураПременных.Степень[i];
		Если СтруктураПременных.A_[i] Тогда
			СтруктураПременных.A = СтруктураПременных.A + Степ;
		КонецЕсли;

		Если СтруктураПременных.B_[i] Тогда
			СтруктураПременных.B = СтруктураПременных.B + Степ;
		КонецЕсли;

		Если СтруктураПременных.C_[i] Тогда
			СтруктураПременных.C = СтруктураПременных.C + Степ;
		КонецЕсли;

		Если СтруктураПременных.D_[i] Тогда
			СтруктураПременных.D = СтруктураПременных.D + Степ;
		КонецЕсли;
	КонецЦикла;

	Возврат НРег(
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.Dec2Hex(СтруктураПременных.A, 8, Истина) +
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.Dec2Hex(СтруктураПременных.B, 8, Истина) +
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.Dec2Hex(СтруктураПременных.C, 8, Истина) +
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.Dec2Hex(СтруктураПременных.D, 8, Истина)
	);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Процедура FF(a, b, c, d, X, s, t, СтруктураПременных)
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._AND(b, c, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._NOT(b, СтруктураПременных.EBX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._AND(СтруктураПременных.EBX, d, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._OR(СтруктураПременных.EAX, СтруктураПременных.ECX, СтруктураПременных.EBX);

	X1 = X + t;
	Если X1 >= СтруктураПременных.Stepen32 Тогда
		X1 = X1 - СтруктураПременных.Stepen32;
	КонецЕсли;
	Для инд = 0 По 31 Цикл
		инд1 = 31 - инд;
		Степ = СтруктураПременных.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			СтруктураПременных.EDX[инд1] = Истина;
		Иначе
			СтруктураПременных.EDX[инд1] = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.EBX, a, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, СтруктураПременных.EDX, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ROL(СтруктураПременных.EAX, s, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, b, a);
	
КонецПроцедуры

Процедура GG(a, b, c, d, X, s, t, СтруктураПременных)
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._AND(b, d, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._NOT(d, СтруктураПременных.EDX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._AND(СтруктураПременных.EDX, c, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._OR(СтруктураПременных.EAX, СтруктураПременных.ECX, СтруктураПременных.EBX);

	X1 = X + t;
	Если X1 >= СтруктураПременных.Stepen32 Тогда
		X1 = X1 - СтруктураПременных.Stepen32;
	КонецЕсли;

	Для инд = 0 По 31 Цикл
		инд1 = 31 - инд;
		Степ = СтруктураПременных.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			СтруктураПременных.EDX[инд1] = Истина;
		Иначе
			СтруктураПременных.EDX[инд1] = Ложь;
		КонецЕсли;
	КонецЦикла;
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.EBX, a, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, СтруктураПременных.EDX, СтруктураПременных.EAX);

	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ROL(СтруктураПременных.EAX, s, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, b, a);
	
КонецПроцедуры

Процедура HH(a, b, c, d, X, s, t, СтруктураПременных)
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._XOR(b, c, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._XOR(СтруктураПременных.EAX, d, СтруктураПременных.EBX);

	X1 = X + t;
	Если X1 >= СтруктураПременных.Stepen32 Тогда
		X1 = X1 - СтруктураПременных.Stepen32;
	КонецЕсли;

	Для Инд = 0 По 31 Цикл
		инд1 = 31 - Инд;
		Степ = СтруктураПременных.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			СтруктураПременных.EDX[инд1] = Истина;
		Иначе
			СтруктураПременных.EDX[инд1] = Ложь;
		КонецЕсли;
	КонецЦикла;

	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.EBX, a, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, СтруктураПременных.EDX, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ROL(СтруктураПременных.EAX, s, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, b, a);

КонецПроцедуры

Процедура II(a, b, c, d, X, s, t, СтруктураПременных)
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._NOT(d, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._OR(СтруктураПременных.EAX, b, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._XOR(СтруктураПременных.ECX, c, СтруктураПременных.EBX);

	X1 = X + t;
	Если X1 >= СтруктураПременных.Stepen32 Тогда
		X1 = X1 - СтруктураПременных.Stepen32;
	КонецЕсли;

	Для Инд = 0 По 31 Цикл
		инд1 = 31 - Инд;
		Степ = СтруктураПременных.Степень[инд1];
		Если X1 >= Степ Тогда
			X1 = X1 - Степ;
			СтруктураПременных.EDX[инд1] = Истина;
		Иначе
			СтруктураПременных.EDX[инд1] = Ложь;
		КонецЕсли;
	КонецЦикла;

	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.EBX, a, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, СтруктураПременных.EDX, СтруктураПременных.EAX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ROL(СтруктураПременных.EAX, s, СтруктураПременных.ECX);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.ECX, b, a);
	
КонецПроцедуры

Процедура MD5Hash(СтруктураПременных)
	A1 =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32);
	
	B1 =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32);
	
	C1 =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32);
	
	D1 =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32);

	Для i = 0 По 31 Цикл
		A1[i] = СтруктураПременных.A_[i];
		B1[i] = СтруктураПременных.B_[i];
		C1[i] = СтруктураПременных.C_[i];
		D1[i] = СтруктураПременных.D_[i];
	КонецЦикла;
 
	// --------------------------------------------------------------------------
	// Round 1.
	// --------------------------------------------------------------------------
	FF(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[0], СтруктураПременных.S11, 3614090360, СтруктураПременных);// Step 1
	FF(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[1], СтруктураПременных.S12, 3905402710, СтруктураПременных);// Step 2
	FF(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[2], СтруктураПременных.S13, 606105819, СтруктураПременных);// Step 3
	FF(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[3], СтруктураПременных.S14, 3250441966, СтруктураПременных);// Step 4
	FF(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[4], СтруктураПременных.S11, 4118548399, СтруктураПременных);// Step 5
	FF(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[5], СтруктураПременных.S12, 1200080426, СтруктураПременных);// Step 6
	FF(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[6], СтруктураПременных.S13, 2821735955, СтруктураПременных);// Step 7
	FF(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[7], СтруктураПременных.S14, 4249261313, СтруктураПременных);// Step 8
	FF(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[8], СтруктураПременных.S11, 1770035416, СтруктураПременных);// Step 9
	FF(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[9], СтруктураПременных.S12, 2336552879, СтруктураПременных);// Step 10
	FF(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[10], СтруктураПременных.S13, 4294925233, СтруктураПременных);// Step 11
	FF(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[11], СтруктураПременных.S14, 2304563134, СтруктураПременных);// Step 12
	FF(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[12], СтруктураПременных.S11, 1804603682, СтруктураПременных);// Step 13
	FF(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[13], СтруктураПременных.S12, 4254626195, СтруктураПременных);// Step 14
	FF(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[14], СтруктураПременных.S13, 2792965006, СтруктураПременных);// Step 15
	FF(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[15], СтруктураПременных.S14, 1236535329, СтруктураПременных);// Step 16
// --------------------------------------------------------------------------
// Round 2.
// --------------------------------------------------------------------------
	GG(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[1], СтруктураПременных.S21, 4129170786, СтруктураПременных);// Step 17
	GG(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[6], СтруктураПременных.S22, 3225465664, СтруктураПременных);// Step 18
	GG(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[11], СтруктураПременных.S23, 643717713, СтруктураПременных);// Step 19
	GG(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[0], СтруктураПременных.S24, 3921069994, СтруктураПременных);// Step 20
	GG(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[5], СтруктураПременных.S21, 3593408605, СтруктураПременных);// Step 21
	GG(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[10], СтруктураПременных.S22, 38016083, СтруктураПременных);// Step 22 
	GG(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[15], СтруктураПременных.S23, 3634488961, СтруктураПременных);// Step 23
	GG(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[4], СтруктураПременных.S24, 3889429448, СтруктураПременных);// Step 24
	GG(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[9], СтруктураПременных.S21, 568446438, СтруктураПременных);// Step 25
	GG(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[14], СтруктураПременных.S22, 3275163606, СтруктураПременных);// Step 26
	GG(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[3], СтруктураПременных.S23, 4107603335, СтруктураПременных);// Step 27
	GG(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[8], СтруктураПременных.S24, 1163531501, СтруктураПременных);// Step 28
	GG(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[13], СтруктураПременных.S21, 2850285829, СтруктураПременных);// Step 29
	GG(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[2], СтруктураПременных.S22, 4243563512, СтруктураПременных);// Step 30
	GG(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[7], СтруктураПременных.S23, 1735328473, СтруктураПременных);// Step 31
	GG(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[12], СтруктураПременных.S24, 2368359562, СтруктураПременных);// Step 32
// --------------------------------------------------------------------------
// Round 3.
// --------------------------------------------------------------------------
	HH(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[5], СтруктураПременных.S31, 4294588738, СтруктураПременных);// Step 33
	HH(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[8], СтруктураПременных.S32, 2272392833, СтруктураПременных);// Step 34
	HH(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[11], СтруктураПременных.S33, 1839030562, СтруктураПременных);// Step 35
	HH(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[14], СтруктураПременных.S34, 4259657740, СтруктураПременных);// Step 36
	HH(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[1], СтруктураПременных.S31, 2763975236, СтруктураПременных);// Step 37
	HH(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[4], СтруктураПременных.S32, 1272893353, СтруктураПременных);// Step 38
	HH(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[7], СтруктураПременных.S33, 4139469664, СтруктураПременных);// Step 39
	HH(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[10], СтруктураПременных.S34, 3200236656, СтруктураПременных);// Step 40
	HH(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[13], СтруктураПременных.S31, 681279174, СтруктураПременных);// Step 41
	HH(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[0], СтруктураПременных.S32, 3936430074, СтруктураПременных);// Step 42
	HH(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[3], СтруктураПременных.S33, 3572445317, СтруктураПременных);// Step 43
	HH(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[6], СтруктураПременных.S34, 76029189, СтруктураПременных);// Step 44
	HH(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[9], СтруктураПременных.S31, 3654602809, СтруктураПременных);// Step 45
	HH(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[12], СтруктураПременных.S32, 3873151461, СтруктураПременных);// Step 46
	HH(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[15], СтруктураПременных.S33, 530742520, СтруктураПременных);// Step 47
	HH(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[2], СтруктураПременных.S34, 3299628645, СтруктураПременных);// Step 48
// --------------------------------------------------------------------------
// Round 4.
// --------------------------------------------------------------------------
	II(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[0], СтруктураПременных.S41, 4096336452, СтруктураПременных);// Step 49
	II(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[7], СтруктураПременных.S42, 1126891415, СтруктураПременных);// Step 50
	II(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[14], СтруктураПременных.S43, 2878612391, СтруктураПременных);// Step 51
	II(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[5], СтруктураПременных.S44, 4237533241, СтруктураПременных);// Step 52
	II(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[12], СтруктураПременных.S41, 1700485571, СтруктураПременных);// Step 53
	II(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[3], СтруктураПременных.S42, 2399980690, СтруктураПременных);// Step 54
	II(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[10], СтруктураПременных.S43, 4293915773, СтруктураПременных);// Step 55
	II(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[1], СтруктураПременных.S44, 2240044497, СтруктураПременных);// Step 56
	II(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[8], СтруктураПременных.S41, 1873313359, СтруктураПременных);// Step 57
	II(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[15], СтруктураПременных.S42, 4264355552, СтруктураПременных);// Step 58
	II(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[6], СтруктураПременных.S43, 2734768916, СтруктураПременных);// Step 59
	II(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[13], СтруктураПременных.S44, 1309151649, СтруктураПременных);// Step 60
	II(СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_,
		СтруктураПременных.X[4], СтруктураПременных.S41, 4149444226, СтруктураПременных);// Step 61
	II(СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_, СтруктураПременных.c_,
		СтруктураПременных.X[11], СтруктураПременных.S42, 3174756917, СтруктураПременных);// Step 62
	II(СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_, СтруктураПременных.b_,
		СтруктураПременных.X[2], СтруктураПременных.S43, 718787259, СтруктураПременных);// Step 63
	II(СтруктураПременных.b_, СтруктураПременных.c_, СтруктураПременных.d_, СтруктураПременных.a_,
		СтруктураПременных.X[9], СтруктураПременных.S44, 3951481745, СтруктураПременных);// Step 64
// --------------------------------------------------------------------------

	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.A_, A1, СтруктураПременных.A_);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.B_, B1, СтруктураПременных.B_);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.C_, C1, СтруктураПременных.C_);
	
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	._ADD(СтруктураПременных.D_, D1, СтруктураПременных.D_);
	
КонецПроцедуры

Процедура Расчет(СтруктураПременных, СтруктураЧтениеДанных)
	Мас = ПолучитьПустойМассивЧисло(64);
	Длина =
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.РазмерПотока(
		КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
		.ИсходныйПотокЧтениеДанных(СтруктураЧтениеДанных)
	);

	// Определение Хэш кодов 64 байтных блоков
	ДлСтр = Длина;
	Пока ДлСтр >= 64 Цикл
		Для i = 0 По 15 Цикл
			СтруктураПременных.X[i] =
			КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
			.ПрочитатьЦелое32ЧтениеДанных(СтруктураЧтениеДанных);
			
		КонецЦикла;

		MD5Hash(СтруктураПременных);

		ДлСтр = ДлСтр - 64;
	КонецЦикла;
 
	// Финал - определение Хэш кода последнего блока
	Если Длина <> -1 Тогда  // Если Длина = -1 то значит это не последний блок
		ДлинаБит = Длина * 8;
		Для i = 0 По ДлСтр - 1 Цикл
			Мас[i] =
			КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
			.ПрочитатьБайтЧтениеДанных(СтруктураЧтениеДанных);
			
		КонецЦикла;
		Мас[ДлСтр] = 128;
		Длина = ДлСтр + 1;
  
		// В последнем блоке нет свободных 8 байт для длины
		// Дополняем блок до 64 байт
		Если Длина > 56 Тогда
			Для i = Длина По 63 Цикл
				Мас[i] = 0;
			КонецЦикла;
			i1 = 0;
			Для i = 0 По 15 Цикл
				СтруктураПременных.X[i] = Мас[i1] + Мас[i1 + 1] * 256 + Мас[i1 + 2] * 65536 + Мас[i1 + 3] * 16777216;
				i1 = i1 + 4;
			КонецЦикла;
			MD5Hash(СтруктураПременных);
			Длина = 0;
		КонецЕсли;
  
		// Дополняем блок до 56 байт и заносим длину в битах
		Для i = Длина По 55 Цикл
			Мас[i] = 0;
		КонецЦикла;
		i1 = 0;
		Для i = 0 По 13 Цикл
			СтруктураПременных.X[i] = Мас[i1] + Мас[i1 + 1] * 256 + Мас[i1 + 2] * 65536 + Мас[i1 + 3] * 16777216;
			i1 = i1 + 4;
		КонецЦикла;
		СтруктураПременных.X[14] = ДлинаБит % СтруктураПременных.Stepen32;
		СтруктураПременных.X[15] = Цел(ДлинаБит / СтруктураПременных.Stepen32);

		MD5Hash(СтруктураПременных);
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьПустойМассивЧисло(Р)
	Массив = Новый Массив; // Массив из Число
	Для Сч = 0 По Р - 1 Цикл
		Массив.Добавить(0);
	КонецЦикла;

	Возврат Массив;
КонецФункции

// Инициализация структуры переменных.
// 
// Возвращаемое значение:
//  Структура - Инициализация структуры переменных:
// * A_ - Массив из Булево - 
// * B_ - Массив из Булево - 
// * C_ - Массив из Булево - 
// * D_ - Массив из Булево - 
// * A - Число - 
// * B - Число - 
// * C - Число - 
// * D - Число - 
// * EAX - Массив из Булево - 
// * EBX - Массив из Булево - 
// * ECX - Массив из Булево - 
// * EDX - Массив из Булево - 
// * M - Массив из Число - 
// * Степень - Массив из Число - 
// * X - Массив из Число - 
// * S11 - Число - 
// * S12 - Число - 
// * S13 - Число - 
// * S14 - Число - 
// * S21 - Число - 
// * S22 - Число - 
// * S23 - Число - 
// * S24 - Число - 
// * S31 - Число - 
// * S32 - Число - 
// * S33 - Число - 
// * S34 - Число - 
// * S41 - Число - 
// * S42 - Число - 
// * S43 - Число - 
// * S44 - Число - 
// * Stepen31 - Число - 
// * Stepen32 - Число - 
Функция ИнициализацияСтруктурыПеременных()

	СтруктураПременных = Новый Структура;
	СтруктураПременных.Вставить("A_",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("B_",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("C_",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("D_",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);

	СтруктураПременных.Вставить("A", 1732584193);
	СтруктураПременных.Вставить("B", 4023233417);
	СтруктураПременных.Вставить("C", 2562383102);
	СтруктураПременных.Вставить("D", 271733878);

	СтруктураПременных.Вставить("EAX",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("EBX",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("ECX",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);
	
	СтруктураПременных.Вставить("EDX",
	КонтурЛогистика_КоннекторHTTPДвоичныеДанные82Служебный
	.ПолучитьПустойМассивБулево(32)
	);

	СтруктураПременных.Вставить("M", ПолучитьПустойМассивЧисло(64));

	СтруктураПременных.Вставить("Степень", ПолучитьПустойМассивЧисло(32));

	СтруктураПременных.Вставить("X", ПолучитьПустойМассивЧисло(16));

	СтруктураПременных.Вставить("S11", 7);
	СтруктураПременных.Вставить("S12", 12);
	СтруктураПременных.Вставить("S13", 17);
	СтруктураПременных.Вставить("S14", 22);

	СтруктураПременных.Вставить("S21", 5);
	СтруктураПременных.Вставить("S22", 9);
	СтруктураПременных.Вставить("S23", 14);
	СтруктураПременных.Вставить("S24", 20);

	СтруктураПременных.Вставить("S31", 4);
	СтруктураПременных.Вставить("S32", 11);
	СтруктураПременных.Вставить("S33", 16);
	СтруктураПременных.Вставить("S34", 23);

	СтруктураПременных.Вставить("S41", 6);
	СтруктураПременных.Вставить("S42", 10);
	СтруктураПременных.Вставить("S43", 15);
	СтруктураПременных.Вставить("S44", 21);
	СтруктураПременных.Вставить("Stepen31", 0);
	СтруктураПременных.Вставить("Stepen32", 0);
	СтруктураПременных.Степень[0] = 1;
	Для инд = 1 По 31 Цикл
		СтруктураПременных.Степень[инд] = СтруктураПременных.Степень[инд - 1] * 2;
	КонецЦикла;
	СтруктураПременных.Stepen31 = СтруктураПременных.Степень[31];
	СтруктураПременных.Stepen32 = СтруктураПременных.Stepen31 * 2;

	Для i = 0 По 31 Цикл
		i1 = 31 - i;
		Степ = СтруктураПременных.Степень[i1];
		Если СтруктураПременных.A >= Степ Тогда
			СтруктураПременных.A = СтруктураПременных.A - Степ;
			СтруктураПременных.A_[i1] = Истина;
		Иначе
			СтруктураПременных.A_[i1] = Ложь;
		КонецЕсли;

		Если СтруктураПременных.B >= Степ Тогда
			СтруктураПременных.B = СтруктураПременных.B - Степ;
			СтруктураПременных.B_[i1] = Истина;
		Иначе
			СтруктураПременных.B_[i1] = Ложь;
		КонецЕсли;

		Если СтруктураПременных.C >= Степ Тогда
			СтруктураПременных.C = СтруктураПременных.C - Степ;
			СтруктураПременных.C_[i1] = Истина;
		Иначе
			СтруктураПременных.C_[i1] = Ложь;
		КонецЕсли;

		Если СтруктураПременных.D >= Степ Тогда
			СтруктураПременных.D = СтруктураПременных.D - Степ;
			СтруктураПременных.D_[i1] = Истина;
		Иначе
			СтруктураПременных.D_[i1] = Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат СтруктураПременных;
КонецФункции