#Область ВебСервис

Функция ПолучитьСтруктуруПараметровДляОбработкиЗапроса() Экспорт
	
	Результат=Новый Структура;
	Результат.Вставить("ИмяМетода","");
	Результат.Вставить("ТипМетода","");
	Результат.Вставить("ЗапросХТТП","");
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьЗапрос(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ТелоЗапроса = РаскодироватьСтроку(Параметры.ЗапросХТТП.ПолучитьТелоКакСтроку(),СпособКодированияСтроки.КодировкаURL);
		
		Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
			ПараметрыЗапроса=ПолучитьОбъектИзJSON(ТелоЗапроса);
		Иначе
			ПараметрыЗапроса=Новый Структура;
		КонецЕсли;
		
		Если Параметры.ИмяМетода="/GetStockGoods" Тогда
			Возврат ВернутьОстаткиТоваровНаСкладах(ПараметрыЗапроса);
		Иначе
			Возврат СоздатьОшибкуВозвратаВебСервиса(404,"UNKNOWN",404,"UNKNOWN","Неизвестный метод работы с шиной");
		КонецЕсли;
	Исключение
		Ошибка=ОписаниеОшибки();
		Возврат СоздатьОшибкуВозвратаВебСервиса(401,"Error",401,"Error",Ошибка);
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

#КонецОбласти

#Область Интерфейс

Функция ВернутьОстаткиТоваровНаСкладах(ПараметрыЗапроса)
	
	Результат=АУ_ПолучениеДанныхСервер.ВернутьОстаткиТоваровНаСкладах(ПараметрыЗапроса);
	
	Если Результат.Результат Тогда
		Ответ = Новый HTTPСервисОтвет(200,"OK");
		Ответ.Заголовки.Вставить("Content-Type","application/json;charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ЗаписатьОбъектВJSON(Результат.Данные));
		Возврат Ответ;
	Иначе
		Возврат СоздатьОшибкуВозвратаВебСервиса(401,"Error",Результат.КодОшибки,Результат.ТекстОшибки);
	КонецЕсли;
	
КонецФункции

#конецОбласти

#Область Служебные

Функция СоздатьОшибкуВозвратаВебСервиса(Код,ТекстОшибкиВебСервиса,КодОшибкиВнутренний="",ТекстКодаОшибкиВнутреннего="",РасшифровкаОшибки="",ДопДанные=Неопределено) 
	
	Ответ = Новый HTTPСервисОтвет(Код,ТекстОшибкиВебСервиса);
	Ответ.Заголовки.Вставить("Content-Type","application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СоздатьОшибкуДляВозврата(КодОшибкиВнутренний,ТекстКодаОшибкиВнутреннего,РасшифровкаОшибки,ДопДанные));
	
	Возврат Ответ;
	
КонецФункции

Функция СоздатьОшибкуДляВозврата(Ошибка,Причина,Детали=Неопределено,ДопДанные=Неопределено) Экспорт
	
	Результат=Новый Структура("error,reason,detail",Ошибка,Причина,Детали);
	Если ЗначениеЗаполнено(ДопДанные) Тогда
		Результат.Вставить(ДопДанные.Имя,ДопДанные.Данные);
	КонецЕсли;
	
	Запись=Новый ЗаписьJSON;
	ПараметрыЗаписи=Новый ПараметрыЗаписиJSON(,Символы.Таб);
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	
	ЗаписатьJSON(Запись,Результат);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция ПолучитьОбъектИзJSON(СтрокаJSON) Экспорт
	
	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);
		Объект = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Объект;
	
КонецФункции

Функция ЗаписатьОбъектВJSON(Объект) Экспорт
	
	Запись=Новый ЗаписьJSON;
	
	ПараметрыЗаписи=Новый ПараметрыЗаписиJSON(,Символы.Таб,,ЭкранированиеСимволовJSON.СимволыВнеBMP,,,,,Истина);
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись,Объект);
	
	ТекСтрока=Запись.Закрыть();
	
	Возврат ТекСтрока;
		
КонецФункции

#КонецОбласти