
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Кастомная = Истина;
	КонецЕсли;
	
	ЭтоПользовательскаяНастройка = Объект.Кастомная;
	
	УстановитьТипЗначенияЭлементаЗначения();
	
	Элементы.ИмяПредопределенногоДляРасширения.ТолькоПросмотр 		= Не ЭтоПользовательскаяНастройка;
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы"));
		
КонецПроцедуры

&НаСервере
Процедура УстановитьТипЗначенияЭлементаЗначения()
	
	Если Объект.Кастомная  Тогда
		
		Попытка
			
			Если ЗначениеЗаполнено(Объект.ТипЗначения) Тогда	
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип(Объект.ТипЗначения));
				ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
			Иначе
				ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
			КонецЕсли;
			
		Исключение
			
			ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
			
		КонецПопытки;
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения;
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;		
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Описание.РедактированиеТекста = Истина;
		Элементы.Наименование.РедактированиеТекста = Истина;
		
	Иначе	
		
		ОписаниеТиповЗначения = Новый ОписаниеТипов(Объект.ТипЗначения);
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения; 
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Описание.РедактированиеТекста = Ложь;
		Элементы.Наименование.РедактированиеТекста = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Кастомная Тогда
		
		СписокВыбора = КонтурЛогистика_ОбщегоНазначенияСервер.МассивТиповЗначенийЭлементов("Справочники", "Перечисления", "ПримитивныеТипы", "КонтурЛогистика_НастройкиПартнеров");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	Иначе
		
		УстановитьТипЗначенияЭлементаЗначения();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ТекДанные) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипЗначения = ВыбранныйЭлемент.Значение;
	УстановитьТипЗначенияЭлементаЗначения();
	
КонецПроцедуры

