
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыНастройкиОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Параметры.НастройкаОбмена, "ЛогинДляПолученияВыписки, СпособПолученияПароля");
	
	Логин = РеквизитыНастройкиОбмена.ЛогинДляПолученияВыписки;
	Если РеквизитыНастройкиОбмена.СпособПолученияПароля = "" Тогда
		Элементы.ГруппаСпособПолученияПароля.Видимость = Ложь;
	Иначе
		Элементы.Пояснение.Заголовок = РеквизитыНастройкиОбмена.СпособПолученияПароля;
	КонецЕсли;
	
	ДатаНачала = ТекущаяДатаСеанса();
	ДанныеПериодаЗапросаВыписки = ОбменСБанкамиСлужебныйВызовСервера.ДанныеПериодаЗапросаВыписки(
		Параметры.НастройкаОбмена, ТекущаяДатаСеанса());
	НачальнаяДатаЗагрузки = ДанныеПериодаЗапросаВыписки.ДатаНачалаЗагрузки;
	НачальнаяДатаЗагрузкиСтрока = Формат(НачальнаяДатаЗагрузки, "ДФ='dd.MM.yyyy""г.""'");
	
	ЗаголовокЗагрузки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Банк позволяет выполнить загрузку выписки с %1'"), НачальнаяДатаЗагрузкиСтрока);
	Элементы.ГруппаПериодЗагрузкиРасширеннаяПодсказка.Заголовок = ЗаголовокЗагрузки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗагружатьДокументыПриИзменении(Элемент)
	
	Элементы.ДатаНачала.Доступность = ЗагружатьДокументы;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ДатаНачала < НачальнаяДатаЗагрузки Тогда
		ДатаНачала = НачальнаяДатаЗагрузки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элемент.РежимПароля = Не Элемент.РежимПароля;
	Если Элемент.РежимПароля Тогда
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыВидны;
	Иначе
		Элемент.КартинкаКнопкиВыбора = БиблиотекаКартинок.ВводимыеСимволыСкрыты;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьАвтоматическоеПолучениеВыписки(Команда)
	
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		ТекстСообщения = НСтр("ru = 'Введите пароль.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СохранитьПарольВБезопасномХранилище(Пароль);
	
	Оповещение = Новый ОписаниеОповещения("ПослеТестовогоПолученияВыписки", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкаОбмена", Параметры.НастройкаОбмена);
	ПараметрыФормы.Вставить("ВидОперации", "ПробноеПолучениеВыписки");
	
	ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса);
	Если ЗагружатьДокументы Тогда
		ПараметрыФормы.Вставить("ДатаНачала", ДатаНачала);
		ПараметрыФормы.Вставить("ДатаОкончания", ДатаОкончания);
	Иначе
		ПараметрыФормы.Вставить("ДатаНачала", НачалоДня(ТекущаяДатаСеанса));
		ПараметрыФормы.Вставить("ДатаОкончания", ДатаОкончания);
	КонецЕсли;
	ПараметрыФормы.Вставить("ПодключениеАвтоВыписки", Истина);
	ПараметрыФормы.Вставить("ЗагружатьДокументы", ЗагружатьДокументы);
	
	ОткрытьФорму("Обработка.ОбменСБанками.Форма.ЗапросВБанк", ПараметрыФормы, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеТестовогоПолученияВыписки(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатТестовогоПолученияВыписки = Новый Структура;
	РезультатТестовогоПолученияВыписки.Вставить("ДокументыЗагружались", ЗагружатьДокументы);
	РезультатТестовогоПолученияВыписки.Вставить("ЕстьОшибкаРазбораВыписки", Ложь);
	РезультатТестовогоПолученияВыписки.Вставить("ТестОшибкиРазбораВыписки", "");
	
	Если Результат = Истина Тогда
		ОбменСБанкамиСлужебныйВызовСервера.ВключитьРегламентноеЗаданиеПоСтандартнойНастройке(Параметры.НастройкаОбмена);
		Закрыть(РезультатТестовогоПолученияВыписки);
	ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
		ОбменСБанкамиСлужебныйВызовСервера.ВключитьРегламентноеЗаданиеПоСтандартнойНастройке(Параметры.НастройкаОбмена);
		
		ВидОперации = НСтр("ru = 'Получение выписки банка.'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
		ОбработкаНеисправностейБЭДВызовСервера.ОбработатьОшибку(ВидОперации,
			ОбщегоНазначенияБЭДКлиентСервер.ПодсистемыБЭД().ОбменСБанками, 
			Результат.ТестОшибкиРазбораВыписки,,
			Параметры.НастройкаОбмена);
			
		ОбменСБанкамиСлужебныйВызовСервера.ЗаписатьОшибкуВПараметрыОбмена(Параметры.НастройкаОбмена,
			Результат.ТестОшибкиРазбораВыписки, ДатаНачала);
		
		РезультатТестовогоПолученияВыписки.ЕстьОшибкаРазбораВыписки = Результат.ЕстьОшибкаРазбораВыписки;
		РезультатТестовогоПолученияВыписки.ТестОшибкиРазбораВыписки = Результат.ТестОшибкиРазбораВыписки;
		Закрыть(РезультатТестовогоПолученияВыписки);
	Иначе
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат);
		КонецЕсли;
		Пароль = "";
		ОбменСБанкамиСлужебныйВызовСервера.УдалитьДанныеАвторизацииОбменСБанками(
			Параметры.НастройкаОбмена,
			"ДляАвтовыписки");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПарольВБезопасномХранилище(Знач Пароль)
	
	ОбменСБанкамиСлужебный.СохранитьДанныеАвторизацииОбменСБанками(Параметры.НастройкаОбмена, , Пароль);
	
КонецПроцедуры

#КонецОбласти