&НаСервере
Перем _ОбработкаОбъект;

&НаКлиенте
Перем _КлиентскиеВызовы;

&НаСервере
Функция ОбработкаОбъект()
	
	Если _ОбработкаОбъект = Неопределено Тогда
		_ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	Возврат _ОбработкаОбъект;
	
КонецФункции

&НаКлиенте
Процедура ИнициализироватьФорму(ФормаКлиентскиеВызовы) Экспорт
	
	_КлиентскиеВызовы = ФормаКлиентскиеВызовы;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначениеРеквизита") Тогда
		ЗначениеРеквизита = Параметры.ЗначениеРеквизита;
		ЗаполнитьДанныеФормы(ЗначениеРеквизита);             
	КонецЕсли;
	
	Если Параметры.Свойство("ИмяТекущегоЭлемента") Тогда
		
		Попытка
			ЭтаФорма.ТекущийЭлемент = Элементы[Параметры.ИмяТекущегоЭлемента];
		Исключение
		КонецПопытки;
		
	КонецЕсли;

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
		
КонецПроцедуры

&НаКлиенте
Процедура рл_ИННФЛПриИзменении(Элемент)
	
	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();
	
КонецПроцедуры

&НаКлиенте
Процедура рл_НомВУПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();

КонецПроцедуры

&НаКлиенте
Процедура рл_СерВУПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();

КонецПроцедуры

&НаКлиенте
Процедура рл_ДатаВыдВУПриИзменении(Элемент)

	ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	ЗначениеРеквизита = ЗначениеРеквизита();
	Закрыть(ЗначениеРеквизита);
КонецПроцедуры

&НаСервере
Функция ЗначениеРеквизита()

	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		ЗначенияДополнительныхСвойств.Вставить("Ссылка", СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат МодульОбъекта.СериализоватьXML(ЗначенияДополнительныхСвойств);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоСсылке(Команда)

	ОбновитьПоСсылкеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоСсылкеНаСервере()

	МодульОбъекта = ОбработкаОбъект();
	ДанныеВодителя = МодульОбъекта.ДанныеВодителя(СсылкаНаОбъект, "УчСист");
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеВодителя, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()

	МодульОбъекта = ОбработкаОбъект();
	УдалитьПустыеЗначенияТелефоны();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	МодульОбъекта.СохранитьЗначения(СсылкаНаОбъект, ЗначенияДополнительныхСвойств, "СвВодит");
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПустыеЗначенияТелефоны()
	
	МассивПустыхТелефонов = Новый Массив;
	Для Каждого Телефон Из рл_Тлф Цикл
		Если Не ЗначениеЗаполнено(Телефон.Значение) Тогда
			МассивПустыхТелефонов.Добавить(Телефон);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПустойТелефон Из МассивПустыхТелефонов Цикл
		рл_Тлф.Удалить(ПустойТелефон);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы(ЗначениеРеквизита)
	
	ИнициализацияФормы();

	МодульОбъекта = ОбработкаОбъект();	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ДанныеВодителя = МодульОбъекта.ДесериализоватьXML(ЗначениеРеквизита);
	Иначе
		ДанныеВодителя = Новый Структура;
	КонецЕсли;

	Если ДанныеВодителя.Свойство("Ссылка") Тогда
		СсылкаНаОбъект = ДанныеВодителя.Ссылка;		
	КонецЕсли;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Элементы.ОбновитьПоСсылке.Видимость = Истина; 
	Иначе
		Элементы.ОбновитьПоСсылке.Видимость = Ложь; 
	КонецЕсли;
	
	МодульОбъекта.ЗаполнитьДанныеФормы(ДанныеВодителя, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()

	//ДопустимыеТипы = Новый Массив;
	//ДопустимыеТипы.Добавить(Тип("Строка"));
	//ЭтаФорма.рл_Тлф.ТипЗначения = Новый ОписаниеТипов(ДопустимыеТипы);		

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьАвтоОтметкуНезаполненногоОбязательныхПолей()
	
	МодульОбъекта = ОбработкаОбъект();
	ЗначенияДополнительныхСвойств = МодульОбъекта.ЗначенияДополнительныхСвойствПоФорме(ЭтаФорма);
	ДанныеВодителя = Новый Структура;
	МодульОбъекта.ЗаменитьСсылкиНаСтруктуры(ДанныеВодителя, ЗначенияДополнительныхСвойств);
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	ОбязательныеРеквизиты = Новый Массив;
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ОбязательныеРеквизиты.Добавить(РеквизитФормы.Имя);	
	КонецЦикла;
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Ложь, ОбязательныеРеквизиты);

	ПараметрыВалидацииВодителя = Новый Структура;
	МодульОбъекта.ПараметрыВалидацииВодителя(ПараметрыВалидацииВодителя, "СвВодит");
	ОбязательныеРеквизитыПоФормам = МодульОбъекта.РеквизитыОбязательныхПолейПоФормам(ДанныеВодителя, ДанныеВодителя, ПараметрыВалидацииВодителя.СвВодит);
	ОбязательныеРеквизиты = ОбязательныеРеквизитыФормы("ФормаВодителя", ОбязательныеРеквизитыПоФормам);
	
	ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Истина, ОбязательныеРеквизиты);

КонецПроцедуры

&НаСервере
Процедура ЗначениеАвтоОтметкаНезаполненногоОбязательныхПолей(Значение, ОбязательныеРеквизиты)
		
	Для Каждого ИмяРеквизита Из ОбязательныеРеквизиты Цикл
		Попытка
			Элементы[ИмяРеквизита].АвтоОтметкаНезаполненного = Значение;
			Элементы[ИмяРеквизита].ОтметкаНезаполненного = Значение;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбязательныеРеквизитыФормы(ИмяФормы, ОбязательныеРеквизитыПоФормам)
	
	Результат = Новый Массив;
	
	Если ТипЗнч(ОбязательныеРеквизитыПоФормам) = Тип("Структура")
		И ОбязательныеРеквизитыПоФормам.Свойство(ИмяФормы) Тогда
		Результат = ОбязательныеРеквизитыПоФормам[ИмяФормы];
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

