
// Описание для внедрения панели ошибок в свой документ см. в общем модуле КонтурЛогистика_ПанельОшибокКлиент

Процедура ПанельОшибокСвернутьРазвернуть(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	ПанельОшибокРазвернута = Элементы.ПанельОшибок.РастягиватьПоВертикали;
	
	Если ПанельОшибокРазвернута Тогда // сворачиваем
		
		Элементы.Переместить(Элементы.ПанельОшибок, Элементы.ПанельОшибокСвернутая);
		Элементы.ПанельОшибокСвернутьРазвернуть.Картинка = БиблиотекаКартинок.КонтурЛогистика_Развернуть;
		Элементы.ПанельОшибокСвернутьРазвернуть.Заголовок = "развернуть";
		Элементы.ПанельОшибок.РастягиватьПоВертикали = Ложь;
		
	Иначе // разворачиваем
		
		Элементы.Переместить(Элементы.ПанельОшибок, Элементы.ПанельОшибокРазвернутая);
		Элементы.ПанельОшибокСвернутьРазвернуть.Картинка = БиблиотекаКартинок.КонтурЛогистика_Свернуть;
		Элементы.ПанельОшибокСвернутьРазвернуть.Заголовок = "свернуть";
		Элементы.ПанельОшибок.РастягиватьПоВертикали = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереместитьЭлементы(Форма, Что, Куда) Экспорт
	
	Если Куда.ПодчиненныеЭлементы.Найти(Что.Имя) = Неопределено Тогда
		Форма.Элементы.Переместить(Что, Куда);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереместитьЭлементы2(Элементы, Что, Куда) Экспорт
	
	Элементы.Переместить(Что, Куда);
	
КонецПроцедуры

Функция ИнициализироватьТаблицуОшибок() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("ТекстОшибки", ТипСтрока);
	ТаблицаОшибок.Колонки.Добавить("Действие", ТипСтрока);
	ТаблицаОшибок.Колонки.Добавить("ИмяПоля", ТипСтрока);
	ТаблицаОшибок.Колонки.Добавить("ИмяТабличнойЧасти", ТипСтрока);
	ТаблицаОшибок.Колонки.Добавить("НомераСтрок", Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаОшибок.Колонки.Добавить("Скрыть", Новый ОписаниеТипов("Булево"));
	ТаблицаОшибок.Колонки.Добавить("ИдентификаторыСтрокДерева", Новый ОписаниеТипов("СписокЗначений"));
	ТаблицаОшибок.Колонки.Добавить("КатегорияНомерКартинки", Новый ОписаниеТипов("Число",
															 Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОшибок.Колонки.Добавить("КатегорияОшибки", Новый ОписаниеТипов("ПеречислениеСсылка.КонтурЛогистика_КатегорииОшибокОбъектов"));
	ТаблицаОшибок.Колонки.Добавить("ТребуемоеДействие", ТипСтрока);
	ТаблицаОшибок.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число",
												Новый КвалификаторыЧисла(2, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОшибок.Колонки.Добавить("ДополнительныеПараметры", Новый ОписаниеТипов("СписокЗначений"));
	Возврат ТаблицаОшибок;
	
КонецФункции

Функция ПолучитьРезультатПроверки(ТаблицаОшибок) Экспорт
	
	Успешно = Истина;
	
	КоличествоПредупреждений = 0;
	КоличествоОшибок = 0;
	КоличествоОшибокДиадок = 0;
	КоличествоОшибокДругойСтороны = 0;
	КоличествоОшибокКриптографии = 0;
	
	МассивПредупреждений = Новый Массив;
	МассивОшибок = Новый Массив;	
	МассивОшибокДиадок = Новый Массив;
	МассивОшибокКриптографии = Новый Массив;
	
	// Отсортируем ТаблицуОшибок По Приоритету
	ТаблицаОшибок.Сортировать("Приоритет Возр");
	
	Для Каждого Строка из ТаблицаОшибок Цикл
		
		Если Строка.КатегорияОшибки = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение Тогда
			
			МассивПредупреждений.Добавить(Строка.ТекстОшибки);
			КоличествоПредупреждений = КоличествоПредупреждений + 
							Макс(1, Строка.НомераСтрок.Количество() + Строка.ИдентификаторыСтрокДерева.Количество());
							
		ИначеЕсли Строка.КатегорияОшибки = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок Тогда
			
			МассивОшибокДиадок.Добавить(Строка.ТекстОшибки);
			КоличествоОшибокДиадок = КоличествоОшибокДиадок + 
							Макс(1, Строка.НомераСтрок.Количество() + Строка.ИдентификаторыСтрокДерева.Количество());
							
		ИначеЕсли Строка.КатегорияОшибки = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДругойСтороны Тогда
			
			МассивОшибокДиадок.Добавить(Строка.ТекстОшибки);
			КоличествоОшибокДругойСтороны = КоличествоОшибокДругойСтороны + 
							Макс(1, Строка.НомераСтрок.Количество() + Строка.ИдентификаторыСтрокДерева.Количество());
							
		ИначеЕсли Строка.КатегорияОшибки = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаКриптографии Тогда
			
			МассивОшибокКриптографии.Добавить(Строка.ТекстОшибки);
			КоличествоОшибокКриптографии = КоличествоОшибокКриптографии + 
							Макс(1, Строка.НомераСтрок.Количество() + Строка.ИдентификаторыСтрокДерева.Количество());
							
		Иначе // ошибка
		
			Успешно = Ложь;
			
			МассивОшибок.Добавить(Строка.ТекстОшибки);
			КоличествоОшибок = КоличествоОшибок + 
							Макс(1, Строка.НомераСтрок.Количество() + Строка.ИдентификаторыСтрокДерева.Количество());
							
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура(
			"Успешно, МассивПредупреждений, КоличествоПредупреждений, МассивОшибок, КоличествоОшибок, МассивОшибокДиадок, КоличествоОшибокДиадок, КоличествоОшибокДругойСтороны, КоличествоОшибокКриптографии", 
			 Успешно, МассивПредупреждений, КоличествоПредупреждений, МассивОшибок, КоличествоОшибок, МассивОшибокДиадок, КоличествоОшибокДиадок, КоличествоОшибокДругойСтороны, КоличествоОшибокКриптографии);	
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТабличнойЧасти, НомерСтроки, ИмяПоля, КатегорияОшибкиОбъекта, ТекстОшибки, Действие, ИдентификаторСтрокиДерева = Неопределено, Приоритет = Неопределено, ТребуемоеДействие = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	// Правила ПРИОРИТЕТОВ:
	// 1 - Наивысший, 99 - низший
	// с 1 по 49 - ошибки валидации
	// с 50 по 69 - ошибки ФГИС
	// с 70 по 99 - предупреждения
	
	Если Приоритет = Неопределено Тогда 
		Если КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка Тогда
			Приоритет = 49;
		ИначеЕсли КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок Тогда
			Приоритет = 50;
		Иначе
			Приоритет = 99;
		КонецЕсли;
	КонецЕсли;
	
	
	Если ИмяТабличнойЧасти = Неопределено Тогда
		ИмяТабличнойЧасти = "ДанныеШапкиДокумента";
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяПоля, ТекстОшибки");
	СтруктураОтбора.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	СтруктураОтбора.Вставить("ИмяПоля", ИмяПоля);
	СтруктураОтбора.Вставить("КатегорияОшибки", КатегорияОшибкиОбъекта);
	СтруктураОтбора.Вставить("ТекстОшибки", ТекстОшибки);
		
	СтрокиСОшибкой = ТаблицаОшибок.НайтиСтроки(СтруктураОтбора);
	Если СтрокиСОшибкой.Количество() = 0 Тогда
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.КатегорияОшибки = КатегорияОшибкиОбъекта;
		СтрокаОшибки.Приоритет = Приоритет;
		Если ТребуемоеДействие <> Неопределено Тогда 
			СтрокаОшибки.ТребуемоеДействие = СокрЛП(ТребуемоеДействие);
		КонецЕсли;
		
		Если КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка 
			Или КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДругойСтороны Тогда
			
			СтрокаОшибки.КатегорияНомерКартинки = 2;
			
		ИначеЕсли КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок Тогда
			
			СтрокаОшибки.КатегорияНомерКартинки = 4;
			
		ИначеЕсли КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаКриптографии Тогда
			
			СтрокаОшибки.КатегорияНомерКартинки = 5;
			
		Иначе // предупреждение
			
			СтрокаОшибки.КатегорияНомерКартинки = 1;
			
		КонецЕсли;
		
		СтрокаОшибки.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		Если НомерСтроки <> Неопределено Тогда
			СтрокаОшибки.НомераСтрок.Добавить(НомерСтроки);
		КонецЕсли;
		
		Если ИдентификаторСтрокиДерева <> Неопределено Тогда
			СтрокаОшибки.ИдентификаторыСтрокДерева.Добавить(ИдентификаторСтрокиДерева);
		КонецЕсли;
		
		СтрокаОшибки.ИмяПоля = ИмяПоля;
		СтрокаОшибки.ТекстОшибки = ТекстОшибки;
		СтрокаОшибки.Действие = Действие + " (1)";
				
		Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
			Для каждого ДопПараметр Из ДополнительныеПараметры Цикл
				СтрокаОшибки.ДополнительныеПараметры.Добавить(ДопПараметр);
			КонецЦикла;
		КонецЕсли;		
		
	Иначе
		
		НайденнаяСтрока = СтрокиСОшибкой.Получить(0);
		Если НомерСтроки <> Неопределено Тогда
			НайденнаяСтрока.НомераСтрок.Добавить(НомерСтроки);
		КонецЕсли;

		Если ИдентификаторСтрокиДерева <> Неопределено Тогда
			НайденнаяСтрока.ИдентификаторыСтрокДерева.Добавить(ИдентификаторСтрокиДерева);
		КонецЕсли;
		
		КоличествоСтрок = НайденнаяСтрока.НомераСтрок.Количество() + НайденнаяСтрока.ИдентификаторыСтрокДерева.Количество();
		
		НайденнаяСтрока.Действие = Действие + " (" + КоличествоСтрок + ")";
						
	КонецЕсли;
	
	ТаблицаОшибок.Сортировать("Приоритет Возр");
	
КонецПроцедуры

Функция УдалитьВТаблицеОшибок(ТаблицаОшибок, ИмяПоля) Экспорт
	
	СтрокиНаУдаление = Новый Массив;
	
	// Найдем строки на удаление
	Для Каждого ТекущаяСтрока Из ТаблицаОшибок Цикл
		
		ДлинаИмениПоля = СтрДлина(ИмяПоля);
		
		Если Лев(ТекущаяСтрока.ИмяПоля, ДлинаИмениПоля) = ИмяПоля Тогда
			СтрокиНаУдаление.Добавить(ТекущаяСтрока);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	// Удалим строки
	Для Каждого ТекущаяСтрока Из СтрокиНаУдаление Цикл
		ТаблицаОшибок.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецФункции

Процедура ПроверитьДиадокОшибки(Знач ДокументСсылка, ТаблицаОшибок) Экспорт
	
	КатегорияОшибкаДиадок = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок;
	ИмяТЧ = "Товары";
	ТекстОшибки = "";
		
	ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументСсылка);
	
	Если ФайлОбмена <> Неопределено Тогда 	
		СтрокиТоваровДокументаПоОшибке = Неопределено;
		
		Если ФайлОбмена.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.ОшибкаОтправки Тогда
			
			// когда будем раскладывать на табличку (в справочнике КонтурЛогистика_ФайлыОбмена появится табчасть с ошибками)
			// потребуется переписать на использоване этой талички
			//Для Каждого ОшибкаДиадок Из ФайлОбмена.ОшибкиДиадок Цикл 
			
			ТекстОшибки = ФайлОбмена.ОписаниеОшибок;
			// кроме этого ошибки могут ссылаться на конктретную строку табличной части документа
			
			//КонецЦикла;
			
		КонецЕсли;
		
		Отбор = Новый Структура("КатегорияОшибки", Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок);
		КолвоОшибокДД = ТаблицаОшибок.НайтиСтроки(Отбор).Количество();
		
		Если ЗначениеЗаполнено(ТекстОшибки) И КолвоОшибокДД = 0 Тогда 
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"Номер", КатегорияОшибкаДиадок, ТекстОшибки, "Переотправить");
			
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиОшибкуТекущегоТитула(Знач ДокументСсылка, ТаблицаОшибок) Экспорт
	
	КатегорияОшибкаДиадок = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДиадок;
	КатегорияОшибкаКриптографии = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаКриптографии;
	ТекстОшибки = "";
	
	СтрокаСтатуса = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатусРасширенный(ДокументСсылка);
	
	Если СтрокаСтатуса <> Неопределено Тогда
		
		// Проверяем что статус ошибка и есть описание ошибки
		Если СтрокаСтатуса.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка
			И (ЗначениеЗаполнено(СтрокаСтатуса.ТипОшибки)
				Или ЗначениеЗаполнено(СтрокаСтатуса.КодОшибки)
				Или ЗначениеЗаполнено(СтрокаСтатуса.ОписаниеОшибки)) Тогда
												
				Если ЗначениеЗаполнено(СтрокаСтатуса.ТипОшибки) 
					И СтрокаСтатуса.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаПодписи 
					И ЭтоОшибкаКриптопровайдера(СтрокаСтатуса.ОписаниеОшибки) Тогда
					
					Ошибка = ПолучитьОшибку(ДокументСсылка);
					
					Если ЗначениеЗаполнено(Ошибка) Тогда
						ТекстОшибки = Ошибка.ПредставлениеТипаОшибки;
					Иначе
						ТекстОшибки = СтрокаСтатуса.ПодробноеОписаниеОшибки;
					КонецЕсли
					
				Иначе
					
					Если ЗначениеЗаполнено(СтрокаСтатуса.ПодробноеОписаниеОшибки) Тогда
						ТекстОшибки = Строка(СтрокаСтатуса.ТипОшибки) + ": " + СтрокаСтатуса.КодОшибки + " " + СтрокаСтатуса.ПодробноеОписаниеОшибки;
					Иначе
						ТекстОшибки = Строка(СтрокаСтатуса.ТипОшибки) + ": " + СтрокаСтатуса.КодОшибки + " " + СтрокаСтатуса.ОписаниеОшибки;
					КонецЕсли;
					
				КонецЕсли;
				
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Если ЗначениеЗаполнено(СтрокаСтатуса.ТипОшибки) 
				И СтрокаСтатуса.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаПодписи
				И ЭтоОшибкаКриптопровайдера(СтрокаСтатуса.ОписаниеОшибки) Тогда
				
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
					"Номер", КатегорияОшибкаКриптографии, ТекстОшибки, "Исправить");
				
			Иначе
				
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
					"Номер", КатегорияОшибкаДиадок, ТекстОшибки, "Переотправить");
				
			КонецЕсли;				
						
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоОшибкаКриптопровайдера(ОписаниеОшибки)
	
	Если (Найти(ОписаниеОшибки, "Ошибка подписания Контур.Плагин") > 0
		Или Найти(ОписаниеОшибки, "Ошибка подписания менеджером криптографии") > 0)Тогда
		Возврат Истина;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОшибку(ДокументСсылка)
	
	ПодписантСтруктура 	= КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодписантСтруктура(ДокументСсылка);
					
	ДанныеОшибки = КонтурЛогистика_КриптографияСервер.ПолучитьДанныеОшибкиКриптографии(ДокументСсылка);
    											
	СертификатНаСервере = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта_КонтурЛогистика(ПодписантСтруктура.Сертификат, "СертификатНаСервере");
	ТипОшибки = КонтурЛогистика_КриптографияКлиентСервер.ТипОшибкиКриптографии(ДанныеОшибки.КодОшибки, СертификатНаСервере);
	
	ОшибкиКриптографии = КонтурЛогистика_КриптографияКлиентСервер.ОшибкиКриптографии();
	Ошибка = КонтурЛогистика_КриптографияКлиентСервер.ПолучитьОшибку(ТипОшибки, ОшибкиКриптографии);
	
	Возврат Ошибка;
	
КонецФункции

Процедура ПроверитьОшибкиПредыдущегоТитула(Знач ДокументСсылка, Знач ГлавныйДокумент, ТаблицаОшибок) Экспорт
	
	ТекТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ДокументСсылка);
	Предыдущийтитул = КонтурЛогистика_ОбработкаДокументовСервер.ПредыдущийТитулПоГлавномуИТекущемуТипу(ГлавныйДокумент, ТекТипЛогистика);
	
	Если ЗначениеЗаполнено(Предыдущийтитул) Тогда 
		
		Если ТипЗнч(Предыдущийтитул) = Тип("Массив")Тогда
		
			Для каждого Титул Из Предыдущийтитул Цикл
				
				ПроверитьОшибкиТитула(Титул, ТаблицаОшибок);	
				
			КонецЦикла;
			
		Иначе
			
			ПроверитьОшибкиТитула(Предыдущийтитул, ТаблицаОшибок);
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьОшибкиТитула(Титул, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	ТекстОшибки = "В предыдущем титуле ошибка: ";
		
	СтатусПредыдущегоТитулаРасширенный = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатусРасширенный(Титул);
		
	Если СтатусПредыдущегоТитулаРасширенный <> Неопределено
		И СтатусПредыдущегоТитулаРасширенный.Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		
			ВариантПроверкиПолномочийМЧД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ВариантПроверкиПолномочийМЧД");
			
			// Для проверки полномочий МЧД используем предупреждение, чтобы не блокировать работу
			Если СтатусПредыдущегоТитулаРасширенный.ТипОшибки = Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаМЧД 
				И СтатусПредыдущегоТитулаРасширенный.КодОшибки = КонтурЛогистика_МашиночитаемыеДоверенностиКлиентСервер.КодОшибкиСтатусаПолномочияМЧД() 
				И ВариантПроверкиПолномочийМЧД = Перечисления.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД.ПроверятьСПредупреждением Тогда
					
				КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
					
			КонецЕсли;
		
			ТекстОшибки = ТекстОшибки
				+ СтатусПредыдущегоТитулаРасширенный.ТипОшибки + ": "
				+ СтатусПредыдущегоТитулаРасширенный.КодОшибки + " "
				+ СтатусПредыдущегоТитулаРасширенный.ОписаниеОшибки;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"Номер", КатегорияОшибка, ТекстОшибки, "Проверить предыдущий");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОшибкиДругихСторон(Знач ДокументСсылка, ТаблицаОшибок) Экспорт
	
	КатегорияОшибкаДругойСтороны = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.ОшибкаДругойСтороны;
	ИмяТЧ = "Товары";
	ТекстОшибки = "";   
	
	НайденныйТитул = Неопределено;
	
	Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(ДокументСсылка) Тогда
		
		СостояниеДО = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ДокументСсылка.ДокументЭТрН, Истина);
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1") И СостояниеДО.Код = "r-rejected" Тогда 
			НайденныйТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2, ДокументСсылка.ДокументЭТРН);	
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул5") И СостояниеДО.Код = "c-rejected" Тогда
			НайденныйТитул = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул6, ДокументСсылка.ДокументЭТРН);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(НайденныйТитул) И НайденныйТитул.ЕстьОтказВПодписи Тогда 
			
			ТекстОшибки = "Причина отказа в подписи: " + НайденныйТитул.ПричинаОтказаВПодписи;
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ПричинаОтказаВПодписи", КатегорияОшибкаДругойСтороны, ТекстОшибки, "Переотправить");
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверитьПредупреждения(Знач ДокументСсылка, ТаблицаОшибок) Экспорт
	
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументСсылка);
	
	Если ФайлОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ФайлОбмена.ОписаниеПредупреждения) Тогда
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ПредупрежденияГИС", КатегорияПредупреждение, ФайлОбмена.ОписаниеПредупреждения, "Игнорировать");
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитСсылки(Объект, Реквизит) Экспорт

	Возврат Объект[Реквизит];	

КонецФункции

Функция ПолучитьИмяФормыИЗначение(Объект, Реквизит) Экспорт 
	
	Структура = Новый Структура("ИмяФормы, Значение", "", "");
	
	ЧастиПути = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазделитьСтроку(Реквизит, ".", Ложь);
	
	Значение = "";
	
	Для Каждого ЧастьПути Из ЧастиПути Цикл 
		
		Значение = Объект[ЧастьПути];

		Если ТипЗнч(Значение) = Тип("ДанныеФормыКоллекция") Тогда 
			Объект = Значение[0];
		Иначе
			Объект = Значение;
		КонецЕсли;		
		
	КонецЦикла;	
	
	Структура.Значение = Значение;
	
	Если Не Структура.Значение = Неопределено 
		И КонтурЛогистика_ОбщегоНазначенияСервер.ЭтоТипСсылка(ТипЗнч(Структура.Значение)) Тогда 
		
		ПолноеИмя = Структура.Значение.Метаданные().ПолноеИмя();
		
		Структура.ИмяФормы = ПолноеИмя + ".ФормаОбъекта";	
		
	КонецЕсли;	
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьОсновныеДанныеФайла(ДокументОбъектИлиСсылка) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ФайлыОбмена.ПолучитьОсновныеДанныеФайла(ДокументОбъектИлиСсылка);
	
КонецФункции

Процедура ПроверитьМЧД(ОрганизацияДиадок, Подписант) Экспорт
	
	Ответ = КонтурЛогистика_API_Диадок.Диадок_АПИ_PrevalidatePowerOfAttorney(ОрганизацияДиадок.ID, 
																			Подписант.МЧДСсылка, 
																			Подписант.Сертификат);		
																						
	Если Ответ.Свойство("PrevalidateStatus") Тогда
		
		ТекстСтатусаПроверки = "";
		СтатусПроверки = "";
		
		Если Ответ.PrevalidateStatus.Свойство("StatusText") Тогда
			ТекстСтатусаПроверки = Ответ.PrevalidateStatus.StatusText;	
		КонецЕсли;
		Если Ответ.PrevalidateStatus.Свойство("StatusNamedId") Тогда
			СтатусПроверки = Ответ.PrevalidateStatus.StatusNamedId;						
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Подписант.ДатаЗаписи);
		НаборЗаписей.Отбор.ОрганизацияДиадок.Установить(ОрганизацияДиадок);
		НаборЗаписей.Отбор.Пользователь1С.Установить(Подписант.Пользователь1С);
		НаборЗаписей.Отбор.СертификатНаСервере.Установить(Подписант.ЭтоСерверныйСертификат);
		НаборЗаписей.Отбор.ДопПараметр.Установить(Подписант.ДопПараметр);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() Тогда
			
			Запись = НаборЗаписей[0];						
			Запись.ТекстСтатусаПроверки = ТекстСтатусаПроверки;
			Запись.СтатусПроверки = СтатусПроверки;
			Запись.ДатаПроверки = ТекущаяДатаСеанса();
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИгнорироватьПредупреждение(ДокументОбъектИлиСсылка) Экспорт
	
	ФайлОбмена = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокументОбъектИлиСсылка.Ссылка);
	
	Если ФайлОбмена <> Неопределено Тогда
	
		ФайлОбменаОб = ФайлОбмена.ПолучитьОбъект();
		ФайлОбменаОб.ОписаниеПредупреждения = "";
		ФайлОбменаОб.Записать();
		
	КонецЕсли;
	
КонецПроцедуры