
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") 
		И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" Тогда
		УточнениеТипаЛогистика = ПараметрыВыполненияКоманды.Источник.ТипЛогистика;
	Иначе
		УточнениеТипаЛогистика = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1");
	КонецЕсли;
	
	ПараметрыВводаДокументов = Новый Структура("МассивДокументов, УточнениеТипаЛогистика", ПараметрКоманды, УточнениеТипаЛогистика);
	ИспользуетсяМногиеК1ЭПЛ = КонтурЛогистика_ОбщегоНазначенияКлиентПовтИсп.ЗначениеНастройки("ИспользуютсяМногиеКОдномуЭПЛ") = Истина;
	
	Если Не ИспользуетсяМногиеК1ЭПЛ Тогда 
		КонтурЛогистика_ОбщегоНазначенияКлиент.Предупреждение_КонтурЛогистика("Для использования этой команды необходимо включить общую настройку ""1 ЭПЛ из нескольких документов""");
		Возврат;
	КонецЕсли;
	
	ВвестиДокументЛогистикаПоДокументу1С(УточнениеТипаЛогистика, ПараметрыВводаДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиДокументЛогистикаПоДокументу1С(ТипЛогистикаДляДокумента, ПараметрыВводаДокументов) Экспорт
	
	ДокументСсылка = ПараметрыВводаДокументов.МассивДокументов[0];
	
	КонтурЛогистика_ОбработкаДокументовКлиент.ВвестиДокументЛогистикаПоДокументу1С(ТипЛогистикаДляДокумента, ДокументСсылка, ЭтотОбъект, ПараметрыВводаДокументов.МассивДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповеститьОВыполненииКоманды(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт

	Оповестить("КонтурЛогистика_ВвестиДокумент");

КонецПроцедуры

