#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура РассчитатьРазмерПриложения(Параметры, АдресРезультата) Экспорт
	
	РазмерПриложений.РассчитатьРазмерПриложения();
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт

	Методы.Вставить("РассчитатьРазмерПриложения", Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли