&НаКлиенте 
#Если НЕ ТолстыйКлиентОбычноеПриложение Тогда
	Перем _ЛокКонтекст Экспорт;
#КонецЕсли

&НаКлиенте 
Перем ПредыдущееЗначение;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовка = НСтр("be = 'Cleverence: Налада друку этыкетак для табліцы [%1]'; en = 'Cleverence: Setting up label printing for table [%1]'; es = 'Cleverence: Configuración de impresión de etiquetas para tabla [%1]'; ka = 'Cleverence: ეტიკეტების ბეჭდვის პარამეტრები [%1] ცხადისთვის'; kk = 'Cleverence: [%1] кестесі үшін этикеттерді басу орнату'; ro = 'Cleverence: Configurarea tipăririi etichetelor pentru tabelul [%1]'; ru = 'Клеверенс: Настройка печати этикеток для таблицы [%1]'; tr = 'Cleverence: [%1] tablosu için etiketlerin yazdırma ayarları'; uk = 'Cleverence: Налаштування друку етикеток для таблиці [%1]'; uz = 'Cleverence: [%1] jadvali uchun etiketlarni chop etishni sozlash'");
	ТекстЗаголовка = _ЛокКонтекст.ЛокЯдро_СтрШаблон(ТекстЗаголовка, СокрЛП(ИмяТаблицы));
	Заголовок = ТекстЗаголовка;
	
	НастройкиПечатиЭтикеток = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиПечатиЭтикеток", Истина);
	Если НастройкиПечатиЭтикеток = Неопределено Тогда
		СтруктураНастроек = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеТабличнойНастройкиНаСервереSMARTS("НастройкиПечатиЭтикеток", Новый Структура("ИмяТаблицы", ИмяТаблицы));
	Иначе
		СтруктураНастроек = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(НастройкиПечатиЭтикеток, Новый Структура("ИмяТаблицы", ИмяТаблицы));
	КонецЕсли;
	
	Если СтруктураНастроек <> Неопределено Тогда
		ШаблонЭтикетки  = ?(СтруктураНастроек[0].Свойство("ШаблонЭтикетки"), СтруктураНастроек[0].ШаблонЭтикетки, Неопределено);
		ВстроенныйМакет = ?(СтруктураНастроек[0].Свойство("ВстроенныйМакет"), СтруктураНастроек[0].ВстроенныйМакет, Ложь);
		ЗаполнитьТаблицуЗначениямиНастройки(СтруктураНастроек[0].НастройкаПечатиМассивСтруктур);
	КонецЕсли;
	
	ОбновитьСписокВстроенныхМакетов();
	ОграничитьТипШаблонаЭтикетки();
	ОбновитьСписокПолейШаблона();
	ОбновитьСписокПроизвольныхКодов();
	
	ТаблицаГлобальныхПараметров = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаЗначениеТабличнойНастройкиSMARTS("ГлобальныеПараметры", Новый Структура());
	Если ТипЗнч(ТаблицаГлобальныхПараметров) = Тип("Массив") Тогда 
		Для Каждого СтрокаПараметра Из ТаблицаГлобальныхПараметров Цикл
		    Если СтрокаПараметра.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			СписокГлобальныхПараметров.Добавить(СтрокаПараметра.ID_Параметра, СтрокаПараметра.Наименование);
		КонецЦикла;
	КонецЕсли;	
	
	СписокТиповИсточника.Добавить("Реквизит1С", 		  НСтр("be = 'Рэквізіт 1С'; en = '1C Attribute'; es = 'Atributo de 1C'; ka = '1C რეკვიზიტი'; kk = '1С реквизиті  '; ro = 'Atribut 1C'; ru = 'Реквизит 1С'; tr = '1C Özelliği'; uk = 'Атрибут 1С'; uz = '1C attributi  '"));
	СписокТиповИсточника.Добавить("ГлобальныйПараметр",   НСтр("be = 'Глабальны параметр'; en = 'Global parameter'; es = 'Parámetro global'; ka = 'გლობალური პარამეტრი'; kk = 'Құрылымдық параметр'; ro = 'Parametru global'; ru = 'Глобальный параметр'; tr = 'Genel parametre'; uk = 'Глобальний параметр'; uz = 'Global parametr'"));	
	СписокТиповИсточника.Добавить("ПроизвольноеЗначение", НСтр("be = 'Давольная велічыня'; en = 'Arbitrary value'; es = 'Valor arbitrario'; ka = 'შემუშავების მნიშვნელობა'; kk = 'Өзге мән'; ro = 'Valoare arbitrară'; ru = 'Произвольное значение'; tr = 'Rastgele Değer'; uk = 'Довільне значення'; uz = 'Tasodifiy qiymat'"));	
	СписокТиповИсточника.Добавить("ПроизвольныйКод", 	  НСтр("be = 'Давольны код'; en = 'Arbitrary code'; es = 'Código arbitrario'; ka = 'შემუშავების კოდი'; kk = 'Өзге код'; ro = 'Cod arbitrar'; ru = 'Произвольный код'; tr = 'Rastgele Kod'; uk = 'Довільний код'; uz = 'Tasodifiy kodi'"));	
	
	ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовТипИсточникаСиноним.СписокВыбора, СписокТиповИсточника);
	ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовПрЗначение.СписокВыбора, 		  СписокПолейШаблона);
	
	Для Каждого Реквизит Из ТаблицаРеквизитов Цикл
		Реквизит.ПрЗначение = Реквизит.СинонимПриемника;
		Реквизит.ИсЗначение = ?(Реквизит.ТипИсточника = "ПроизвольноеЗначение", Реквизит.ЗначениеИсточника, Реквизит.СинонимИсточника);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОсновныеДействияФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
 	Сохранить("");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОП = Новый ОписаниеОповещения("СохранитьПослеПодключения", ЭтаФорма);
	_ЛокКонтекст.ЛокЯдро_ПроверитьСоединениеССерверомSMARTS(, , Ложь, , , , ОП); 	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
    СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ШаблонЭтикетки",					ШаблонЭтикетки);
	СтруктураНастройки.Вставить("ВстроенныйМакет",					ВстроенныйМакет);
	СтруктураНастройки.Вставить("НастройкаПечатиМассивСтруктур",	 _ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПолучитьАдресТаблицыРеквизитов()));
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкиВФайл(СтруктураНастройки, "НастройкиПечатиЭтикеток");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтаФорма);
	
	_ЛокКонтекст.ЛокЯдро_ПолучитьНастройкиИзФайла("НастройкиПечатиЭтикеток", ОповещениеОЗавершении);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(СтруктураНастроек, ДополнительныеПараметры) Экспорт

	Если СтруктураНастроек <> Неопределено Тогда
		ШаблонЭтикетки  = СтруктураНастроек.ШаблонЭтикетки;
		ВстроенныйМакет = СтруктураНастроек.ВстроенныйМакет;
		ЗаполнитьТаблицуЗначениямиНастройки(СтруктураНастроек.НастройкаПечатиМассивСтруктур);
		ОграничитьТипШаблонаЭтикетки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПослеПодключения(СерверДоступен,ДопПараметры) Экспорт
	
	Если Не СерверДоступен = Истина Тогда
		ОповещениеСохранитьНастройкиВФайл = Новый ОписаниеОповещения("ПредложитьПользователюСохранитьНастройкиВФайлЗавершение", ЭтаФорма);
		ТекстВопроса = НСтр("be = 'У гэты момант сервер Cleverence недаступны для захавання налад'; en = 'Currently, the Cleverence server is unavailable for saving settings.'; es = 'En este momento el servidor de Cleverence no está disponible para guardar las configuraciones'; ka = 'Cleverence სერვერი ამჟამად არ არის ხელმისაწვდომი პარამეტრების შენახვისთვის.'; kk = 'В данный момент сервер Cleverence недоступен для сохранения настроек - Ағымдағы Cleverence сервері параметрлерді сақтау үшін қол жетімді емес'; ro = 'În acest moment, serverul Cleverence nu este disponibil pentru salvarea setărilor'; ru = 'В данный момент сервер Клеверенс недоступен для сохранения настроек.'; tr = 'Şu anda Cleverence sunucusu ayarların kaydedilmesi için kullanılamıyor.'; uk = 'У данний момент сервер Cleverence недоступний для збереження налаштувань.'; uz = 'Hozirgi paytda Cleverence serveri sozlamalarni saqlash uchun mavjud emas.'")
						+ Символы.ПС
						+ НСтр("be = 'Захаваць налады ў файл?'; en = 'Save settings to file?'; es = '¿Guardar ajustes en archivo?'; ka = 'პარამეტრების შენახვა ფაილში?'; kk = 'Параметрлерді файлға сақтау керек пе?'; ro = 'Salvați setările în fișier?'; ru = 'Сохранить настройки в файл?'; tr = 'Ayarları dosyaya kaydetmek istiyor musunuz?'; uk = 'Зберегти налаштування в файл?'; uz = 'Созламаларни файлга сақлаш керакми?  '");
		ПоказатьВопрос(ОповещениеСохранитьНастройкиВФайл, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьПользователюСохранитьНастройкиВФайлЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	 
	СохранитьВФайл("");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеНастройки(Команда)
	
	ТаблицаРеквизитов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьЗначениеФлажков(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьЗначениеФлажков(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПоУмолчанию(Команда)
	
	Если ТаблицаРеквизитов.Количество() Тогда
		ОповещениеПредупреждениеЗавершение = Новый ОписаниеОповещения("ЗагрузитьНастройкиПоУмолчаниюЗавершение", ЭтаФорма);
		ТекстВопроса = НСтр("be = 'Бягучыя налады будуць страчаныя! Перазапісаць іх?'; en = 'Current settings will be lost! Overwrite them?'; es = '¡Se perderán los ajustes actuales! ¿Desea sobrescribirlos?'; ka = 'მიმდინარი პარამეტრები დაკარგულია! გსურთ მათი გადაყვანა?'; kk = 'Ағымдағы орнатулар жоқ болады! Оларды қайта жазу керек пе?'; ro = 'Setările curente vor fi pierdute! Doriți să le suprascrieți?'; ru = 'Текущие настройки будут утеряны! Перезаписать их?'; tr = 'Geçerli ayarlar kaybolacak! Üzerine yazmak istiyor musunuz?'; uk = 'Поточні налаштування будуть втрачені! Перезаписати їх?'; uz = 'Жорий созламалар йўқ бўлади! Уларни ўчиришга рози бўласизми?'");
		ПоказатьВопрос(ОповещениеПредупреждениеЗавершение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , _ЛокКонтекст.ЛокЯдро_ТекстВнимание()); 
	Иначе
		ЗагрузитьНастройкиПоУмолчаниюВыполнить();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ШаблонЭтикеткиПриИзменении(Элемент)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ШаблонЭтикетки = ?(ВстроенныйМакет, ШаблонЭтикеткиСтрока, ШаблонЭтикеткиСправочник);
	#КонецЕсли
	
	Если ШаблонЭтикетки <> ПредыдущееЗначение Тогда
		ОбновитьСписокПолейШаблона();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиОчистка(Элемент, СтандартнаяОбработка)
	
    ОбновитьСписокПолейШаблона();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЭтикеткиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПредыдущееЗначение = ШаблонЭтикетки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВстроенныйМакетПриИзменении(Элемент)

	ШаблонЭтикетки = Неопределено;
	
	ОграничитьТипШаблонаЭтикетки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура ТаблицаРеквизитовПередНачаломИзменения(Элемент, Отказ)
	
	ОбновитьВидимостьЭлементовСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовПрЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;	
	
	НайденныйЭлементСписка = СписокПолейШаблона.НайтиПоЗначению(ТекущаяСтрока.ПрЗначение);
	
	Если НайденныйЭлементСписка = Неопределено Тогда
		ТекущаяСтрока.ИмяПриемника 		= "";
		ТекущаяСтрока.СинонимПриемника 	= "";
	Иначе
		ТекущаяСтрока.ИмяПриемника		= НайденныйЭлементСписка.Значение;
		ТекущаяСтрока.СинонимПриемника 	= НайденныйЭлементСписка.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовТипИсточникаСинонимПриИзменении(Элемент)
	
    ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	НайденныйЭлементСписка = СписокТиповИсточника.НайтиПоЗначению(ТекущаяСтрока.ТипИсточникаСиноним);
	
	Если НайденныйЭлементСписка <> Неопределено Тогда
		ТекущаяСтрока.ТипИсточникаСиноним = НайденныйЭлементСписка.Представление;
	КонецЕсли;
	
	Если НайденныйЭлементСписка <> Неопределено И НайденныйЭлементСписка.Значение <> ПредыдущееЗначение Тогда
		ТекущаяСтрока.ТипИсточника 		= НайденныйЭлементСписка.Значение;
		ТекущаяСтрока.ИмяИсточника 		= "";
		ТекущаяСтрока.СинонимИсточника 	= "";
		ТекущаяСтрока.ЗначениеИсточника = Неопределено;
		ТекущаяСтрока.ИсЗначение 		= Неопределено;
	КонецЕсли;
	
	ТекСтрока = Элементы.ТаблицаРеквизитов.ТекущаяСтрока;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ТаблицаРеквизитов.ТекущаяСтрока 	= ТекСтрока;
	#Иначе
		Элементы.ТаблицаРеквизитов.ТекущаяСтрока 	= Неопределено;
		Элементы.ТаблицаРеквизитов.ТекущаяСтрока 	= ТекСтрока;
		Элементы.ТаблицаРеквизитов.ТекущийЭлемент 	= Элемент;
	#КонецЕсли
	
	ОбновитьВидимостьЭлементовСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовТипИсточникаСинонимНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ТипИсточника;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовИсЗначениеПриИзменении(Элемент)
	
    ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение" Тогда
		ТекущаяСтрока.ИмяИсточника 		= "";
		ТекущаяСтрока.СинонимИсточника 	= "";
		ТекущаяСтрока.ЗначениеИсточника = ТекущаяСтрока.ИсЗначение;
		ОбновитьВидимостьЭлементовСтроки();
	Иначе	
		НайденныйЭлементСписка = Неопределено;
		Если ТекущаяСтрока.ТипИсточника = "Реквизит1С" Тогда
			НайденныйЭлементСписка = СписокРеквизитов1С.НайтиПоЗначению(ТекущаяСтрока.ИсЗначение);
		ИначеЕсли ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
			НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(ТекущаяСтрока.ИсЗначение);
		ИначеЕсли ТекущаяСтрока.ТипИсточника = "ГлобальныйПараметр" Тогда
			НайденныйЭлементСписка = СписокГлобальныхПараметров.НайтиПоЗначению(ТекущаяСтрока.ИсЗначение);			
		КонецЕсли;
		Если НайденныйЭлементСписка <> Неопределено И НайденныйЭлементСписка.Значение = ПредыдущееЗначение Тогда
			ТекущаяСтрока.СинонимИсточника = НайденныйЭлементСписка.Представление;
		Иначе
			ТекущаяСтрока.ИмяИсточника 		= ?(НайденныйЭлементСписка <> Неопределено, НайденныйЭлементСписка.Значение, "");
			ТекущаяСтрока.СинонимИсточника 	= ?(НайденныйЭлементСписка <> Неопределено, НайденныйЭлементСписка.Представление, "");
			ТекущаяСтрока.ЗначениеИсточника = Неопределено;
		КонецЕсли;
		ТекущаяСтрока.ИсЗначение = ?(НайденныйЭлементСписка <> Неопределено, НайденныйЭлементСписка.Представление, "");
		
		ТекСтрока = Элементы.ТаблицаРеквизитов.ТекущаяСтрока;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = ТекСтрока;
		#Иначе
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = Неопределено;
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = ТекСтрока;
			Элементы.ТаблицаРеквизитов.ТекущийЭлемент = Элемент;
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовИсЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
		СтандартнаяОбработка = Ложь;
		ПредыдущееЗначение = ТекущаяСтрока.ИмяИсточника;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаСписка_ПроизвольныеКоды = ПолучитьФорму("ОФ_ФормаСписка_ПроизвольныеКоды", ЭтаФорма);
		#Иначе
			ФормаСписка_ПроизвольныеКоды = ПолучитьФорму(_ЛокКонтекст.ПолноеИмяОбъекта + ".Форма.ФормаСписка_ПроизвольныеКоды", , ЭтаФорма, ЭтаФорма);
			ФормаСписка_ПроизвольныеКоды.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		#КонецЕсли
		
		ОП = Новый ОписаниеОповещения("ФормаСписка_ПроизвольныеКодыЗакрытие", ЭтаФорма, ПредыдущееЗначение);
		
		ФормаСписка_ПроизвольныеКоды._ЛокКонтекст 					= _ЛокКонтекст;
		ФормаСписка_ПроизвольныеКоды.КлючНастройки 					= КлючНастройки;
		ФормаСписка_ПроизвольныеКоды.ПравилаОбменаШапка 			= СписокРеквизитов1СВМассивСтруктур();
		ФормаСписка_ПроизвольныеКоды.ОписаниеОповещенияОЗакрытии 	= ОП;
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ФормаСписка_ПроизвольныеКоды.ОткрытьМодально();
		#Иначе
			ФормаСписка_ПроизвольныеКоды.Открыть();
		#КонецЕсли
				
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение" Тогда
		 Элементы.ТаблицаРеквизитовИсЗначение.ВыбиратьТип = ТекущаяСтрока.ИсЗначение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовИсЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ПредыдущееЗначение = ТекущаяСтрока.ИмяИсточника;
	Элемент.СписокВыбора.Очистить();
	
	Элементы.ТаблицаРеквизитовИсЗначение.СписокВыбора.Очистить();
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ТаблицаРеквизитовИсЗначение.КнопкаСпискаВыбора = ?(НЕ ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение",Истина,Неопределено);
	#Иначе
		Элементы.ТаблицаРеквизитовИсЗначение.КнопкаВыпадающегоСписка = ?(НЕ ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение",Истина,Неопределено);
	#КонецЕсли
	
	Элементы.ТаблицаРеквизитовИсЗначение.КнопкаОчистки = ТекущаяСтрока.ТипИсточника = "ПроизвольноеЗначение";
	
	Если ТекущаяСтрока.ТипИсточника = "Реквизит1С" Тогда
		ЗаполнитьСписокВыбора(Элемент.СписокВыбора, СписокРеквизитов1С);
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ПроизвольныйКод" Тогда
		ЗаполнитьСписокВыбора(Элемент.СписокВыбора, СписокПроизвольныхКодов);
	ИначеЕсли ТекущаяСтрока.ТипИсточника = "ГлобальныйПараметр" Тогда
		ЗаполнитьСписокВыбора(Элемент.СписокВыбора, СписокГлобальныхПараметров);		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовИсЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.ЗначениеИсточника 	= Неопределено;
	Элементы.ТаблицаРеквизитов.ТекущиеДанные.ИсЗначение 		= Неопределено;
	Элементы.ТаблицаРеквизитовИсЗначение.ВыбиратьТип 			= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеМеханизмы

&НаКлиенте
Процедура СохранитьНастройки()

	НастройкиПечатиЭтикеток = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиПечатиЭтикеток", Истина);
	Если НастройкиПечатиЭтикеток = Неопределено Тогда
		НастройкиПечатиЭтикеток = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS("НастройкиПечатиЭтикеток");
	КонецЕсли;
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("ИмяТаблицы",						ИмяТаблицы);
	СтруктураНастройки.Вставить("ШаблонЭтикетки",					ШаблонЭтикетки);
	СтруктураНастройки.Вставить("ВстроенныйМакет",					ВстроенныйМакет);
	СтруктураНастройки.Вставить("НастройкаПечатиМассивСтруктур",	_ЛокКонтекст.ЛокЯдро_ТаблицуЗначенийВМассивСтруктур(ПолучитьАдресТаблицыРеквизитов()));
	
	Если ТипЗнч(НастройкиПечатиЭтикеток) <> Тип("Массив") Тогда
		НастройкиПечатиЭтикеток = Новый Массив;
		НастройкиПечатиЭтикеток.Добавить(СтруктураНастройки);
	Иначе
		СтрокиДляЗаполнения = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(НастройкиПечатиЭтикеток, Новый Структура("ИмяТаблицы", ИмяТаблицы));
		Если СтрокиДляЗаполнения = Неопределено Тогда
			НастройкиПечатиЭтикеток.Добавить(СтруктураНастройки);
		Иначе
			Для Каждого СтрокаНастройки Из СтрокиДляЗаполнения Цикл
				Для каждого КлючЗначение Из СтруктураНастройки Цикл
					СтрокаНастройки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;		
		
	//Создадим описание структуры массива		
	Если НастройкиПечатиЭтикеток[0].Свойство("ЭтоТаблицаЗначений") = Ложь Тогда	
		ПеречислениеКолонок = "";
		Для Каждого Свойство Из СтруктураНастройки Цикл
			ПеречислениеКолонок = ПеречислениеКолонок + ?(ПеречислениеКолонок = "", "", ",") + Свойство.Ключ;
		КонецЦикла;
		СтрокаОписания = Новый Структура("ЭтоТаблицаЗначений,КолонкиТаблицыЗначений", Истина, ПеречислениеКолонок);
		НастройкиПечатиЭтикеток.Вставить(0, СтрокаОписания);
	КонецЕсли;
	
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("НастройкиПечатиЭтикеток", НастройкиПечатиЭтикеток);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("НастройкиПечатиЭтикеток", НастройкиПечатиЭтикеток);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПоУмолчаниюВыполнить()
	
	// Получение пользовательских настроек
	ПользовательскиеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаНастройкуSMARTS("НастройкиПечатиЭтикеток", Истина);
	Если ПользовательскиеНастройки = Неопределено Тогда
		ПользовательскиеНастройки = _ЛокКонтекст.ЛокЯдро_ПолучитьНастройкуНаСервереSMARTS("НастройкиПечатиЭтикеток");
	КонецЕсли;
	
	// Удаление пользовательских настроек
	_ЛокКонтекст.ЛокЯдро_УдалитьНастройкуВБазеSMARTS("НастройкиПечатиЭтикеток");
	
	// Получение настройки по умолчанию
	СтруктураНастроек = _ЛокКонтекст.ЛокЯдро_ПолучитьЗначениеТабличнойНастройкиНаСервереSMARTS("НастройкиПечатиЭтикеток", Новый Структура("ИмяТаблицы", ИмяТаблицы));
	
	СтруктураНастройки = Неопределено;
	Если ТипЗнч(СтруктураНастроек) = Тип("Массив")
		И НЕ СтруктураНастроек.Количество() = 0 Тогда
		СтруктураНастройки = СтруктураНастроек[0];
	КонецЕсли;
	
	Если СтруктураНастройки <> Неопределено Тогда
		// Замена пользовательской настроки на настройку по умолчанию
		СтрокиДляЗаполнения = _ЛокКонтекст.ЛокЯдро_НайтиВМассивеСтруктурПоОтбору(ПользовательскиеНастройки, Новый Структура("ИмяТаблицы", ИмяТаблицы));
		Для Каждого СтрокаНастройки Из СтрокиДляЗаполнения Цикл
			Для каждого КлючЗначение Из СтруктураНастройки Цикл
				СтрокаНастройки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Сообщение = НСтр("be = 'Налады па змаўчанню не знойдзены'; en = 'Default settings not found'; es = 'Configuración predeterminada no encontrada'; ka = 'ნაგულისხმევი პარამეტრები ვერ მოიძებნა'; kk = 'Әдепкі параметрлер табылмады'; ro = 'Setările implicite nu au fost găsite'; ru = 'Настройки по умолчанию не найдены'; tr = 'Varsayılan ayarlar bulunamadı'; uk = 'Налаштування за замовчуванням не знайдені'; uz = 'Sukut sozlamalari topilmadi'");
		Сообщить(Сообщение, СтатусСообщения.Внимание); 
	КонецЕсли;
	
	// Восстановление пользовательских настроек
	_ЛокКонтекст.ЛокЯдро_СохранитьНастройкуВБазеSMARTS("НастройкиПечатиЭтикеток", ПользовательскиеНастройки);
	_ЛокКонтекст.ЛокЯдро_ЗаписатьВКэшНастройкуSMARTS("НастройкиПечатиЭтикеток", ПользовательскиеНастройки);
	
	Если СтруктураНастройки <> Неопределено Тогда
		ШаблонЭтикетки  = ?(СтруктураНастройки.Свойство("ШаблонЭтикетки"), СтруктураНастройки.ШаблонЭтикетки, Неопределено);
		ВстроенныйМакет = ?(СтруктураНастройки.Свойство("ВстроенныйМакет"), СтруктураНастройки.ВстроенныйМакет, Ложь);
		ЗаполнитьТаблицуЗначениямиНастройки(СтруктураНастроек[0].НастройкаПечатиМассивСтруктур);
		ОграничитьТипШаблонаЭтикетки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуЗначениямиНастройки(ЗначениеНастройки)
	
	ТаблицаРеквизитов.Очистить();
	
	Если НЕ ЗначениеНастройки = Ложь И ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		НужноСохранить = Ложь;
		Для Каждого СтрокаНастройки Из ЗначениеНастройки Цикл
			Если СтрокаНастройки.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТаблицаРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
			Если НЕ СтрокаНастройки.Свойство("Выгружать") Тогда
				СтрокаНастройки.Вставить("Выгружать", Истина);
				НужноСохранить = Истина;
			КонецЕсли;
		КонецЦикла;	
		
		Колонки = _ЛокКонтекст.ЛокЯдро_РазложитьСтрокуВМассивПодстрок(ЗначениеНастройки[0].КолонкиТаблицыЗначений, ",");
		Если Колонки.Найти("Выгружать") = Неопределено Тогда
			ЗначениеНастройки[0].КолонкиТаблицыЗначений = ЗначениеНастройки[0].КолонкиТаблицыЗначений + ",Выгружать";
			НужноСохранить = Истина;
		КонецЕсли;
		Если НужноСохранить Тогда
			СохранитьНастройки();	
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВстроенныхМакетов()

	Если НЕ СписокВстроенныхМакетов.Количество() Тогда
		СписокВстроенныхМакетов.Добавить("Номенклатура",	"Этикетка номенклатуры");
		СписокВстроенныхМакетов.Добавить("Серия",			"Этикетка серии");
		СписокВстроенныхМакетов.Добавить("Ячейка",			"Этикетка ячейки");
		СписокВстроенныхМакетов.Добавить("Цена",			"Ценник номенклатуры");  
		СписокВстроенныхМакетов.Добавить("ДляИнвентаризации","Карточка для инвентаризации");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьТипШаблонаЭтикетки()

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ШаблонЭтикеткиСтрока 	 = 
			?(ЗначениеЗаполнено(ШаблонЭтикетки) И ВстроенныйМакет, 
			ШаблонЭтикетки, 
			Неопределено);
		ШаблонЭтикеткиСправочник = 
			?(ЗначениеЗаполнено(ШаблонЭтикетки) И НЕ ВстроенныйМакет,
			ШаблонЭтикетки,
			?(ЗначениеЗаполнено(СправочникШаблоныЭтикеток), Справочники[СправочникШаблоныЭтикеток].ПустаяСсылка(), Неопределено));
		
		Элементы.ШаблонЭтикеткиСтрока.Видимость 	= ВстроенныйМакет;
		Элементы.ШаблонЭтикеткиСправочник.Видимость = НЕ ВстроенныйМакет;
			
		ИмяЭлементаСтрока 		= "ШаблонЭтикеткиСтрока";
		ИмяЭлементаСправочник 	= "ШаблонЭтикеткиСправочник";
	#Иначе
		ИмяЭлементаСтрока 		= "ШаблонЭтикетки";
		ИмяЭлементаСправочник 	= "ШаблонЭтикетки";	
	#КонецЕсли
	
	Если НЕ ВстроенныйМакет Тогда
		Если НЕ ЗначениеЗаполнено(СправочникШаблоныЭтикеток) Тогда
			МетаданныеНСИ = _ЛокКонтекст.ЛокЯдро_ПолучитьМетаданныеНСИ();
			МетаданныеШаблоныЭтикеток = ?(ТипЗнч(МетаданныеНСИ) = Тип("Структура") И МетаданныеНСИ.Свойство("ШаблоныЭтикеток"), МетаданныеНСИ.ШаблоныЭтикеток, Неопределено);
			Если МетаданныеШаблоныЭтикеток <> Неопределено Тогда
				СправочникШаблоныЭтикеток = МетаданныеШаблоныЭтикеток.ИмяСправочника;	
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СправочникШаблоныЭтикеток) Тогда
			Элементы[ИмяЭлементаСправочник].ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка." + СправочникШаблоныЭтикеток);
		Иначе
			Элементы[ИмяЭлементаСправочник].ОграничениеТипа = Новый ОписаниеТипов(ПолучитьТипВсеСправочники());
		КонецЕсли;
		Элементы[ИмяЭлементаСправочник].РежимВыбораИзСписка = Ложь;
		Элементы[ИмяЭлементаСправочник].СписокВыбора.Очистить();
	Иначе
		Элементы[ИмяЭлементаСтрока].ОграничениеТипа 	= Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50));
		Элементы[ИмяЭлементаСтрока].РежимВыбораИзСписка = Истина;
		ЗаполнитьСписокВыбора(Элементы[ИмяЭлементаСтрока].СписокВыбора, СписокВстроенныхМакетов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипВсеСправочники()

	МассивТипов = Новый Массив;
	
	Для каждого Справочник Из Метаданные.Справочники Цикл
		МассивТипов.Добавить(Тип("СправочникСсылка." + СтрЗаменить(Справочник.ПолноеИмя(), "Справочник.", "")));
	КонецЦикла;

	Возврат МассивТипов;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокПолейШаблона()

	Если ЗначениеЗаполнено(ШаблонЭтикетки) Тогда
		
		МакетЭтикетки = Неопределено;
		
		ПоляШаблонаИзИнтеграционнойОбработки = Неопределено;
		Если НЕ ВстроенныйМакет Тогда
			ПоляШаблонаИзИнтеграционнойОбработки = _ЛокКонтекст.ЛокЯдро_ПолучитьСписокПолейШаблона(Новый Структура("Шаблон", ШаблонЭтикетки));
		Иначе
			МакетОбработки = _ЛокКонтекст.ЛокЯдро_ПолучитьМакетОбработки("Этикетка" + СокрЛП(ШаблонЭтикетки));
			Если ТипЗнч(МакетОбработки) = Тип("ТабличныйДокумент") Тогда
				МакетЭтикетки = МакетОбработки;
			КонецЕсли;			
		КонецЕсли;	
			
		Если ПоляШаблонаИзИнтеграционнойОбработки = Неопределено Тогда
			ОбновитьСписокПолейШаблонаПоУмолчанию(МакетЭтикетки);
		Иначе
			СписокПолейШаблона = ПоляШаблонаИзИнтеграционнойОбработки.Скопировать();
		КонецЕсли;
	КонецЕсли;
	
	СписокПолейШаблона.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПолейШаблонаПоУмолчанию(МакетЭтикетки) 

	СписокПолейШаблона.Очистить();
	
	// Получение макета этикетки
	Если НЕ ВстроенныйМакет Тогда	
		МакетЭтикетки = ПолучитьМакетЭтикеткиПоЭлементуСправочника();	
	КонецЕсли;
		
	// Получение списка параметров
	Если МакетЭтикетки <> Неопределено Тогда
		Для Строка = 1 ПО МакетЭтикетки.ВысотаТаблицы  Цикл
			Для Колонка = 1 ПО МакетЭтикетки.ШиринаТаблицы  Цикл
				Ячейка = МакетЭтикетки.Область(Строка, Колонка);
				Если Ячейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон	Тогда
					МассивПараметров = _ЛокКонтекст.ЛокЯдро_ПозицииПараметровШаблона(Ячейка.Текст);
					КоличествоПараметров = МассивПараметров.Количество();
					Для Индекс = 0 По КоличествоПараметров - 1 Цикл
						Структура = МассивПараметров[КоличествоПараметров - 1 - Индекс];
							
						ИмяПараметра = Сред(Ячейка.Текст, Структура.Начало + 1, Структура.Конец - Структура.Начало - 1);
						Если СписокПолейШаблона.НайтиПоЗначению(ИмяПараметра) = Неопределено Тогда
							СписокПолейШаблона.Добавить(ИмяПараметра, ИмяПараметра);	
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли Ячейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
					ИмяПараметра = Ячейка.Параметр;
					Если СписокПолейШаблона.НайтиПоЗначению(ИмяПараметра) = Неопределено Тогда
						СписокПолейШаблона.Добавить(ИмяПараметра, ИмяПараметра);	
					КонецЕсли;						
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ИмяПараметраШтрихкод  = "Штрихкод";
		ИмяПараметраКодВалюты = "ВидЦены.ВалютаЦены.Код";
		
		// Вставляем в параметры штрихкод
		Для Каждого Рисунок Из МакетЭтикетки.Рисунки Цикл
			Если _ЛокКонтекст.ЛокЯдро_СтрНайти(Рисунок.Имя, ИмяПараметраШтрихкод) = 1 Тогда
				Если СписокПолейШаблона.НайтиПоЗначению(ИмяПараметраШтрихкод) = Неопределено Тогда
					СписокПолейШаблона.Добавить(ИмяПараметраШтрихкод, ИмяПараметраШтрихкод);
				КонецЕсли;
			КонецЕсли;
			Если _ЛокКонтекст.ЛокЯдро_СтрНайти(Рисунок.Имя, "ЗнакВалюты") = 1 Тогда
				Если СписокПолейШаблона.НайтиПоЗначению(ИмяПараметраКодВалюты) = Неопределено Тогда
					СписокПолейШаблона.Добавить(ИмяПараметраКодВалюты, ИмяПараметраКодВалюты);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетЭтикеткиПоЭлементуСправочника()
	
	СтруктураШаблона = Неопределено;
	МакетЭтикетки 	 = Неопределено;
	
	РеквизитыСправочника = ШаблонЭтикетки.Метаданные().Реквизиты;
	Если РеквизитыСправочника.Найти("Шаблон") <> Неопределено 
		И ТипЗнч(ШаблонЭтикетки.Шаблон) = Тип("ХранилищеЗначения") Тогда
		СтруктураШаблона = ШаблонЭтикетки.Шаблон.Получить();
	Иначе
	    Для каждого Реквизит ИЗ РеквизитыСправочника Цикл
			Если Реквизит.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
				СтруктураШаблона = ШаблонЭтикетки[Реквизит.Имя].Получить();
				Если СтруктураШаблона <> Неопределено Тогда
					Прервать;					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
			
	Если СтруктураШаблона <> Неопределено
		И ТипЗнч(СтруктураШаблона) = Тип("Структура") Тогда
		Если СтруктураШаблона.Свойство("РедакторТабличныйДокумент") Тогда
			МакетЭтикетки = СтруктураШаблона.РедакторТабличныйДокумент;	
		Иначе	
			Для каждого КлючЗначение ИЗ СтруктураШаблона Цикл
				Если ТипЗнч(КлючЗначение.Значение) = Тип("ТабличныйДокумент") Тогда
					МакетЭтикетки = КлючЗначение.Значение;
					Прервать;						
				КонецЕсли;					
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Возврат МакетЭтикетки;
	
КонецФункции
	
&НаКлиенте 
Процедура ОбновитьСписокПроизвольныхКодов()
	
	Отбор = Новый Структура("Направление,ТипОбъекта", "Настройка", "ПечатьЭтикеток");
	ЗаполнитьСписокПроизвольныхКодов("СписокПроизвольныхКодов", Отбор);
	
КонецПроцедуры

&НаКлиенте 
Процедура ЗаполнитьСписокПроизвольныхКодов(ИмяСписка, Отбор)
		
	ЭтаФорма[ИмяСписка].Очистить();
	
	ТаблицаПроизвольныхКодов = _ЛокКонтекст.ЛокЯдро_ПолучитьИзКэшаЗначениеТабличнойНастройкиSMARTS("ПроизвольныеКоды", Отбор);
	
	Если ТаблицаПроизвольныхКодов <> Ложь И ТипЗнч(ТаблицаПроизвольныхКодов) = Тип("Массив") Тогда
		Для Каждого СтрокаТЗ Из ТаблицаПроизвольныхКодов Цикл
			Если СтрокаТЗ.Свойство("ЭтоТаблицаЗначений") Тогда
				Продолжить;
			КонецЕсли;
			ЭтаФорма[ИмяСписка].Добавить(СтрокаТЗ.ID_ПроизвольногоКода, СтрокаТЗ.Наименование);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтаФорма[ИмяСписка].Количество() = 0 Тогда
		ЭтаФорма[ИмяСписка].Добавить("");
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбора(Приемник, Список)
	
	Если ТипЗнч(Список) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлементСписка Из Список Цикл
			Приемник.Добавить(ЭлементСписка.Значение, ЭлементСписка.Ключ);	
		КонецЦикла;
		Приемник.СортироватьПоЗначению();
	Иначе
		Для Каждого ЭлементСписка Из Список Цикл
			Приемник.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицыРеквизитов()

	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Возврат ПоместитьВоВременноеХранилище(ТаблицаРеквизитов, Новый УникальныйИдентификатор());
	#Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаРеквизитов");
		Возврат ПоместитьВоВременноеХранилище(ТЗ, ЭтаФорма.УникальныйИдентификатор);
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовСтроки()
	
	ТекДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Элементы.ТаблицаРеквизитовИсЗначение.СписокВыбора.Очистить();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ТаблицаРеквизитовИсЗначение.КнопкаСпискаВыбора = ?(НЕ ТекДанные.ТипИсточника = "ПроизвольноеЗначение", Истина, Ложь);
	#Иначе
		Элементы.ТаблицаРеквизитовИсЗначение.КнопкаВыпадающегоСписка = ?(НЕ ТекДанные.ТипИсточника = "ПроизвольноеЗначение", Истина, Неопределено);
	#КонецЕсли
	
	Элементы.ТаблицаРеквизитовИсЗначение.РежимВыбораИзСписка 	= ?(НЕ (ТекДанные.ТипИсточника = "ПроизвольноеЗначение"), Истина, Ложь);
	Элементы.ТаблицаРеквизитовИсЗначение.КнопкаОчистки 			= ТекДанные.ТипИсточника = "ПроизвольноеЗначение";
	Элементы.ТаблицаРеквизитовИсЗначение.ВыбиратьТип 			= ТекДанные.ИсЗначение = Неопределено И ТекДанные.ТипИсточника = "ПроизвольныйКод";
	
	Если ТекДанные.ТипИсточника = "Реквизит1С" Тогда
		ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовИсЗначение.СписокВыбора, СписокРеквизитов1С);
	ИначеЕсли ТекДанные.ТипИсточника = "ПроизвольныйКод" Тогда 
		ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовИсЗначение.СписокВыбора, СписокПроизвольныхКодов);
	ИначеЕсли ТекДанные.ТипИсточника = "ГлобальныйПараметр" Тогда 
		ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовИсЗначение.СписокВыбора, СписокГлобальныхПараметров);
	КонецЕсли;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Элементы.ТаблицаРеквизитовПрЗначение.КнопкаСпискаВыбора = Истина; // НЕ ТекДанные.ТипПриемника = "НовыйРеквизит";
	#Иначе
		Элементы.ТаблицаРеквизитовПрЗначение.КнопкаВыпадающегоСписка = Истина; // НЕ ТекДанные.ТипПриемника = "НовыйРеквизит";
	#КонецЕсли

	Элементы.ТаблицаРеквизитовПрЗначение.СписокВыбора.Очистить();
	
	ЗаполнитьСписокВыбора(Элементы.ТаблицаРеквизитовПрЗначение.СписокВыбора, СписокПолейШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлажков(Значение)
	
	Для Каждого СтрокаРеквизитов Из ТаблицаРеквизитов Цикл
		СтрокаРеквизитов.Выгружать = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКорректностьЗаполненияПолей()

	КонтрольПройден = Истина;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ТЗ = ТаблицаРеквизитов;
	#Иначе
		ТЗ = РеквизитФормыВЗначение("ТаблицаРеквизитов");
	#КонецЕсли
	
	МассивПроверяемыхКолонок = Новый Массив;
	МассивПроверяемыхКолонок.Добавить("ПрЗначение");
	МассивПроверяемыхКолонок.Добавить("ТипИсточникаСиноним");
	МассивПроверяемыхКолонок.Добавить("ИсЗначение");
	
	ОтмеченныеСтроки = ТЗ.НайтиСтроки(Новый Структура("Выгружать", Истина));
	Для каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
	
		Для Каждого ПроверяемаяКолонка Из МассивПроверяемыхКолонок Цикл
			ПроверяемоеЗначение = ОтмеченнаяСтрока[ПроверяемаяКолонка];
			Если Не ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда
				#Если Не ТолстыйКлиентОбычноеПриложение Тогда
					ЭлементФормы = ЭтаФорма.Элементы.Найти("ТаблицаРеквизитов" + ПроверяемаяКолонка);
					Если ЭлементФормы <> Неопределено Тогда
						Заголовок = ЭлементФормы.Заголовок;
					Иначе
						Заголовок = ПроверяемаяКолонка;
					КонецЕсли;
					
					Сообщение = Новый СообщениеПользователю;
					Текст = НСтр("be = 'Не запоўнена значэнне ў калонцы %1'; en = 'Value is not filled in column %1'; es = 'No se ha completado el valor en la columna %1'; ka = 'შესავსები არ არის კოლონკა %1-ში'; kk = '%1 бағанды толтыруға болмайды'; ro = 'Valoarea nu este completată în coloana %1'; ru = 'Не заполнено значение в колонке %1'; tr = '%1 sütununda değer doldurulmadı'; uk = 'Не заповнено значення в колонці %1'; uz = '%1 ustunida qiymat kiritilmagan'");
					Текст = РеквизитФормыВЗначение("Объект").ГлЯдро_СтрШаблон(Текст, Заголовок);
					Сообщение.Текст = Текст;
					Сообщение.Поле = "ТаблицаРеквизитов[" + ТЗ.Индекс(ОтмеченнаяСтрока) + "]." + ПроверяемаяКолонка;
					Сообщение.УстановитьДанные(ЭтаФорма);
					Сообщение.Сообщить(); 
				#Иначе
					НомерСтроки = ТЗ.Индекс(ОтмеченнаяСтрока) + 1;
					ТекстПредупреждения = НСтр("be = 'Не запоўнена значэнне ў калонцы %1 у радку %2'; en = 'Value is not filled in column %1 in row %2'; es = 'No se ha completado el valor en la columna %1 en la fila %2'; ka = 'შესავსები არ არის კოლონკა %1-ში, სტრიქონში %2-ში'; kk = '%1 бағанды толтыруға болмайды, %2 жолда'; ro = 'Valoarea nu este completată în coloana %1, în rândul %2'; ru = 'Не заполнено значение в колонке %1 в строке %2'; tr = '%2 satırındaki %1 sütununda değer doldurulmadı'; uk = 'Не заповнено значення в колонці %1 в рядку %2'; uz = '%2 qatorida %1 ustunida qiymat kiritilmagan'");
					ТекстПредупреждения = _ЛокКонтекст.ЛокЯдро_СтрШаблон(ТекстПредупреждения, ТЗ.Колонки[ПроверяемаяКолонка].Заголовок, НомерСтроки);
					ПоказатьПредупреждение(, ТекстПредупреждения); 
				#КонецЕсли
				КонтрольПройден = Ложь;
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат КонтрольПройден;
	
КонецФункции

&НаКлиенте
Функция СписокРеквизитов1СВМассивСтруктур()
	
	МассивСтруктур = Новый Массив;
	
	Для каждого Реквизит1С ИЗ СписокРеквизитов1С Цикл
		
		НоваяСтруктура = Новый Структура;
		
		НоваяСтруктура.Вставить("ТипИсточника", 				"Реквизит1С");
		НоваяСтруктура.Вставить("ИмяИсточника", 				"Реквизит1С");
		НоваяСтруктура.Вставить("ИмяПриемника", 				Реквизит1С.Значение);
		НоваяСтруктура.Вставить("СинонимИсточника", 			Реквизит1С.Значение);
		НоваяСтруктура.Вставить("СпособСопоставленияСиноним", 	"Как есть (простой тип)");
		
		МассивСтруктур.Добавить(НоваяСтруктура);	
		
	КонецЦикла;
		
	Возврат МассивСтруктур;	
		
КонецФункции

#КонецОбласти

#Область ОписанияОповещений

&НаКлиенте
Процедура ФормаСписка_ПроизвольныеКодыЗакрытие(ВыбранноеЗначение,ПредыдущееЗначение) Экспорт
	
	ОбновитьСписокПроизвольныхКодов();
	
	Если ВыбранноеЗначение = Неопределено Тогда
		НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(ПредыдущееЗначение);
	Иначе 
		НайденныйЭлементСписка = СписокПроизвольныхКодов.НайтиПоЗначению(ВыбранноеЗначение);
	КонецЕсли;
	ТекущаяСтрока = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	Если НайденныйЭлементСписка = Неопределено Тогда
		ТекущаяСтрока.ИмяИсточника 		= "";
		ТекущаяСтрока.СинонимИсточника 	= "";
		ТекущаяСтрока.ИсЗначение 		= Неопределено;
	Иначе
		ТекущаяСтрока.ИмяИсточника 		= НайденныйЭлементСписка.Значение;
		ТекущаяСтрока.СинонимИсточника 	= НайденныйЭлементСписка.Представление;
		ТекущаяСтрока.ИсЗначение 		= НайденныйЭлементСписка.Представление;
		
		ТекСтрока = Элементы.ТаблицаРеквизитов.ТекущаяСтрока;
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = ТекСтрока;
		#Иначе
			Элемент = Элементы.ТаблицаРеквизитов.ТекущийЭлемент;
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = Неопределено;
			Элементы.ТаблицаРеквизитов.ТекущаяСтрока = ТекСтрока;
			Элементы.ТаблицаРеквизитов.ТекущийЭлемент = Элемент;
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПоУмолчаниюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗагрузитьНастройкиПоУмолчаниюВыполнить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если ТолстыйКлиентОбычноеПриложение Тогда
	ПолноеИмяОбъекта = ЭтотОбъект.Метаданные().ПолноеИмя();
	Элементы = Новый Структура();
	Для каждого Элемент ИЗ ЭлементыФормы Цикл
		Элементы.Вставить(Элемент.Имя, Элемент);
		Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
			Для каждого Колонка ИЗ Элемент.Колонки Цикл
				Элементы.Вставить(Колонка.Имя, Колонка.ЭлементУправления);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Объект = ЭтотОбъект;
#КонецЕсли