Функция КорневаяФабрикаXDTO(Формат = Неопределено) Экспорт
	
	Если Формат = неопределено Тогда
		
		Формат = ФорматОбмена();
		Если Формат = неопределено Тогда
			ВызватьИсключение "Неизвестен формат для корневой фабрики";
		КонецЕсли;
		
		Возврат КорневаяФабрикаXDTO(Формат);
		
	Иначе
		
		Возврат КонтурЛогистика_КонструкторыXDTO.КорневаяФабрикаXDTOКонтурЛогистика(Формат);
		
	КонецЕсли;
	
КонецФункции

Функция ФорматОбмена(ТипДокумента = Неопределено) Экспорт
	
	// Появится зависимость от типа документа
	Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда
		Возврат "1.01";
	ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ_5_02(ТипДокумента) Тогда
		Возврат "5.02";
	Иначе
		Возврат "5.01";
	КонецЕсли;
	
КонецФункции

Функция ФорматОбменаУведомленийОбУточнении() Экспорт
	
	Возврат "1.03";
	
КонецФункции

Функция ИдентификаторУчастникаЭДО(ОрганизацияДиадок) Экспорт
	
	Возврат ОрганизацияДиадок.ИдентификаторУчастникаЭДО;	
	
КонецФункции

Функция ТелефоныПереадресующего(ОрганизацияСсылка) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефоныПереадресующего(ОрганизацияСсылка)
	
КонецФункции 

Функция ПодсистемаКакРасширение() Экспорт
	
	ЭтоРасширение = Ложь;
	
	Попытка
		ЭтоРасширение = Метаданные.Подсистемы.КонтурЛогистика.РасширениеКонфигурации() <> Неопределено; // метод появился в 8.3.8
	Исключение
		ЭтоРасширение = Ложь;
	КонецПопытки;
	
	Возврат ЭтоРасширение;
			
КонецФункции

Функция ПодсистемаКакРасширениеСОпределяемымиТипами() Экспорт
	
	Результат = Ложь;
	
	Попытка
		
		Расширение = Метаданные.Подсистемы.КонтурЛогистика.РасширениеКонфигурации();
		
		Если Расширение <> Неопределено Тогда
			
			// на 8.3.10 и ниже нет конструктора - поэтому без компиляции
			МетаданныеРасширения = Вычислить("Новый ОбъектМетаданныхКонфигурация(Расширение.ПолучитьДанные())");
			
			Результат = МетаданныеРасширения.ОпределяемыеТипы.Количество() > 0;
			
		КонецЕсли;
		
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
			
КонецФункции

Функция ПолучитьТаблицуНастроекПоУмолчанию() Экспорт
	
	Возврат Справочники.КонтурЛогистика_Настройки.ТаблицаНастроекПоУмолчанию();
	
КонецФункции

Функция ПолучитьТаблицуУпаковокПоУмолчанию() Экспорт
	
	ТаблицаУпаковок = Новый ТаблицаЗначений;
	ТаблицаУпаковок.Колонки.Добавить("Наименование", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(150));
	ТаблицаУпаковок.Колонки.Добавить("Код", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(2));
	
	Макет = Справочники.КонтурЛогистика_КлассификаторУпаковок.ПолучитьМакет("ЗначенияПоУмолчанию");
	Область = Макет.ПолучитьОбласть("Упаковки");
			
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		НоваяУпаковка = ТаблицаУпаковок.Добавить();
		
		НоваяУпаковка.Код 			= СокрЛП(Область.ПолучитьОбласть("R" + Сч + "C1").ТекущаяОбласть.Текст);
		НоваяУпаковка.Наименование 	= СокрЛП(Область.ПолучитьОбласть("R" + Сч + "C2").ТекущаяОбласть.Текст);
		
	КонецЦикла;
		
	Возврат ТаблицаУпаковок;
	
КонецФункции

Функция ПолучитьТаблицуОписанияОпасныхГрузов() Экспорт
	
	ОписанияОпасныхГрузов = Новый ТаблицаЗначений;
	ОписанияОпасныхГрузов.Колонки.Добавить("НомерООН", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(7));
	ОписанияОпасныхГрузов.Колонки.Добавить("НадлежащееОтгрузочноеНаименование", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(1000));
	ОписанияОпасныхГрузов.Колонки.Добавить("Класс", Новый ОписаниеТипов("ПеречислениеСсылка.КонтурЛогистика_КлассыОпасностиГрузов"));
	ОписанияОпасныхГрузов.Колонки.Добавить("КлассификационныйКод", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(50));
	ОписанияОпасныхГрузов.Колонки.Добавить("ГруппаУпаковки", Новый ОписаниеТипов("ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки"));
	ОписанияОпасныхГрузов.Колонки.Добавить("ЗнакОпасности", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(50));
	ОписанияОпасныхГрузов.Колонки.Добавить("КодОграниченияТуннели", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(50));
	
	Макет = Справочники.КонтурЛогистика_ОписанияОпасныхГрузов.ПолучитьМакет("КлассификаторДОПОГ");
	Область = Макет.ПолучитьОбласть("Строки");
	
	Для Счет = 1 По Область.ВысотаТаблицы Цикл
		
		СчетСтрока = Формат(Счет, "ЧГ=");
		
		НовоеОписание = ОписанияОпасныхГрузов.Добавить();
		
		НомерСтрока = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C1").ТекущаяОбласть.Текст);
		НовоеОписание.НомерООН = "UN " + КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ДополнитьСтроку_(НомерСтрока, 4, "0");
		НовоеОписание.НадлежащееОтгрузочноеНаименование = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C2").ТекущаяОбласть.Текст);
		
		ЗначениеКласса = СтрЗаменить(СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C3").ТекущаяОбласть.Текст), ",", ".");
		НовоеОписание.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.ЗначениеИзXDTO(ЗначениеКласса);
		
		НовоеОписание.КлассификационныйКод = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C4").ТекущаяОбласть.Текст);
		
		ГруппаУпаковкиСтрока = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C5").ТекущаяОбласть.Текст);
		Если ГруппаУпаковкиСтрока = "-" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Отсутствует;
		ИначеЕсли ГруппаУпаковкиСтрока = "I" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа1;
		ИначеЕсли ГруппаУпаковкиСтрока = "II" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа2;
		ИначеЕсли ГруппаУпаковкиСтрока = "III" Тогда
			НовоеОписание.ГруппаУпаковки = Перечисления.КонтурЛогистика_ГруппыУпаковки.Группа3;
		КонецЕсли;
		
		НовоеОписание.ЗнакОпасности = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C6").ТекущаяОбласть.Текст);
		НовоеОписание.КодОграниченияТуннели = СокрЛП(Область.ПолучитьОбласть("R" + СчетСтрока + "C18").ТекущаяОбласть.Текст);
		
	КонецЦикла;
	
	Возврат ОписанияОпасныхГрузов;
	
КонецФункции

Функция ПолучитьТаблицуРегионовРФ() Экспорт
	
	ТаблицаРегионов = Новый ТаблицаЗначений;
	ТаблицаРегионов.Колонки.Добавить("Наименование", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(150));
	ТаблицаРегионов.Колонки.Добавить("Код", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(2));
	
	Макет = ПолучитьОбщийМакет("КонтурЛогистика_КодыРегионов");
	Область = Макет.ПолучитьОбласть("Данные");
			
	Для Сч = 1 По Область.ВысотаТаблицы Цикл
		
		НоваяУпаковка = ТаблицаРегионов.Добавить();
		
		НоваяУпаковка.Код 			= СокрЛП(Область.ПолучитьОбласть("R" + Сч + "C1").ТекущаяОбласть.Текст);
		НоваяУпаковка.Наименование 	= СокрЛП(Область.ПолучитьОбласть("R" + Сч + "C2").ТекущаяОбласть.Текст);
		
	КонецЦикла;
		
	Возврат ТаблицаРегионов;
	
КонецФункции

Функция ПолучитьТекущегоПользователя1С() Экспорт
	
	Результат = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПолучитьТекущегоПользователя1С");
	
	Если НЕ Результат=Неопределено Тогда
		
		Возврат Результат;
		
	Иначе
		
		Если КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьКонфигурацию() = "ТКПТ" Тогда
			ТекПользователь = Неопределено;
			Выполнить ("ТекПользователь = обОпределитьТекущегоПользователя()");
			Возврат ТекПользователь;
		Иначе
			Возврат ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

Функция ОпределитьКонфигурацию() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ОпределитьКонфигурацию();

КонецФункции

Функция ЗначениеПеречисления(ИмяПеречисления, ИмяЗначения) Экспорт
	
	ШаблонПеречисления = "Перечисление.КонтурЛогистика_%1.%2";
	ПолноеИмя = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку_(
					ШаблонПеречисления, 
					ИмяПеречисления, 
					ИмяЗначения);
			
	ЗначениеНастройки  = ПредопределенноеЗначение(ПолноеИмя);
	
	Возврат ЗначениеНастройки;	
	
КонецФункции

Функция ЗначениеНастройки(ИмяНастройки, Партнер = Неопределено) Экспорт

	Возврат Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки(ИмяНастройки, Партнер);	

КонецФункции

Функция СписокЗначенийНастройки(ИмяНастройки) Экспорт

	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.СписокЗначенийНастройки(ИмяНастройки);	

КонецФункции

Функция ЗначениеНастройкиОрганизацииДиадок(ОргДДСсылка, Настройка) Экспорт
	
	текЗнач = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеНастройки(ОргДДСсылка, Настройка);
	Возврат текЗнач;
	
КонецФункции

Функция ЗначениеНастройкиПартнера(ПартнерСсылка, НастройкаПартнераИлиОбщая) Экспорт
	
	текЗнач = Справочники.КонтурЛогистика_Партнеры.ЗначениеНастройки(ПартнерСсылка, НастройкаПартнераИлиОбщая);
	Возврат текЗнач;
	
КонецФункции

Функция ЗначениеСлужебнойНастройкиОрганизацииДиадок(ОргДДСсылка, Настройка) Экспорт
	
	текЗнач = Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗначениеСлужебнойНастройки(ОргДДСсылка, Настройка);
	Возврат текЗнач;
	
КонецФункции

Функция ПереносНастроекОрганизацииВыполнен(Настройка = Неопределено) Экспорт
	
	текЗнач = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПереносНастроекВыполнен(Настройка);
	Возврат текЗнач;
	
КонецФункции

Функция ПодробноеПредставлениеОрганизацииДиадок(ОрганизацияДиадок) Экспорт
	
	ПредставлениеОрганизации = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ОрганизацияДиадок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Наименование КАК Наименование,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН КАК ИНН,
	|	КонтурЛогистика_ОрганизацииДиадок.ТелефонОсновной КАК ТелефонОсновной
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка = &ОрганизацияДиадок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПредставлениеОрганизации = СокрЛП(Выборка.Наименование) + ", ИНН: " + СокрЛП(Выборка.ИНН);
		
		Если ЗначениеЗаполнено(Выборка.ТелефонОсновной) Тогда
			ПредставлениеОрганизации = ПредставлениеОрганизации + ", телефон: " + СтрЗаменить(Выборка.ТелефонОсновной, " ", "");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредставлениеОрганизации;
	
КонецФункции

Функция ПолучитьНастройку_(ИмяНастройки, ПробоватьСоздаватьПриОтсутствии = Истина) Экспорт
	
	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(ИмяНастройки, ПробоватьСоздаватьПриОтсутствии);
	
КонецФункции

Функция ПолучитьИмяСправочникаСущности(ИмяСущности) Экспорт

	Если ИмяСущности = "Характеристика" И Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.КонфигурацияПоддерживаетХарактеристики() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Справочники.КонтурЛогистика_Настройки.ПолучитьИмяСправочникаСущности(ИмяСущности);

КонецФункции 

Функция ИспользуютсяХарактеристики() Экспорт
	
	Возврат ЗначениеНастройки("ИспользуютсяХарактеристики");
	
КонецФункции

Функция ПолучитьТипыЗначенияДокумента1С(ТипДокументаЛогистика, БезУчетаНастроекСвязей = Истина) Экспорт

	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьТипыЗначенияДокумента1С(ТипДокументаЛогистика, БезУчетаНастроекСвязей);
	
КонецФункции 

Функция ТипДокументаСтрокойПоТипуЛогистика(ТипЛогистика) Экспорт

	Возврат "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);

КонецФункции // ТипДокументаПоТипуЛогистика()

Функция ТипДокументаСтрокойПоСсылкеНаДокумент(ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда 
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));
		Возврат ОбъектМетаданных.Имя;
		
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

Функция ТипПроксиСтрокойПоСсылке(ТипПрокси) Экспорт
	
	Возврат Перечисления.КонтурЛогистика_ТипыПрокси.ТипПроксиСтрокой(ТипПрокси);
	
КонецФункции

Функция ЛогистическийТипПоТипуДокумента(ТипДокументаСтрокой) Экспорт
	
	ТипДокумента = Тип("ДокументСсылка." + ТипДокументаСтрокой);
	
	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЛогистическийТипПоТипуДокумента(ТипДокумента);
	
КонецФункции

Функция НастройкиСвязиДокументов(ТипДокументаЛогистики) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиСвязейДокументов.НастройкиСвязиДокументов(ТипДокументаЛогистики);
	
КонецФункции

Функция ПолучитьНастройкуКонвертации(ТипДокументаЛогистика, ТипДокумента1С_СтрокаИлиТипИлиСсылка = Неопределено, СпецСценарий = Неопределено) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ТипДокументаЛогистика, ТипДокумента1С_СтрокаИлиТипИлиСсылка, СпецСценарий);
	
КонецФункции

Функция ПолучитьНастройкуКонвертацииПустойТипДокумента1С(ТипДокументаЛогистика) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертацииПустойТипДокумента1С(
		ТипДокументаЛогистика);
	
КонецФункции

Функция МассивНастроекКонвертацииПоТипуЛогистики(ТипДокументаЛогистика) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.МассивНастроекКонвертацииПоТипуЛогистики(ТипДокументаЛогистика);
	
КонецФункции

Функция ПолучитьНастройкуКонвертацииТ1РучногоВвода(ТипЛогистика) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	               |ГДЕ
	               |	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика = &ТипДокументаЛогистика
	               |	И КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокумента1С = """"
	               |	И НЕ КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления
				   |	И КонтурЛогистика_НастройкиКонвертацииДокументов.Родитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТипДокументаЛогистика", ТипЛогистика);
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуНастроекКонвертацииСправочниковПоУмолчанию(ТипСправочникаЛогистика = Неопределено, 
																ТипСправочника1С = Неопределено, 
																ТипДокументаОснования = Неопределено, 
																РеквизитТитула = Неопределено,
																ИмяМакета = Неопределено,
																ИмяКонфигурации = Неопределено) Экспорт
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьТаблицуНастроекКонвертацииСправочниковПоУмолчанию(ТипСправочникаЛогистика, 
																																ТипСправочника1С, 
																																ТипДокументаОснования, 
																																РеквизитТитула,
																																ИмяМакета,
																																ИмяКонфигурации);
КонецФункции

Функция ПолучитьТаблицуНастроекКонвертацииДокументововПоУмолчанию(ТипДокументаЛогистика = Неопределено, ТипДокумента1С = Неопределено, ЭтоНовый = Ложь) Экспорт
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьТаблицуНастроекКонвертацииДокументововПоУмолчанию(ТипДокументаЛогистика, ТипДокумента1С, ЭтоНовый);
КонецФункции

Функция ПолучитьТаблицуОписанияРеквизитовСправочника(ИмяСправочника) Экспорт
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ПолучитьТаблицуОписанияРеквизитовСправочника(ИмяСправочника);
КонецФункции

Функция ЭтоОтладкаНаСервереПараметрЗапуска() Экспорт

	#Если Сервер Или ВнешнееСоединение Тогда
		Попытка
	
			ПараметрЗапускаПриложения = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ПараметрЗапуска");
			Возврат Найти(ПараметрЗапускаПриложения, "РежимОтладки") > 0;
	
		Исключение
	
			Возврат Ложь;
	
		КонецПопытки;
	#Иначе
		Возврат Ложь;
	#КонецЕсли

КонецФункции

Функция ПолучитьВсеТипыНастроенныхУчетныхДокументовСтроками() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьВсеТипыНастроенныхУчетныхДокументовСтроками();	
	
КонецФункции

Функция ПолучитьВсеТипыНастроенныхУчетныхДокументовТипами() Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПолучитьВсеТипыНастроенныхУчетныхДокументовТипами();	
	
КонецФункции

Функция ПолучитьВсеТипыДокументовКонтурЛогистикаТипами() Экспорт
	
	МассивЛогистическихТиповДокументов = Новый Массив;
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул1"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул3"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул5"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул6"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул7"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул8"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул1"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул2"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул3"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗН_Титул4"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулПВ"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулГО"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_СВ_ТитулГП"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул1"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЗЗ_Титул2"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул2"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул3"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул4"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул5"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул6"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ДФ_Титул1"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ДФ_Титул2"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ЭкспедиторскаяРасписка"));
	
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул2_5_02"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул3_5_02"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул4_5_02"));
	МассивЛогистическихТиповДокументов.Добавить(Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул5_5_02"));
	
	Возврат МассивЛогистическихТиповДокументов;
	
КонецФункции

Функция ЕстьДочерниеНастройкиКонвертации(НастройкаКонвертацииДокументаСсылка) Экспорт
	
	Возврат ПолучитьМассивДочернихНастроекКонвертации(НастройкаКонвертацииДокументаСсылка).Количество() > 0;
	
КонецФункции

Функция ПолучитьМассивДочернихНастроекКонвертации(НастройкаКонвертацииДокументаСсылка) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьМассивДочернихНастроекКонвертации(НастройкаКонвертацииДокументаСсылка);
	
КонецФункции

Функция ПолучитьМассивТитуловОформляемыхТекущимПользователем() Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьМассивТитуловОформляемыхТекущимПользователем();
	
КонецФункции

Функция СвязиДокументовПоТитулам() Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиСвязейДокументов.СвязиДокументовПоТитулам();
	
КонецФункции

Функция МенеджерФоновыхЗаданийДоступен() Экспорт

	Попытка
	
		//@skip-warning
		МенеджерФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", "ТестРаботоспособностиМенеджераФЗ"));
		Возврат Истина;
	
	Исключение
		
		Возврат Ложь;
	
	КонецПопытки;

КонецФункции

Функция ЗагрузитьСостоянияДО() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_СостоянияДвиженияДокументооборота.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_СостоянияДвиженияДокументооборота КАК КонтурЛогистика_СостоянияДвиженияДокументооборота";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию();
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции	

Функция НастройкиОтправкиПочты() Экспорт
	
	Возврат КонтурЛогистика_РаботаСПочтовымиСообщениями.РеквизитыОтправителя();
	
КонецФункции

Функция ВерсияПриложенияНиже8_3_13() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПриложения = СистемнаяИнформация.ВерсияПриложения;
	
	Группы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ВерсияПриложения, ".");
	
	Если Число(Группы[1]) < 3 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Число(Группы[2]) < 13 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// ТОлько для вызова из ОбщаяФорма.КонтурЛогистика_НастойкиКонвертации_Помощник - анализ метаданных может занимать значительное время, кэшируем
// описания параметров - смотри в реквизиты ОбщаяФорма.КонтурЛогистика_НастойкиКонвертации_Помощник
Функция СформироватьДеревоРеквизитов(СпособМаппинга,
									НастройкаКонвертации,
									НетТабЧастиТовары,
									ИмяТабЧастьТовары,
									ТипОснования,
									УточнениеТипДокументаСодержащийТЧТовары,
									ТипДокументаОснования,
									ИзПредыдущегоТитула_Титул,
									УровнейВложенностиДереваРеквизитов) Экспорт
	
	Перем ВозможноПостроить, Дерево, КонтейнерКоллекцииРеквизитов, Реквизит, Строка, ТипЛогистика, ТипОснованияИзПредыдущегоТитула, ТипОснованияРеквизитЗаполненногоТитула;
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ИмяРеквизита",	Новый ОписаниеТипов("Строка", ,
	Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	Дерево.Колонки.Добавить("ПолныйПуть",	Новый ОписаниеТипов("Строка", ,
	Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	
	ВозможноПостроить = Истина;
	Если СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДокументаОснования")
		Или СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитДополнительногоДокумента") Тогда
		
		Если ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииДокументов") Тогда 
			
			Если НетТабЧастиТовары = Ложь И ЗначениеЗаполнено(ИмяТабЧастьТовары) Тогда
				
				Если ЗначениеЗаполнено(УточнениеТипДокументаСодержащийТЧТовары) Тогда 
					КонтейнерКоллекцииРеквизитов = Метаданные.Документы[УточнениеТипДокументаСодержащийТЧТовары].ТабличныеЧасти[ИмяТабЧастьТовары].Реквизиты;
				Иначе
					ВозможноПостроить = Ложь;
				КонецЕсли;
				
			Иначе
				
				Если ЗначениеЗаполнено(ТипОснования) Тогда
					
					КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснования].Реквизиты;
					ДобавитьНомерДатаВДерево(Дерево);
					
				Иначе
					
					ВозможноПостроить = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(НастройкаКонвертации) = Тип("СправочникСсылка.КонтурЛогистика_НастройкиКонвертацииРегистровСведений") Тогда
			
			Если ЗначениеЗаполнено(ТипОснования) Тогда
				
				КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснования].Реквизиты;
				ДобавитьНомерДатаВДерево(Дерево);
				
			Иначе
				
				ВозможноПостроить = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ТипДокументаОснования) Тогда
				
				КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипДокументаОснования].Реквизиты;
				ДобавитьНомерДатаВДерево(Дерево);
				
			Иначе
				
				Если ЗначениеЗаполнено(ТипОснования) Тогда
					
					Сообщить("В настройке конвертации не указан Документ-основание учетной системы, дерево реквизитов построить невозможно")
					
				Иначе
					
					ВозможноПостроить = Ложь;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитСправочникаДокументаУС") 
		ИЛИ СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение") 
		ИЛИ СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ДоговорыКонтрагентов") Тогда
		
		Если ЗначениеЗаполнено(ТипОснования) Тогда
			
			Если Метаданные.Справочники.Найти(ТипОснования) <> Неопределено Тогда 
				
				КонтейнерКоллекцииРеквизитов = Метаданные.Справочники[ТипОснования].Реквизиты;
				ДобавитьКодНаименованиеВДерево(Дерево);
				
				Если Метаданные.Справочники[ТипОснования].Владельцы.Количество() > 0 Тогда
					ДобавитьВладелецВДерево(Дерево);
				КонецЕсли;
					
			Иначе
				КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснования].Реквизиты;
				ДобавитьНомерДатаВДерево(Дерево);
			КонецЕсли;
			
		Иначе
			
			 ВозможноПостроить = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.РеквизитЗаполненногоТитула") Тогда
		
		ДобавитьНомерДатаВДерево(Дерево);
		ТипЛогистика = НастройкаКонвертации.ТипДокументаЛогистика;
		ТипОснованияРеквизитЗаполненногоТитула = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ТипЛогистика);
		
		КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснованияРеквизитЗаполненногоТитула].Реквизиты;
		
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ИзПредыдущегоТитула") Тогда
		
		Если ЗначениеЗаполнено(ИзПредыдущегоТитула_Титул) Тогда
			
			ДобавитьНомерДатаВДерево(Дерево);
			ТипОснованияИзПредыдущегоТитула = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(ИзПредыдущегоТитула_Титул);
			КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснованияИзПредыдущегоТитула].Реквизиты;
			
		Иначе
			
			КонтейнерКоллекцииРеквизитов = Неопределено;
			
		КонецЕсли;
		
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.ПроизвольныйКод")
		ИЛИ СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.РеквизитЛогистика") 
		ИЛИ СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.ПервоеСоответствие") 
		ИЛИ СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.РеквизитУчСист") Тогда
		
		Если ЗначениеЗаполнено(ТипОснования) Тогда
			
			Если Метаданные.Справочники.Найти(ТипОснования) <> Неопределено Тогда
				
				КонтейнерКоллекцииРеквизитов = Метаданные.Справочники[ТипОснования].Реквизиты;
				ДобавитьКодНаименованиеВДерево(Дерево);
				
				Если Метаданные.Справочники[ТипОснования].Владельцы.Количество() > 0 Тогда
					ДобавитьВладелецВДерево(Дерево);
				КонецЕсли;
				
			ИначеЕсли Метаданные.РегистрыСведений.Найти(ТипОснования) <> Неопределено Тогда
				
				КонтейнерКоллекции = Метаданные.РегистрыСведений[ТипОснования].Измерения;
				ДобавитьСтрокиДереваИзКонтейнера(Дерево, КонтейнерКоллекции, ТипОснования, УровнейВложенностиДереваРеквизитов);
				
				КонтейнерКоллекции = Метаданные.РегистрыСведений[ТипОснования].Ресурсы;
				ДобавитьСтрокиДереваИзКонтейнера(Дерево, КонтейнерКоллекции, ТипОснования, УровнейВложенностиДереваРеквизитов);
				
				КонтейнерКоллекцииРеквизитов = Метаданные.РегистрыСведений[ТипОснования].Реквизиты;
				
			Иначе
				
				КонтейнерКоллекцииРеквизитов = Метаданные.Документы[ТипОснования].Реквизиты;
				ДобавитьНомерДатаВДерево(Дерево);
				
			КонецЕсли;
			
		Иначе
			
			 ВозможноПостроить = Ложь;
			
		 КонецЕсли;	
		 
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист.РеквизитТЧЛогистика") Тогда
		
		Если ЗначениеЗаполнено(ИмяТабЧастьТовары) Тогда
				
			КонтейнерКоллекцииРеквизитов = Метаданные.Документы[УточнениеТипДокументаСодержащийТЧТовары].ТабличныеЧасти[ИмяТабЧастьТовары].Реквизиты;
						 
		КонецЕсли;
		
	ИначеЕсли СпособМаппинга = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СпособыМаппингаПоля.ДокументФизическогоЛица") Тогда
		
		ТипОбъекта = "ДокументыФизическихЛиц"; 
		
		Если Метаданные.РегистрыСведений.Найти(ТипОбъекта) <> Неопределено Тогда 
				
			КонтейнерКоллекцииРеквизитов = Метаданные.РегистрыСведений[ТипОбъекта].Ресурсы;

		КонецЕсли;
		
	КонецЕсли;
	
	Если ВозможноПостроить
		И КонтейнерКоллекцииРеквизитов <> Неопределено Тогда
		
		ДобавитьСтрокиДереваИзКонтейнера(Дерево, КонтейнерКоллекцииРеквизитов, ТипОснования, УровнейВложенностиДереваРеквизитов);
	КонецЕсли;
	
	Возврат Дерево;

КонецФункции

Процедура ДобавитьСтрокиДереваИзКонтейнера(Дерево, КонтейнерКоллекцииРеквизитов, ТипОснования, УровнейВложенностиДереваРеквизитов)
	
	Для Каждого Реквизит Из КонтейнерКоллекцииРеквизитов Цикл
		
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.ИмяРеквизита = Реквизит.Имя;
		НоваяСтрока.ПолныйПуть = Реквизит.Имя;
		
		// Вложенные
		ДобавитьВложенныеРеквизиты(НоваяСтрока, КонтейнерКоллекцииРеквизитов, ТипОснования, УровнейВложенностиДереваРеквизитов);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьНеобходимыеМетаданные(СтрокаМетаданных) Экспорт
	
	ЕстьНеобходимыеМетаданные = Истина;
	ТекПолеМетаданных = Метаданные;
	
	МассивИмен = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаМетаданных,".");
	
	КоличествоИмен = МассивИмен.Количество();
	
	// КоличествоИмен = 2 для проверки наличия объекта, например 					Справочники.КонтурEDI_Сообщения
	// КоличествоИмен = 4 для проверки наличия реквизита\ресурса и т.д., например	Справочники.КонтурEDI_Сообщения.Реквизиты.Организация
	// КоличествоИмен = 6 для проверки наличия реквизита таб. части, например		Справочники.КонтурEDI_Сообщения.ТабличныеЧасти.ДополнительныеРеквизиты.Реквизиты.ЗначениеСтрока
	
	Если НЕ (КоличествоИмен = 2 ИЛИ КоличествоИмен = 4 ИЛИ КоличествоИмен = 6) Тогда
		ЕстьНеобходимыеМетаданные =  Ложь;
	КонецЕсли;
	
	Если ЕстьНеобходимыеМетаданные Тогда
		КоличествоПоисков = КоличествоИмен/2;
		Для н = 1 По КоличествоПоисков Цикл
			ТекПолеМетаданных = ТекПолеМетаданных[МассивИмен[н*2-2]].Найти(МассивИмен[н*2-1]);
			Если ТекПолеМетаданных = Неопределено Тогда
				ЕстьНеобходимыеМетаданные =  Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЕстьНеобходимыеМетаданные;	
	
КонецФункции

Функция СостоянияМедосмотрПредсменный() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore"));
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupBefore2ndDriver"));
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
	
	// Для второго водител, когда один подписан или тех контроль подписан, то статус документооборота меняется
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-odometerBefore"));
	
	Возврат Статусы;
	
КонецФункции

Функция СостоянияМедосмотрПослесменный() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-checkupAfter"));
	
	// Для второго водителя, когда один подписан, то статус документооборота меняется
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-completed"));
	
	Возврат Статусы;
	
КонецФункции

Функция СостоянияТехКонтроль() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techInspection"));
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-techOrChekupBefore"));
	
	Возврат Статусы;
	
КонецФункции

Функция СостоянияПоказанияОдометраВыезд() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-wait-odometerBefore"));
	
	Возврат Статусы;
	
КонецФункции

Функция СостоянияПоказанияОдометраЗаезд() Экспорт
	
	Статусы = Новый Массив;
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("completed"));
	Статусы.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-on-the-way"));
	
	Возврат Статусы;
	
КонецФункции

Функция СостояниеПутевогоЛистаВПути() Экспорт
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-on-the-way");
	
КонецФункции

Функция СостояниеПутевогоЛистаОтказМедосмотр() Экспорт
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-rejected-cheсkup");
	
КонецФункции

Функция СостоянияЗЗ_ЗавешенаУспешно_ДляСписка() Экспорт
  
	СостояниеЗавершено = Новый Массив;

	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-completed"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-enterBasedOnCarrierAfter"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-enterBasedOnConsignorAfter"));

	Возврат СостояниеЗавершено;
  
КонецФункции

Функция СостоянияЗЗ_НеЗавершена_ДляСписка() Экспорт
  
	СостояниеНеЗавершено = Новый Массив;

	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-carrier"));
	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-сheckAnswer"));
	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-enterBasedOnConsignor"));
	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-enterBasedOnCarrier"));

	Возврат СостояниеНеЗавершено;
  
КонецФункции

Функция СостоянияЗЗ_ЗавешенаУспешно() Экспорт
  
	СостояниеЗавершено = Новый Массив;

	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-completed"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-enterBasedOnConsignor"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-enterBasedOnCarrier"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-enterBasedOnCarrierAfter"));
	СостояниеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-enterBasedOnConsignorAfter"));

	Возврат СостояниеЗавершено;
  
КонецФункции

Функция СостоянияЗЗ_НеЗавершена() Экспорт
  
	СостояниеНеЗавершено = Новый Массив;

	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-wait-carrier"));
	СостояниеНеЗавершено.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-сheckAnswer"));

	Возврат СостояниеНеЗавершено;
  
КонецФункции

Функция СостоянияЗЗ_Отказы() Экспорт
  
	СостояниеОтказа = Новый Массив;

	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-rejected"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-rejectedConsignor"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-createNewZZ"));

	Возврат СостояниеОтказа;
  
КонецФункции

Функция СостояниеОтказа() Экспорт
	
	СостояниеОтказа = Новый Массив;
	
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("c-rejected"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("r-rejected"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("d-rejected"));
	
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-rejected-cheсkup"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-rejected-techInspection"));
	
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-rejected"));
	СостояниеОтказа.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("zz-rejectedConsignor"));
	
	Возврат СостояниеОтказа;
	
КонецФункции

Функция ЭтоСостояниеОтказа(Состояние) Экспорт
	
	Для Каждого ТекущееСостояние Из СостояниеОтказа() Цикл
		Если ТекущееСостояние = Состояние Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция НайтиСостояниеДОПоКоду(КодАнгл) Экспорт
	
	Возврат Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(КодАнгл);
	
КонецФункции

Функция ПроверитьОтношения(Орг1, Орг2, ПроверитьАпиКлючОрг1 = Ложь, ПроверитьАвтодружбу = Истина) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ПроверитьОтношения(Орг1, Орг2, ПроверитьАпиКлючОрг1, ПроверитьАвтодружбу);
	
КонецФункции

Функция МодальностьЗапрещена() Экспорт
	
	Возврат Метаданные.РежимИспользованияМодальности <> Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать;
	
КонецФункции

Функция ОпределитьПровайдераПоИдентификатору(ИдентификаторУчастникаЭДО) Экспорт
	
	КодПровайдера = ВРег(Лев(СокрЛП(ИдентификаторУчастникаЭДО), 3));
	
	Если КодПровайдера = "" Тогда
		Провайдер = "Не участник обмена";
	ИначеЕсли КодПровайдера = "2BM" Тогда
		Провайдер = "Контур";
	ИначеЕсли КодПровайдера = "2AL" Тогда
		Провайдер = "Такском";
	ИначеЕсли КодПровайдера = "2AE" Тогда
		Провайдер = "Калуга-Астрал";
	ИначеЕсли КодПровайдера = "2BE" Тогда
		Провайдер = "Тензор";
	ИначеЕсли КодПровайдера = "2PS" Тогда
		Провайдер = "ПЕТЕР-СЕРВИС";
	ИначеЕсли КодПровайдера = "2VO" Тогда
		Провайдер = "Эвотор ОФД";
	ИначеЕсли КодПровайдера = "2LT" Тогда
		Провайдер = "Оператор-ЦРПТ";
	ИначеЕсли КодПровайдера = "2HU" Тогда
		Провайдер = "Национальный удостоверяющий центр";
	ИначеЕсли КодПровайдера = "2BK" Тогда
		Провайдер = "Корус";
	ИначеЕсли КодПровайдера = "2JD" Тогда
		Провайдер = "НИИАС";
	ИначеЕсли КодПровайдера = "2AH" Тогда
		Провайдер = "ИнфоТеКС Интернет Траст";
	ИначеЕсли КодПровайдера = "2AD" Тогда
		Провайдер = "Русь — Телеком";
	ИначеЕсли КодПровайдера = "2LB" Тогда
		Провайдер = "ЭТП ГПБ";
	ИначеЕсли КодПровайдера = "2BA" Тогда
		Провайдер = "НТЦ СТЭК";
	ИначеЕсли КодПровайдера = "2HX" Тогда
		Провайдер = "Криптэкс";
	ИначеЕсли КодПровайдера = "2AK" Тогда
		Провайдер = "ТаксНет";
	ИначеЕсли КодПровайдера = "2LD" Тогда
		Провайдер = "Э-КОМ";
	ИначеЕсли КодПровайдера = "2LJ" Тогда
		Провайдер = "Финтендер — крипто";
	ИначеЕсли КодПровайдера = "2LH" Тогда
		Провайдер = "LERADATA";
	ИначеЕсли КодПровайдера = "2CI" Тогда
		Провайдер = "Гарант";
	ИначеЕсли КодПровайдера = "2LG" Тогда
		Провайдер = "Бифит ЭДО";
	ИначеЕсли КодПровайдера = "2BV" Тогда
		Провайдер = "ПНИЭИ-КрасКрипт";
	ИначеЕсли КодПровайдера = "2JM" Тогда
		Провайдер = "Сислинк";
	ИначеЕсли КодПровайдера = "2IJ" Тогда
		Провайдер = "Эдисофт";
	Иначе
		Провайдер = "Провайдер с кодом " + КодПровайдера;
	КонецЕсли;
	
	Возврат Провайдер;
	
КонецФункции

Функция СписокРеквизитовОбъектаМетаданных(ИмяОбъекта, ТипОбъектаМетаданных) Экспорт
	
	СписокРеквизитов = Новый Массив;
	
	Реквизиты = Неопределено;
	
	Если ТипОбъектаМетаданных = "Справочник" Тогда
		Реквизиты = Метаданные.Справочники[ИмяОбъекта].Реквизиты;
	ИначеЕсли ТипОбъектаМетаданных = "Документ" Тогда
		Реквизиты = Метаданные.Документы[ИмяОбъекта].Реквизиты;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Реквизиты) Тогда
		Возврат СписокРеквизитов;
	КонецЕсли;
	
	Для каждого Стр Из Реквизиты Цикл
		СписокРеквизитов.Добавить(Стр.Имя);	
	КонецЦикла;
	
	Возврат СписокРеквизитов;
	
КонецФункции

Функция СписокТиповДокументаОснования(ДокСсылка) Экспорт
	
	ТипЛогистика = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ПолучитьТипЛогистикаПоДокументуТитулу(ДокСсылка);
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(ТипЛогистика);
	Если ЗначениеЗаполнено(НастройкаКонвертации) И ЗначениеЗаполнено(НастройкаКонвертации.ТипДокумента1С) Тогда
		Тип = Тип("ДокументСсылка." + НастройкаКонвертации.ТипДокумента1С);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тип) Тогда
		
		МассивТиповДокументаОснования = Новый Массив;
		МассивТиповДокументаОснования.Добавить(Тип);
		
		Возврат МассивТиповДокументаОснования;
		
	Иначе
		
		Возврат ДокСсылка.Метаданные().Реквизиты.ДокументОснование.Тип.Типы();
		
	КонецЕсли;
			
КонецФункции

Функция ВсеТипыЛогистическихДокументов() Экспорт
	
	Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.МассивВсехТипов();
	
КонецФункции

Функция ВсеВидыМеханизмов() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ВидыМеханизмов.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.КонтурЛогистика_ВидыМеханизмов КАК КонтурЛогистика_ВидыМеханизмов";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ЛюбаяНашаОрганизация() Экспорт

	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЛюбаяНашаОрганизация();

КонецФункции 

Функция ЕстьДополнительныеРеквизитыОФ() Экспорт

	Если Метаданные.Справочники.Найти("КонтурЛогистика_НастройкиДополнительныхРеквизитов") = Неопределено Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ИменаТаблицИзДополнительныхИсточников(ДополнительныеИсточники) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ИменаТаблицИзДополнительныхИсточников(ДополнительныеИсточники);
	
КонецФункции

Функция ДоступныеОрганизацииБСП(ТекущийПользователь) Экспорт
	
	ДоступныеОрганизации = Новый Структура;
	ДоступныеОрганизации.Вставить("ПолныйДоступ", Истина);
	ДоступныеОрганизации.Вставить("Организации", Новый Массив);
	
	// Проверим включены или нет ограничения на уровне записей в БСП
	Попытка
		ОграничиватьДоступНаУровнеЗаписей = Константы.ОграничиватьДоступНаУровнеЗаписей.Получить();
		Если Не ОграничиватьДоступНаУровнеЗаписей Тогда
			Возврат ДоступныеОрганизации;
		КонецЕсли;
	Исключение
		Возврат ДоступныеОрганизации;
	КонецПопытки;
	
	// Получим доступные организации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РазрешенныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок.СвязанныеОбъекты КАК КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РазрешенныеОрганизации КАК РазрешенныеОрганизации
	|		ПО КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.СвязанныйОбъект = РазрешенныеОрганизации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ОрганизацииДиадокСвязанныеОбъекты.Ссылка";
	
	Попытка
		ДоступныеОрганизации.ПолныйДоступ = Ложь;
		ДоступныеОрганизации.Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Исключение
		Возврат ДоступныеОрганизации;
	КонецПопытки;
	
	Возврат ДоступныеОрганизации;
	
КонецФункции

Функция ПолучитьСтруктуруДанныхТорговойСети(КодПартнераКонтур)Экспорт
	
	ДанныеСети = КонтурЛогистика_ИнтеграцияEDI_Сервер.ПолучитьСтруктуруДанныхТорговойСети(КодПартнераКонтур); 	
	Возврат	ДанныеСети;
	
КонецФункции 

Функция ПолучитьСведенияОбПараметрахПодключенияSentry() Экспорт
	
	Возврат КонтурЛогистика_ОбновлениеСервер.ПолучитьСведенияОбПараметрахПодключенияSentry();
	
КонецФункции

Функция ЗначениеUserAgent() Экспорт
	
	Возврат "DiadocLogist1C/" + КонтурЛогистика_ОбновлениеВерсииМодуля.ТекущаяВерсияПодсистемыКонтурЛогистика();
	
КонецФункции

Функция ЕстьРеквизитДокумента_(ИмяРеквизита, ТипДокумента1С, ИскатьВСтандартныхРеквизитах = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ТипДокумента1С) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Документы[ТипДокумента1С];
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьРеквизитОбъекта_(ИмяРеквизита, МетаданныеОбъекта, ИскатьВСтандартныхРеквизитах);
	
КонецФункции

Функция TraceIdМетрик(Category, Label = Неопределено) Экспорт
	
	Возврат Строка(Новый УникальныйИдентификатор());
	
КонецФункции

Функция ЕстьНастройкиКонвертацииРСПоСтатусуДО(СтатусДО) Экспорт
	
	Возврат Справочники.КонтурЛогистика_НастройкиКонвертацииРегистровСведений.ЕстьНастройкиКонвертацииРСПоСтатусуДО(СтатусДО);
	
КонецФункции

Функция ЕстьНастройкиКонвертацииЭПЛФормата501() Экспорт
	
	МассивТипДокументаЛогистика = Новый Массив;
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2);
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3);
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4);
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5);
	МассивТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул6);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
		|ГДЕ
		|	НЕ КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления
		|	И КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика В(&ТипДокументаЛогистика)";
	
	Запрос.УстановитьПараметр("ТипДокументаЛогистика", МассивТипДокументаЛогистика);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество() > 0;
		
КонецФункции

// Фильтр ленты Логистики по инфо полям

// См. Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьФильтрПоИнфоПолям
//
Функция ЕстьФильтрПоИнфоПолям(Организация) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЕстьФильтрПоИнфоПолям(Организация);
	
КонецФункции

// См. Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьОжидаемыеЗначенияИнфоПолей
//
Функция ПолучитьОжидаемыеЗначенияИнфоПолей(Организация) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ПолучитьОжидаемыеЗначенияИнфоПолей(Организация);
	
КонецФункции

// См. Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗагружатьДокументПоФильтруВыраженияВычисления
//
Функция ЗагружатьДокументПоФильтруВыраженияВычисления(Организация, ИнфоПоля) Экспорт
	
	Возврат Справочники.КонтурЛогистика_ОрганизацииДиадок.ЗагружатьДокументПоФильтруВыраженияВычисления(Организация, ИнфоПоля);
	
КонецФункции

Функция ОпределитьПартнераОрганизацииДиадок(ОрганизацияДиадок) Экспорт

	НайденныйПартнер = Справочники.КонтурЛогистика_Партнеры.ОпределитьПартнераОрганизацииДиадок(ОрганизацияДиадок);	
	Возврат НайденныйПартнер;
	
КонецФункции

// Совместимость с Диадок

Функция Диадок_ТокенДоступа(BoxId) Экспорт
	
	// ТODO реализовать кэширование на сеансе 
	
	Возврат Неопределено;
	
КонецФункции

// Центр поддержки

Функция ПолучитьСервисЦентраПоддержки() Экспорт 

	ЦП_Сервис = Обработки.КонтурЛогистика_ЦентрПоддержки.Создать();
	
	ЦП_Сервис.Инит("logist-1c",,, Истина);
	
	Возврат ЦП_Сервис;
	
КонецФункции

// Из общей библиотеки

Функция Контур_ОпределитьКонфигурацию() Экспорт
	
	СинонимКонфигурации = Метаданные.Синоним;
	ПодробнаяИнформация = Метаданные.ПодробнаяИнформация;
	ВерсияКонфигурации	= Метаданные.Версия;
	
	ИмяКонфигурации1С = Неопределено;
	
	Если Найти(СинонимКонфигурации,"Контур.Логистика") > 0 Тогда
		
		ИмяКонфигурации1С = "КЛ";
		
	ИначеЕсли Найти(СинонимКонфигурации,"ТКПТ") > 0 Тогда
		
		ИмяКонфигурации1С = "ТКПТ";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Торговый дом 7") > 0
		  ИЛИ Найти(СинонимКонфигурации, "Торговый дом 6") > 0 Тогда
		
		ИмяКонфигурации1С = "АСТОР";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Хлебобулочное и кондитерское производство (Управление сбытом продукции)") > 0 Тогда
		
		ИмяКонфигурации1С = "ХБКП_УСП";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление производственным предприятием") > 0
		ИЛИ Найти(СинонимКонфигурации, "1С:Хлебобулочное и кондитерское производство, редакция 1.3") > 0
		ИЛИ Найти(СинонимКонфигурации, "Управление проектной организацией") > 0
		ИЛИ Найти(СинонимКонфигурации, "Ликероводочный и винный завод") > 0
		ИЛИ Найти(СинонимКонфигурации, "1С: Спиртовое производство") > 0      
		ИЛИ Найти(СинонимКонфигурации, "1С:Молокозавод") > 0
		ИЛИ Найти(СинонимКонфигурации, "Мясокомбинат, редакция 1.3") > 0
		ИЛИ Найти(СинонимКонфигурации, "Управление птицефабрикой, редакция 1.3") > 0 
		ИЛИ Найти(НРег(СинонимКонфигурации), "управление сельскохозяйственным предприятием") > 0 // схожа с УПП
		ИЛИ Найти(СинонимКонфигурации, "Комплексный учет сельскохозяйственного предприятия") > 0 
		Тогда 
		
		ИмяКонфигурации1С = "УПП";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление предприятием 2") > 0 Тогда
		
		Если Метаданные.Подсистемы.Найти("уатУправлениеАвтотранспортом") = Неопределено Тогда
			ИмяКонфигурации1С = "ERP";
		Иначе
			ИмяКонфигурации1С = "ERP_УАТ";
		КонецЕсли;
		
	ИначеЕсли Найти(СинонимКонфигурации, "Комплексная автоматизация 2") > 0 Тогда // Управляемая На базе той же бсп что и УТ11.2
		
		ИмяКонфигурации1С = "КА_2";
		
	ИначеЕсли  Найти(СинонимКонфигурации, "Агропромышленный комплекс 2") > 0
		ИЛИ Найти(СинонимКонфигурации, "Управление торговлей и взаимоотношениями с клиентами (CRM)") > 0 И Найти(СинонимКонфигурации, "редакция 2") > 0 Тогда 
		
		ИмяКонфигурации1С = "УФ_УТ"; 
		
	ИначеЕсли Найти(СинонимКонфигурации, "Комплексная автоматизация") > 0 Тогда
		
		ИмяКонфигурации1С = "КА";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия Универсал, редакция 3") > 0
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия сельскохозяйственного предприятия, редакция 3") > 0 
		ИЛИ (Найти(СинонимКонфигурации, "Трактир") > 0 И Найти(СинонимКонфигурации, "Head") = 0 И Найти(СинонимКонфигурации, "3") > 0) //Управляемый  Трактиръ: Back-Office  3.0 на базе БП
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия предприятия, редакция 3") > 0  
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия предприятия КОРП, редакция 3") > 0  
		ИЛИ Найти(СинонимКонфигурации, "Управление корпоративными финансами, редакция 3") > 0  
		ИЛИ (Найти(СинонимКонфигурации, "Общепит") > 0 И Лев(ВерсияКонфигурации, 1) >= "3")  
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия молокозавода, редакция 3") > 0 Тогда 
		
		
		ИмяКонфигурации1С = "УФ_БП"; 
		
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия предприятия, редакция 2") > 0
		ИЛИ (Найти(СинонимКонфигурации, "Трактир") > 0 И Найти(СинонимКонфигурации, "Head") = 0) 
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия сельскохозяйственного предприятия") > 0 
		ИЛИ Найти(СинонимКонфигурации, "Бухгалтерия предприятия, редакция 1.6") > 0 
		ИЛИ (Найти(СинонимКонфигурации, "Общепит") > 0 И Лев(ВерсияКонфигурации, 1) = "2") Тогда

		ИмяКонфигурации1С = "БП";

	ИначеЕсли Найти(СинонимКонфигурации, "Управление небольшой фирмой") > 0
		ИЛИ Найти(СинонимКонфигурации, "Управление нашей фирмой") > 0 Тогда

		ИмяКонфигурации1С = "УФ_УНФ";
		
	ИначеЕсли Найти(НРег(СинонимКонфигурации), "управление торговлей") > 0 Тогда
		
		Если Найти(СинонимКонфигурации, "10.2") > 0 Тогда

			ИмяКонфигурации1С = "УТ";
			
		ИначеЕсли Найти(СинонимКонфигурации, "10.3") > 0 Тогда
			
			ИмяКонфигурации1С = "УТ";
			
		ИначеЕсли Найти(СинонимКонфигурации, "11") > 0 
		ИЛИ Найти(ПодробнаяИнформация, "1С:Управление торговлей (11") > 0 Тогда
			
			ИмяКонфигурации1С = "УФ_УТ";
			
		КонецЕсли;
		
	ИначеЕсли Найти(НРег(СинонимКонфигурации), "хлебобулочное и кондитерское производство") > 0 Тогда
		
		ИмяКонфигурации1С = "ХлебУСП";
		
	ИначеЕсли Найти(НРег(СинонимКонфигурации), "розница, редакция 1.0") > 0 Тогда
		
		ИмяКонфигурации1С = "Розница";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Розница, редакция 2.2") > 0 Тогда
		 
		ИмяКонфигурации1С = "УФ_Розница";
		
	ИначеЕсли Найти(СинонимКонфигурации, "RIT:Дистрибуция") > 0 Тогда

		ИмяКонфигурации1С = "RIT";
		
	ИначеЕсли Найти(СинонимКонфигурации, "ДАЛИОН: Управление магазином") > 0 
			ИЛИ (Найти(СинонимКонфигурации, "Трактиръ") > 0 И Найти(СинонимКонфигурации, "Head") > 0) Тогда
		
		ИмяКонфигурации1С = "ДалионУМ";
		
	ИначеЕсли Найти(СинонимКонфигурации, "ДАЛИОН: ТРЕНД, редакция") > 0 Тогда
		
		ИмяКонфигурации1С = "ДалионТРЕНД";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление складом") > 0  И Найти(СинонимКонфигурации, " 3.") > 0 Тогда
		
		ИмяКонфигурации1С = "УС_3";
	
	ИначеЕсли Найти(СинонимКонфигурации,"Транспортная логистика") > 0 Тогда
		
		ИмяКонфигурации1С = "ТЛЭ";
		
	ИначеЕсли Найти(НРег(СинонимКонфигурации),"управление автотранспортом проф") > 0 Тогда
		
		ИмяКонфигурации1С = "УАТ_ПРОФ";
		
	ИначеЕсли Найти(НРег(СинонимКонфигурации),"управление автотранспортом") > 0 Тогда
		
		ИмяКонфигурации1С = "УАТ";
		
	Иначе
		
		Если Найти(ВРег(Метаданные.Поставщик), "ОМЕГА ИНК") > 0 Тогда
			
			ИмяКонфигурации1С = "УТ";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяКонфигурации1С;
	
КонецФункции

Функция Контур_ОпределитьРелизКонфигурации() Экспорт
	
	РелизКонфигурации1С = "";
	
	СинонимКонфигурации = Метаданные.Синоним;
	ВерсияКонфигурации 	= Контур_РазобратьВерсиюСтрокой(Метаданные.Версия);
	
	Если Найти(СинонимКонфигурации, "Контур.Логистика") > 0 Тогда
		
		РелизКонфигурации1С = ВерсияКонфигурации;
	
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия предприятия, редакция 3.0") > 0 Тогда
		
		РелизКонфигурации1С = "3.0";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия предприятия КОРП, редакция 3.0") > 0 Тогда
		
		РелизКонфигурации1С = "3.0_КОРП";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия сельскохозяйственного предприятия") > 0 Тогда
		
		РелизКонфигурации1С = "3.0_СЕЛ";
		
	ИначеЕсли Найти(СинонимКонфигурации, "Бухгалтерия предприятия, редакция 1.6") > 0 Тогда
		
		РелизКонфигурации1С = "1.6";
		
	ИначеЕсли Найти(СинонимКонфигурации, "1С: Управление торговлей алкогольной продукцией 8, редакция 11") > 0 Тогда
		
		Если ВерсияКонфигурации.Основная = 11 Тогда
			Если ВерсияКонфигурации.Младшая = 1 Тогда
				РелизКонфигурации1С = "11.1";
			ИначеЕсли ВерсияКонфигурации.Младшая >= 2 Тогда
				РелизКонфигурации1С = "11.2";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление торговлей, редакция 11") > 0 Тогда
		
		Если ВерсияКонфигурации.Основная = 11 Тогда
			Если ВерсияКонфигурации.Младшая = 0 Тогда
				РелизКонфигурации1С = "11.0";
			ИначеЕсли ВерсияКонфигурации.Младшая = 1 Тогда
				РелизКонфигурации1С = "11.1";
			ИначеЕсли ВерсияКонфигурации.Младшая >= 2 Тогда
				РелизКонфигурации1С = "11.2";
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление торговлей и взаимоотношениями с клиентами") > 0 Тогда
		
		ПодробнаяИнформация = Метаданные.ПодробнаяИнформация;
		
		Если Найти(ПодробнаяИнформация, "1С:Управление торговлей (11") > 0 Тогда
			Если Найти(ПодробнаяИнформация, "1С:Управление торговлей (11.0") > 0 Тогда
				РелизКонфигурации1С = "11.0";
			ИначеЕсли Найти(ПодробнаяИнформация, "1С:Управление торговлей (11.1") > 0 Тогда
				РелизКонфигурации1С = "11.1";
			Иначе
				РелизКонфигурации1С = "11.2";
			КонецЕсли;
		КонецЕсли;  
		
	ИначеЕсли Найти(СинонимКонфигурации, "Комплексная автоматизация 2") > 0    // на базе той же БСП что и УТ11.2
		ИЛИ Найти(СинонимКонфигурации, "Управление предприятием 2") > 0    // на базе той же БСП что и УТ11.2  (Это ERP2.1)
		ИЛИ (Найти(СинонимКонфигурации, "Агропромышленный комплекс 2") > 0
				И ВерсияКонфигурации.Основная = 2
				И ВерсияКонфигурации.Младшая >= 1) Тогда     // на базе той же БСП что и УТ11
		
		РелизКонфигурации1С = "11.2";  
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление предприятием 2.0") > 0    // на базе той же БСП что и УТ11  (Это ERP2.0)
		ИЛИ Найти(СинонимКонфигурации, "Агропромышленный комплекс 2.0") > 0 Тогда  // на базе той же БСП что и УТ11
		
		РелизКонфигурации1С = "11.1";   
		
	ИначеЕсли Найти(СинонимКонфигурации, "Управление небольшой фирмой") > 0
		ИЛИ Найти(СинонимКонфигурации, "Управление нашей фирмой") > 0 Тогда
		
		Если ВерсияКонфигурации.Основная = 1 Тогда
			Если ВерсияКонфигурации.Младшая = 4 Тогда
				РелизКонфигурации1С = "1.4";
			ИначеЕсли ВерсияКонфигурации.Младшая = 5 Тогда
				РелизКонфигурации1С = "1.5";
			ИначеЕсли ВерсияКонфигурации.Младшая >= 6 Тогда
				РелизКонфигурации1С = "1.6";
			КонецЕсли;
		КонецЕсли;

 	КонецЕсли;
	
	Возврат РелизКонфигурации1С;
	
КонецФункции

Функция Контур_РазобратьВерсиюСтрокой(Версия) Экспорт
	
	СтруктураВерсия = Новый Структура;
	СтруктураВерсия.Вставить("Версия", 		"");
	СтруктураВерсия.Вставить("Основная", 	0);
	СтруктураВерсия.Вставить("Младшая", 	0);
	СтруктураВерсия.Вставить("Релиз",		0);
	СтруктураВерсия.Вставить("Сборка",	 	0);
	
	Если Не ЗначениеЗаполнено(Версия)
		ИЛИ НЕ ТипЗнч(Версия) = Тип("Строка") Тогда
		Возврат СтруктураВерсия;
	КонецЕсли;
	
	СтруктураВерсия.Версия = Версия;
	
	МассивРазрядов = Новый Массив;
	ТекРазряд = "";
	ДлинаСтроки = СтрДлина(Версия);
	
	Для Сч = 1 По ДлинаСтроки Цикл
		
		ДобавитьРазряд = Ложь;
		
		ТекСимвол = Сред(Версия, Сч, 1);
		Если ТекСимвол >= "0"
			И ТекСимвол <= "9" Тогда
			ТекРазряд = ТекРазряд + ТекСимвол;
		Иначе
			ДобавитьРазряд = Истина;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекРазряд)
			И (ДобавитьРазряд
			ИЛИ Сч = ДлинаСтроки) Тогда
			МассивРазрядов.Добавить(ТекРазряд);
			ТекРазряд = "";
	    КонецЕсли;
		Если МассивРазрядов.Количество() = 4 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Разряды = Новый Соответствие;
	Разряды.Вставить(1, "Основная");
	Разряды.Вставить(2, "Младшая");
	Разряды.Вставить(3, "Релиз");
	Разряды.Вставить(4, "Сборка");
	
	Сч = 0;
	Для каждого Разряд Из МассивРазрядов Цикл
		Сч = Сч + 1;
		СтруктураВерсия[Разряды[Сч]] = Число(Разряд);		
	КонецЦикла;
	
	Возврат СтруктураВерсия;
	
КонецФункции	

// Вспомогательные

Функция ЭтоИмяДокумента(ИмяДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат (Метаданные.Документы.Найти(ИмяДокумента) <> Неопределено);
	
КонецФункции

Функция ПолучитьТекстЯчейкиОбласти(Область, Строка, Колонка)
	
	Возврат Строка(Область.ПолучитьОбласть("R" + Формат(Строка, "ЧГ=0") + "C" + Формат(Колонка, "ЧГ=0")).ТекущаяОбласть.Текст);
	
КонецФункции

Функция ЭтоИнтерфейс82() Экспорт
	
	Если Метаданные.РежимСовместимостиИнтерфейса = Метаданные.СвойстваОбъектов.РежимСовместимостиИнтерфейса.Версия8_2
		Или Метаданные.РежимСовместимостиИнтерфейса = Метаданные.СвойстваОбъектов.РежимСовместимостиИнтерфейса.Версия8_2РазрешитьТакси Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоРежимСовместимости_8_2_13() Экспорт
	
	Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоРежимСовместимости_8_2() Экспорт
	
	Если Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13
		Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_16 Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция РежимыСовместимостиБезПоддержки836()
	
	РежимыБезПоддержки = Новый Структура;
	РежимыБезПоддержки.Вставить("Версия8_1");
	РежимыБезПоддержки.Вставить("Версия8_2_13");
	РежимыБезПоддержки.Вставить("Версия8_2_16");
	РежимыБезПоддержки.Вставить("Версия8_3_1");
	РежимыБезПоддержки.Вставить("Версия8_3_2");
	РежимыБезПоддержки.Вставить("Версия8_3_3");
	РежимыБезПоддержки.Вставить("Версия8_3_4");
	РежимыБезПоддержки.Вставить("Версия8_3_5");
	
	ЗаполнитьЗначенияСвойств(РежимыБезПоддержки, Метаданные.СвойстваОбъектов.РежимСовместимости);
	
	Результат = Новый Массив;
	Для Каждого Элемент Из РежимыБезПоддержки Цикл
		Если Элемент.Значение <> Неопределено Тогда
			Результат.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьВозможностьХраненияРасширений() Экспорт
	
	РежимСовместимостиБезПоддержки = РежимыСовместимостиБезПоддержки836().Найти(Метаданные.РежимСовместимости) <> Неопределено;
	Если РежимСовместимостиБезПоддержки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВерсииПриложенийБезПоддержки836 = Новый Массив;
	ВерсииПриложенийБезПоддержки836.Добавить("8.2.");
	ВерсииПриложенийБезПоддержки836.Добавить("8.3.1.");
	ВерсииПриложенийБезПоддержки836.Добавить("8.3.2.");
	ВерсииПриложенийБезПоддержки836.Добавить("8.3.3.");
	ВерсииПриложенийБезПоддержки836.Добавить("8.3.4.");
	ВерсииПриложенийБезПоддержки836.Добавить("8.3.5.");
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Для Каждого Элемент Из ВерсииПриложенийБезПоддержки836 Цикл
		Если Найти(СистемнаяИнформация.ВерсияПриложения, Элемент) = 1 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ВерсияСтандартнойПодсистемыВыше_3_1_8() Экспорт
	
	МодульОбновлениеИнформационнойБазыСлужебный = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("ОбновлениеИнформационнойБазыСлужебный");
	Если МодульОбновлениеИнформационнойБазыСлужебный = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВерсияИБ = МодульОбновлениеИнформационнойБазыСлужебный.ВерсияИБ("СтандартныеПодсистемы");
	
	МодульОбщегоНазначенияКлиентСервер = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	Если МодульОбщегоНазначенияКлиентСервер = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (МодульОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияИБ, "3.1.8.0") > 0);
	
КонецФункции

Функция РежимЗапускаКлиентскогоПриложения() Экспорт
	
	Возврат Метаданные.ОсновнойРежимЗапуска;
	
КонецФункции

// Функция проверяет, что текущее соединение установлено с использованием
// расширения веб-сервера
Функция ЭтоВебСервер() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ВсеСоединенияИБ = ПолучитьСоединенияИнформационнойБазы();
	ТекущийНомерСоединения = НомерСоединенияИнформационнойБазы();
	
	Для Каждого СоединениеИБ Из ВсеСоединенияИБ Цикл
		Если СоединениеИБ.НомерСоединения = ТекущийНомерСоединения
			И СоединениеИБ.ИмяПриложения = "WebServerExtension" Тогда			
			Возврат Истина;			
		КонецЕсли;
	КонецЦикла;
		
	Возврат Ложь;	
	
КонецФункции

Функция ИмяЗначенияПеречисления_КонтурЛогистика(ЭлементПеречислениеСсылка) Экспорт

	ИмяПеречисления = ЭлементПеречислениеСсылка.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЭлементПеречислениеСсылка);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;	
	
	Возврат ИмяЗначенияПеречисления;
	
КонецФункции

Функция ПолучитьРольАдминистратора() Экспорт 
	
	Если Метаданные.Роли.Найти("УчетнаяСистема_Администрирование") Тогда
		ИмяРоли = "УчетнаяСистема_Администрирование";
	Иначе
		ИмяРоли = "Администрирование";
	КонецЕсли;	
	
	Возврат Метаданные.Роли[ИмяРоли];
	
КонецФункции	

Функция КонфигурацияПоддерживаетХарактеристики() Экспорт
	
	ИмяКонфигурации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИмяКонфигурации1С");
	
	Возврат Не ИмяКонфигурации = "БП" И Не ИмяКонфигурации = "УФ_БП" И Не ИмяКонфигурации = "ТЛЭ" И Не ИмяКонфигурации = "УАТ_ПРОФ" И Не ИмяКонфигурации = "УАТ";
	
КонецФункции

Функция КоличествоДнейДляПредупрежденияПроверкиМЧД() Экспорт
	
	Возврат 30;
	
КонецФункции

Функция ЕстьДокументСсылкаВОснованииПоТипу(ИмяМетаданныхДокумента) Экспорт
	
	МетаданныеДокумента = Метаданные.Документы[ИмяМетаданныхДокумента];
	
	КоличествоТиповСсылокДокументаОснования = 0;
	
	Для Каждого ТекущийТип Из МетаданныеДокумента.Реквизиты.ДокументОснование.Тип.Типы() Цикл
		Если Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(ТекущийТип)) Тогда
			КоличествоТиповСсылокДокументаОснования = КоличествоТиповСсылокДокументаОснования + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат (КоличествоТиповСсылокДокументаОснования = Метаданные.Документы.Количество());
	
КонецФункции

Функция ПолучитьTraceIdДляМетрики(Категория) Экспорт	
	Возврат Строка(Новый УникальныйИдентификатор());		
КонецФункции

Функция ИспользуютсяРеквизитыПоУмолчаниюВОрганизации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		|ГДЕ
		|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		|	И (КонтурЛогистика_ОрганизацииДиадок.ТранспортноеСредствоПоУмолчанию <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка)
		|	ИЛИ КонтурЛогистика_ОрганизацииДиадок.ВодительПоУмолчанию <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
		|	ИЛИ КонтурЛогистика_ОрганизацииДиадок.Водитель2ПоУмолчанию <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДанныеАутентификацииПоОрганизации(Знач Организация = Неопределено, Знач boxID = Неопределено) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.ДанныеАутентификацииПоОрганизации(Организация, boxID);
	
КонецФункции

Функция ДанныеАутентификацииЛюбойОрганизации() Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_Аутентификация.ДанныеАутентификацииЛюбойОрганизации();
	
КонецФункции

Функция РежимУправленияБлокировкойДанных() Экспорт
	
	Возврат Метаданные.РежимУправленияБлокировкойДанных;
	
КонецФункции

Функция ИспользуетсяПутевойЛист(Партнер = Неопределено) Экспорт

	Результат = Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяПутевойЛист", Партнер)
		Или Справочники.КонтурЛогистика_Настройки.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02", Партнер);
	
	Возврат Результат;	

КонецФункции

// для формирования дерева помощника

Процедура ДобавитьВложенныеРеквизиты(СтрокаРодителя, Знач КонтейнерКоллекцииРеквизитов, ТипОснования, УровнейВложенностиДереваРеквизитов)
	
	РеквизитРодитель = СтрокаРодителя.ИмяРеквизита;
	
	Попытка
		
		Если КонтейнерКоллекцииРеквизитов = Неопределено Тогда
			
			ТипТекущегоЭлемента = Метаданные.Документы[ТипОснования].Реквизиты[РеквизитРодитель].Тип.Типы()[0];
			КонтейнерКоллекцииРеквизитов = Метаданные.НайтиПоТипу(ТипТекущегоЭлемента).Реквизиты;
			
		Иначе
			
			ТипТекущегоЭлемента = КонтейнерКоллекцииРеквизитов[РеквизитРодитель].Тип.Типы()[0];
			НайденныйОбъектМетаданных = Метаданные.НайтиПоТипу(ТипТекущегоЭлемента);
			
			Если НайденныйОбъектМетаданных = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			КонтейнерКоллекцииРеквизитов = НайденныйОбъектМетаданных.Реквизиты;
			
			Для Каждого Реквизит Из КонтейнерКоллекцииРеквизитов Цикл
				
				// зацикленные ссылки - нужно защититься (например ДокументЭТРН.ТранспортноеСредство.ПрицепПоУмолчанию.ПрицепПоУмолчанию.ПрицепПоУмолчанию) 
				Если Прав(СтрокаРодителя.ПолныйПуть, СтрДлина(Реквизит.Имя)) = Реквизит.Имя 
					ИЛИ КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаРодителя.ПолныйПуть, ".").Количество() > УровнейВложенностиДереваРеквизитов Тогда 
					
					Продолжить;
					
				КонецЕсли;
				
				Строка = СтрокаРодителя.Строки.Добавить();
				Строка.ИмяРеквизита = Реквизит.Имя;
				Строка.ПолныйПуть = СтрокаРодителя.ПолныйПуть + "." + Строка.ИмяРеквизита;
				
				// вложенные
				ДобавитьВложенныеРеквизиты(Строка, КонтейнерКоллекцииРеквизитов, ТипОснования, УровнейВложенностиДереваРеквизитов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		КонтейнерКоллекцииРеквизитов = Неопределено;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьНомерДатаВДерево(Знач Дерево)
	
	Строка = Дерево.Строки.Добавить();
	Строка.ИмяРеквизита = "Номер";
	Строка.ПолныйПуть = "Номер";
	Строка = Дерево.Строки.Добавить();
	Строка.ИмяРеквизита = "Дата";
	Строка.ПолныйПуть = "Дата";

КонецПроцедуры

Процедура ДобавитьКодНаименованиеВДерево(Знач Дерево)
	
	Строка = Дерево.Строки.Добавить();
	Строка.ИмяРеквизита = "Код";
	Строка.ПолныйПуть = "Код";
	Строка = Дерево.Строки.Добавить();
	Строка.ИмяРеквизита = "Наименование";
	Строка.ПолныйПуть = "Наименование";

КонецПроцедуры

Процедура ДобавитьВладелецВДерево(Знач Дерево)
		
	Строка = Дерево.Строки.Добавить();
	Строка.ИмяРеквизита = "Владелец";
	Строка.ПолныйПуть = "Владелец";

КонецПроцедуры

Функция СостоянияДвиженияДО()
	
	Состояния = Новый Соответствие;
	
	ЗапросСостояний = Новый Запрос;
	ЗапросСостояний.Текст = "ВЫБРАТЬ
    |	КонтурЛогистика_СостоянияДвиженияДокументооборота.Код КАК Код,
    |	КонтурЛогистика_СостоянияДвиженияДокументооборота.Ссылка КАК Ссылка
    |ИЗ
    |	Справочник.КонтурЛогистика_СостоянияДвиженияДокументооборота КАК КонтурЛогистика_СостоянияДвиженияДокументооборота";
	
	Выборка = ЗапросСостояний.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Состояния.Вставить(Выборка.Код, Выборка.Ссылка);	
	КонецЦикла;
		
	Возврат Состояния;
	
КонецФункции

Функция ЗначениеСостоянияДО(КодСостояния) Экспорт
	
	Состояния = СостоянияДвиженияДО();
	
	Возврат Состояния.Получить(КодСостояния);
	
КонецФункции

// Парсер JSON

Функция ПарсерJSON() Экспорт

	Возврат Обработки.КонтурЛогистика_КонтурПарсерJSON.Создать();
	
КонецФункции

// Параметры установки модулей Контура

Функция ПараметрыУстановкиМодулей() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Диадок", Новый Структура("МодульУстановлен, ЭтоУФ, ИспользоватьТиповуюПодсистему1С"));
	Результат.Вставить("EDI", Новый Структура("МодульУстановлен"));
	
	// Диадок
	// Определим УФ или ОФ
	ПланВидовХарактеристик_Свойство = КонтурЛогистика_ОбщегоНазначенияСервер.МетаданынеОбъектаПоИмени(
		"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
	Если ПланВидовХарактеристик_Свойство = Неопределено Тогда
		ПланВидовХарактеристик_Свойство = КонтурЛогистика_ОбщегоНазначенияСервер.МетаданынеОбъектаПоИмени(
			"ПланВидовХарактеристик.СвойстваОбъектов");
		Если ПланВидовХарактеристик_Свойство = Неопределено Тогда
			Результат.Диадок.МодульУстановлен = Ложь;
		Иначе
			Результат.Диадок.ЭтоУФ = Ложь;
		КонецЕсли;
	Иначе
		Результат.Диадок.ЭтоУФ = Истина;
	КонецЕсли;
	
	// Опеределим установку ДД
	Если ПланВидовХарактеристик_Свойство <> Неопределено Тогда
		Свойство_ИспользоватьТиповуюПодсистему1С = ПланыВидовХарактеристик[ПланВидовХарактеристик_Свойство.Имя].НайтиПоНаименованию(
			"DDPro_ИспользоватьТиповуюПодсистему1С", Истина);
		Если Свойство_ИспользоватьТиповуюПодсистему1С = Неопределено Тогда
			Результат.Диадок.МодульУстановлен = Ложь;
		Иначе
			// Определим тип установки (где хранятся данные, в своих метаданных или в типовых)
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Свойство", Свойство_ИспользоватьТиповуюПодсистему1С);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗначенияСвойствОбъектов.Значение
			|ИЗ
			|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
			
			Если Результат.Диадок.ЭтоУФ Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗначенияСвойствОбъектов", "ДополнительныеСведения");
			КонецЕсли;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Результат.Диадок.МодульУстановлен = Истина;
				Результат.Диадок.ИспользоватьТиповуюПодсистему1С = Выборка.Значение;
			Иначе
				Результат.Диадок.МодульУстановлен = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверим установку ДД
	Если Результат.Диадок.МодульУстановлен Тогда
		НомерВерсииДиадок = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиДД(Результат.Диадок, "СохраненнаяВерсияМодуля");
		Результат.Диадок.МодульУстановлен = ЗначениеЗаполнено(НомерВерсииДиадок);
	КонецЕсли;
	
	// EDI (данные всегда хранятся в своих метаданных)
	РегистрыСведений_КонтурEDI_ДополнительныеРеквизиты = КонтурЛогистика_ОбщегоНазначенияСервер.МетаданынеОбъектаПоИмени(
		"РегистрСведений.КонтурEDI_ДополнительныеРеквизиты");
	Если РегистрыСведений_КонтурEDI_ДополнительныеРеквизиты <> Неопределено Тогда
		НомерВерсииEDI = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначениеОбщейНастройкиEDI("НомерВерсии");
		Результат.EDI.МодульУстановлен = ЗначениеЗаполнено(НомерВерсииEDI);
	Иначе
		Результат.EDI.МодульУстановлен = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
