#Область ПрограммныйИнтерфейс

// Начинает загрузку статусов операций.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма обработки.
//  ПараметрыЗавершения - см. ДенежныеСредстваКлиентЛокализация.НовыеПараметрыЗагрузкиИзСервиса.
Процедура НачатьЗагрузкуСтатусовОпераций(Форма, ПараметрыЗавершения) Экспорт

	ФоновоеЗадание = ОнлайнЗаказыУТВызовСервера.ЗаданиеНаЗагрузкуСтатусовОпераций();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОПолучении = Новый ОписаниеОповещения(
		"ОбработкаПолученияОперацийЗавершение", Форма, ПараметрыЗавершения);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, ОповещениеОПолучении, ПараметрыОжидания);

КонецПроцедуры

// Выполняет проверку наличия оплаты онлайн-заказа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма документа, в котором выполняется проверка.
//  ДокументСсылка - ДокументСсылка.ЗаказКлиента - ссылка на документ, в котором выполняется проверка.
//
Процедура ПроверитьОплатуОнлайнЗаказа(Форма, ДокументСсылка) Экспорт

	ДокументОплачен = ОнлайнЗаказыУТВызовСервера.ДокументЗаказаОплачен(ДокументСсылка);
	
	Если ДокументОплачен Тогда
		Оповестить("ЗачтенаОплата", ДокументСсылка);
	Иначе
		Форма.ПодключитьОбработчикОжидания("Подключаемый_ПроверкаОплатыОнлайнЗаказа", 1, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти