
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОповещенияПользователейОСобытиях.ПроверитьПодготовитьСоединениеССистемойВзаимодействия();
	
	АдресБота = Константы.АдресБотаОповещенийВTelegram.Получить();
	ИспользоватьОповещения = ПолучитьФункциональнуюОпцию("ИспользоватьОповещенияПользователейВTelegram");
	ОписаниеИнтеграции = ОповещенияПользователейОСобытиях.НайтиСуществующуюИнтеграцию(АдресБота);
	АдресБота = "https://t.me/" + АдресБота;
	
	Если Не ЗначениеЗаполнено(АдресБота)
		Или Не ИспользоватьОповещения
		Или ОписаниеИнтеграции = Неопределено
		Или Не ОписаниеИнтеграции.Использование Тогда
		ВызватьИсключение НСтр("ru = 'В системе не настроена интеграция с Telegram. Обратитесь к Администратору.'");
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	
	АдресОповещения = ОповещенияПользователейОСобытиях.АдресОповещенияПоПользователю(
		ТекущийПользователь,
		Перечисления.СпособыОповещенийПользователей.Telegram);
	АдресЗадан = ЗначениеЗаполнено(АдресОповещения);
	
	СгенерироватьQRКод(АдресБота);
	Если АдресЗадан Тогда
		Элементы.СтраницыПодключение.ТекущаяСтраница = Элементы.СтраницаУжеПодключено;
		Элементы.ДекорацияАдресБотаОписание.Заголовок = НСтр("ru = 'Адрес бота для получения оповещений в Telegram.'");
	Иначе
		Элементы.СтраницыПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение;
		ЗаполнитьВременныйКод();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.СтраницыПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение Тогда
		ПодключитьОбработчикОжидания("ОбратныйОтсчет", 1);
		УведомленияКлиента.ПодключитьОбработчик("ПодключениеПользователяTelegram", 
			Новый ОписаниеОповещения("ПослеПодключенияПользователя", ЭтотОбъект));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	УведомленияКлиента.ОтключитьОбработчик("ПодключениеПользователяTelegram");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресБотаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(АдресБота);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьКод(Команда)
	
	ЗаполнитьВременныйКод();
	ПодключитьОбработчикОжидания("ОбратныйОтсчет", 1);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура УдалитьРегистрацию(Команда)
	
	ТекстВопроса = НСтр("ru = 'Оповещения перестанут направляться в Telegram.
		|Вы уверены, что хотите удалить регистрацию в боте Telegram?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьРегистрациюПользователя();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Удаление регистрации в боте Telegram.'"),,
			НСтр("ru = 'Удаление регистрации в боте Telegram успешно завершено.'"),
			БиблиотекаКартинок.Информация32);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбратныйОтсчет()
	
	Если Таймер > Дата(1,1,1) Тогда
		Таймер = Таймер - 1;
	Иначе
		УстановитьВидимостьТаймера(ЭтотОбъект, Ложь);
		ОтключитьОбработчикОжидания("ОбратныйОтсчет");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВременныйКод()
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКода = ОповещенияПользователейОСобытиях.ВременныйКодДляПодключенияКTelegram(ТекущийПользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	Код = ДанныеКода.Код;
	Таймер = Дата(1,1,1) + ДанныеКода.СрокДействияВСекундах;
	
	УстановитьВидимостьТаймера(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьQRКод(АдресБота)
	
	ДвоичныеДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(АдресБота,3, 190);
	QRКод = ПоместитьВоВременноеХранилище(ДвоичныеДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьТаймера(Форма, Включить)
	
	Элементы = Форма.Элементы;
	
	Если Включить Тогда
		Элементы.ГруппаТаймерСтраницы.ТекущаяСтраница = Элементы.ГруппаТаймер;
		Элементы.ПолучитьКод.Доступность = Ложь;
	Иначе
		Элементы.ГруппаТаймерСтраницы.ТекущаяСтраница = Элементы.ГруппаТаймерПустой;
		Элементы.ПолучитьКод.Доступность = Истина;
		Форма.Код = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРегистрациюПользователя()
	
	ОповещенияПользователейОСобытиях.ЗаписатьСопоставленногоПользователяМессенджера(ТекущийПользователь,
		"",
		Перечисления.СпособыОповещенийПользователей.Telegram);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияПользователя(ДанныеУведомления, ДопПараметры = Неопределено) Экспорт
	Если ДанныеУведомления.Свойство("Пользователь")
		И ДанныеУведомления.Пользователь = ТекущийПользователь Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти