
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Локализация
	СтатусыЭДО = Обработки.МониторСверкиВзаиморасчетов.СтатусыЭДООбменЗавершен();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СостояниеВерсииЭД", СтатусыЭДО, ВидСравненияКомпоновкиДанных.НеВСписке,,Истина);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	//-- Локализация
	Если ЗначениеЗаполнено("НачалоПериода") И ЗначениеЗаполнено("КонецПериода") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаДокументаИБ", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Параметры.НачалоПериода,,Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ДатаДокументаИБ", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, КонецДня(Параметры.КонецПериода),,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено("Контрагент") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Контрагент", Параметры.Контрагент, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если Поле.Имя <> "СписокПредставлениеСостояния" Тогда
		ОткрытьЗначениеАсинх(ТекущаяСтрока.Ссылка);
	//++ Локализация
	ИначеЕсли Поле.Имя = "СписокПредставлениеСостояния" Тогда
		КомандаЭДО = НайтиКомандуТекущиеДелаЭДО();
		Если КомандаЭДО <> Неопределено Тогда
			ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(КомандаЭДО, ЭтотОбъект, Элементы.Список);
		КонецЕсли;
	//-- Локализация
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация
&НаКлиенте
Функция НайтиКомандуТекущиеДелаЭДО()
	
	КнопкаТекущиеДелаЭДО = Неопределено;
	КомандаЭДО = Неопределено;
	Если Элементы.ПодменюЭДО.ПодчиненныеЭлементы.Найти("ПодменюЭДОКомандыЭДОДополнительное") <> Неопределено Тогда
		Для Каждого Элемент Из Элементы.ПодменюЭДО.ПодчиненныеЭлементы.ПодменюЭДОКомандыЭДОДополнительное.ПодчиненныеЭлементы Цикл
			Если СтрНайти(Элемент.Имя, "ПодменюЭДООткрытьТекущиеДелаЭДО") > 0 Тогда
				КнопкаТекущиеДелаЭДО = Элемент;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если КнопкаТекущиеДелаЭДО <> Неопределено Тогда
		КомандаЭДО = Команды.Найти(КнопкаТекущиеДелаЭДО.ИмяКоманды);
	КонецЕсли;
	
	Возврат КомандаЭДО;
	
КонецФункции
//-- Локализация

#КонецОбласти

