
#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДанныхФормы

Процедура ЗаполнитьДанныеФормыПоПротоколу(Форма) Экспорт
	
	ЗаполнитьПредставлениеСтатуса(Форма);
	ЗаполнитьПредставлениеИсполнителя(Форма);
	
КонецПроцедуры

Функция ГиперссылкаЗначения(Знач ПредставлениеГиперссылки, ЗначениеГиперссылки)
	
	Если ТипЗнч(ПредставлениеГиперссылки) <> Тип("Строка") Тогда
		ПредставлениеГиперссылки = Строка(ПредставлениеГиперссылки);
	КонецЕсли;
	
	Гиперссылка = Новый ФорматированнаяСтрока(
		ПредставлениеГиперссылки,,,,
		ЗначениеГиперссылки);
		
	Возврат Гиперссылка;
	
КонецФункции

Функция ЗначениеКомандыПеренаправить() Экспорт
	Возврат "Перенаправить";
КонецФункции

#Область ПредставлениеСтатуса

Процедура ЗаполнитьПредставлениеСтатуса(Форма)
	
	ЖирныйШрифт = Форма.КэшПротокола.ЖирныйШрифт;
	
	ДоступныеМаршруты = ДоступныеМаршрутыСтатуса(Форма);
	ИндексПоследнегоМаршрута = ДоступныеМаршруты.Количество() - 1;
	ДанныеСтроки = Новый Массив;
	
	// Заголовок:
	ДанныеСтроки.Добавить(НСтр("ru = 'Статус'"));
	ДанныеСтроки.Добавить(":");
	ДанныеСтроки.Добавить(" ");
	
	// Текущее значение:
	ДанныеСтроки.Добавить(Новый ФорматированнаяСтрока(
		Строка(Форма.Объект.Статус), ЖирныйШрифт,,,"ИзменитьСтатус"));
	
	// Разделитель перед действиями:
	ДанныеСтроки.Добавить(" ");
	ДанныеСтроки.Добавить(" ");
	
	Для ИндексМаршрута = 0 По ИндексПоследнегоМаршрута Цикл
		
		// Действие:
		Маршрут = ДоступныеМаршруты[ИндексМаршрута];
			
		ПредставлениеКоманды = Маршрут.ПредставлениеКоманды;
		Если ИндексМаршрута <> 0 Тогда
			// Все кроме первой команды должны быть в нижнем регистре:
			ПредставлениеКоманды = НРег(ПредставлениеКоманды);
		КонецЕсли;
			
		ДанныеСтроки.Добавить(ГиперссылкаЗначения(ПредставлениеКоманды, Маршрут.ЗначениеКоманды));
			
		// Разделитель действий:
		Если ИндексМаршрута = ИндексПоследнегоМаршрута Тогда
			Продолжить;
		ИначеЕсли ИндексМаршрута = ИндексПоследнегоМаршрута - 1 Тогда
			ДанныеСтроки.Добавить(" ");
			ДанныеСтроки.Добавить(НСтр("ru = 'или'"));
			ДанныеСтроки.Добавить(" ");
		Иначе
			ДанныеСтроки.Добавить(",");
			ДанныеСтроки.Добавить(" ");
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ПредставлениеСтатуса = Новый ФорматированнаяСтрока(ДанныеСтроки);
	
КонецПроцедуры

#Область МаршрутыСтатуса

Функция ДоступныеМаршрутыСтатуса(Форма)
	
	ВозвращаемоеЗначение = Новый Массив;
	
	СтатусОтбора = Форма.Объект.Статус;
	Для Каждого СтрокаМаршрута Из Форма.ДоступныеМаршрутыСтатусов Цикл // Сохраняем последовательность строк
		
		Если СтрокаМаршрута.ИсходныйСтатус <> СтатусОтбора Тогда
			Продолжить;
		КонецЕсли;

		ВозвращаемоеЗначение.Добавить(СтрокаМаршрута);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПредставлениеИсполнителя

Процедура ЗаполнитьПредставлениеИсполнителя(Форма)
	
	СоставПредставленияИсполнителя = Новый Массив;
	СоставПредставленияОткрытьПротокол = Новый Массив;
	
	ДанныеПротокола = СтруктураСтрокиПротокола();
	Если ЗначениеЗаполнено(Форма.Объект.Протокол) Тогда
		ПоследняяСтрока = ПоследняяСтрокаПротокола(Форма.Объект.Протокол);
		ЗаполнитьЗначенияСвойств(ДанныеПротокола, ПоследняяСтрока);
		ПротоколЗаполнен = Истина;
	Иначе
		ЗаполнитьСвойстваПротоколаИзОбъекта(ДанныеПротокола, Форма.Объект);
		ПротоколЗаполнен = Ложь;
	КонецЕсли;
		
	// Исполнитель:
	СоставПредставленияИсполнителя.Добавить(НСтр("ru = 'Направлена'"));
	СоставПредставленияИсполнителя.Добавить(":");
	СоставПредставленияИсполнителя.Добавить(" ");
	Если ЗначениеЗаполнено(ДанныеПротокола.Исполнитель) Тогда
		СоставПредставленияИсполнителя.Добавить(
			ГиперссылкаЗначения(ДанныеПротокола.Исполнитель, ЗначениеКомандыПеренаправить()));
	Иначе
		СоставПредставленияИсполнителя.Добавить("<...>"); // Пустой исполнитель. Не перенаправляется в закрытых статусах 
	КонецЕсли;
	
	ДобавленРазделительМеждуГиперссылками = Ложь; // Если ложь, то следующий "разделитель слов" должен быть не гиперссылкой.
	
	// Автор:
	Если ДанныеПротокола.Автор <> ДанныеПротокола.Исполнитель Тогда
		
		СоставПредставленияИсполнителя.Добавить(" ");
		СоставПредставленияИсполнителя.Добавить(НСтр("ru = 'от'"));
		СоставПредставленияИсполнителя.Добавить(" ");
		ДобавленРазделительМеждуГиперссылками = Истина;
		
		СоставПредставленияОткрытьПротокол.Добавить(Строка(ДанныеПротокола.Автор));
		
	КонецЕсли;
	
	// Дата. Выводится либо сегодняшнее время, либо дата без времени:
	Если ПротоколЗаполнен Тогда // Если протокол еще не заполнен, то даты нет
		
		Если ДобавленРазделительМеждуГиперссылками Тогда
			СоставДляРазделителя = СоставПредставленияОткрытьПротокол;
		Иначе
			СоставДляРазделителя = СоставПредставленияИсполнителя;
			ДобавленРазделительМеждуГиперссылками = Истина;
		КонецЕсли;
		
		СоставДляРазделителя.Добавить(",");
		СоставДляРазделителя.Добавить(" ");
		
		Дата = ДанныеПротокола.Дата;
		Если НачалоДня(Дата) = Форма.КэшПротокола.НачалоДня Тогда
			ДатаСтрокой = Формат(Дата, "ДФ=HH:mm");
		Иначе
			ДатаСтрокой = Формат(Дата, "ДЛФ=D");
		КонецЕсли;
		
		СоставПредставленияОткрытьПротокол.Добавить(ДатаСтрокой);
		
	КонецЕсли;
		
	// Количество записей в протоколе. Выводится в скобках:
	СтрокаКоличествоЗаписейВПротоколе = СтрШаблон("(%1)", Форма.Объект.Протокол.Количество());
	
	Комментарий = ДанныеПротокола.Комментарий;
	Если ПустаяСтрока(Комментарий) Тогда // Нет ни одного печатного символа
		
		Если ДобавленРазделительМеждуГиперссылками Тогда
			СоставДляРазделителя = СоставПредставленияОткрытьПротокол;
		Иначе
			СоставДляРазделителя = СоставПредставленияИсполнителя;
			ДобавленРазделительМеждуГиперссылками = Истина;
		КонецЕсли;
		СоставДляРазделителя.Добавить(" ");
		СоставПредставленияОткрытьПротокол.Добавить(СтрокаКоличествоЗаписейВПротоколе);
		
	Иначе // Комментарий. Выводим первую значащую строку. Если не входит, то "отрезаем" и добавляем многоточие:
		
		Для Каждого ЧастьСтроки Из СтрРазделить(ДанныеПротокола.Комментарий, Символы.ПС, Ложь) Цикл
			
			// Если первая строка пустая и в ней есть, например, пробел, то СтрРазделить все равно вернет это значение.
			// Пропускаем такие строки и берем первую строку с символами:
			Если Не ПустаяСтрока(ЧастьСтроки) Тогда 
				
				Комментарий = СокрЛП(ЧастьСтроки);
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДлинаПредставления = СтрДлина(СтрСоединить(СоставПредставленияИсполнителя, ""))
			+ СтрДлина(СтрСоединить(СоставПредставленияОткрытьПротокол, ""))
			+ СтрДлина(СтрокаКоличествоЗаписейВПротоколе) + 1; // С учетом разделителя " "
			
		МаксимальнаяДлинаПредставления = 123;
		ДлинаКомментария = МаксимальнаяДлинаПредставления - ДлинаПредставления; 
			
		Если СтрДлина(Комментарий) > ДлинаКомментария Тогда
			
			ДлинаМноготочия = 3;
			Комментарий = СтрШаблон(
				"%1...",
				Лев(Комментарий, ДлинаКомментария - ДлинаМноготочия));
			
		КонецЕсли;
		
		Если ДобавленРазделительМеждуГиперссылками Тогда
			СоставДляРазделителя = СоставПредставленияОткрытьПротокол;
		Иначе
			СоставДляРазделителя = СоставПредставленияИсполнителя;
			ДобавленРазделительМеждуГиперссылками = Истина;
		КонецЕсли;
		СоставДляРазделителя.Добавить(":");
		СоставДляРазделителя.Добавить(" ");
		
		СоставПредставленияОткрытьПротокол.Добавить(Комментарий);
		
		СоставПредставленияОткрытьПротокол.Добавить(" ");
		СоставПредставленияОткрытьПротокол.Добавить(СтрокаКоличествоЗаписейВПротоколе);
		
	КонецЕсли;
	
	ПредставлениеОткрытьПротокол = ГиперссылкаЗначения(
		СтрСоединить(СоставПредставленияОткрытьПротокол, ""),
		"ОткрытьПротокол");
		
	СоставПредставленияИсполнителя.Добавить(ПредставлениеОткрытьПротокол);
	Форма.ПредставлениеИсполнителя = Новый ФорматированнаяСтрока(СоставПредставленияИсполнителя);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСДанными

// Возвращает индекс последней строки протокола.
// 
// Параметры:
//  Протокол - ДанныеФормыКоллекция
// 
// Возвращаемое значение:
//  Число
Функция ПоследняяСтрокаПротокола(Протокол) Экспорт

	Возврат Протокол.Получить(Протокол.Количество() - 1);

КонецФункции

// Добавляет новую строку в таблицу протокола
// 
// Параметры:
//  Протокол - ДанныеФормыКоллекция - В который будет добавлена строка
//  ДанныеПротокола - См. СтруктураСтрокиПротокола
// 
// Возвращаемое значение:
//   ДанныеФормыЭлементКоллекции
Функция НоваяСтрокаПротокола(Протокол, ДанныеПротокола)  Экспорт
	
	СтрокаПротокола = Протокол.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаПротокола, ДанныеПротокола);
	
	Возврат СтрокаПротокола;
	
КонецФункции

Процедура ЗаполнитьСвойстваПротоколаИзОбъекта(ДанныеПротокола, Объект) Экспорт
	
	ЗаполнитьЗначенияСвойств(ДанныеПротокола, Объект);
	
КонецПроцедуры

// Проверяет изменение нового состояния относительно исходного.
// 
// Параметры:
//  НовоеСостояние - Структура
//  ИсходноеСостояние - Структура
//  ЭтоДобавлениеСтроки - Булево - Включает проверку заполненности комментария для учета изменений.
// 
// Возвращаемое значение:
//  Булево - Истина, при наличии изменений
Функция ИзменилисьСвойстваПротокола(НовоеСостояние, ИсходноеСостояние, ЭтоДобавлениеСтроки = Ложь) Экспорт
	
	ИзмененныеСвойства = ИзмененныеСвойстваПротокола(НовоеСостояние, ИсходноеСостояние);
	
	Если ЭтоДобавлениеСтроки
		И ИзмененныеСвойства.Количество() = 1
		И ИзмененныеСвойства.Свойство("Комментарий")
		И Не ЗначениеЗаполнено(НовоеСостояние.Комментарий) Тогда
		
		ВозвращаемоеЗначение = Ложь;
		
	Иначе
		
		ВозвращаемоеЗначение = ЗначениеЗаполнено(ИзмененныеСвойства);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Сравнивает два состояния протокола и возвращает изменения.
// 
// Параметры:
//  НовоеСостояние - Структура
//  ИсходноеСостояние - Структура
// 
// Возвращаемое значение:
//  Структура Из КлючИЗначение: 
//   * Ключ - Строка - Имя свойства протокола
//   * Значение - Произвольный - Значение из нового состояния
//
//@skip-check function-return-types -- Динамически создаваемая структура. Ключи не описываются.
Функция ИзмененныеСвойстваПротокола(НовоеСостояние, ИсходноеСостояние) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	Для Каждого КлючИЗначение Из НовоеСостояние Цикл
		
		Если КлючИЗначение.Значение = ИсходноеСостояние[КлючИЗначение.Ключ] Тогда
			Продолжить;
		КонецЕсли;
		
		ВозвращаемоеЗначение.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Структура со свойствами строки протокола:
// * Дата - Дата - Добавления записи в протокол.
// * Автор - СправочникСсылка.Пользователи - Автор добавленной записи.
// * Исполнитель - СправочникСсылка.Пользователи - Которому направлен документ.
// * Комментарий - Строка - Комментарий к перенаправлению.
// * Статус - Неопределено, ПеречислениеСсылка - Установленный статус документа
Функция СтруктураСтрокиПротокола() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("Дата",        '00010101');
	ВозвращаемоеЗначение.Вставить("Автор",       ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("Исполнитель", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("Комментарий", "");
	ВозвращаемоеЗначение.Вставить("Статус",      Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции
 
// Возвращаемое значение:
//  Структура - Структура со свойствами строки протокола, доступными для изменения:
// * Исполнитель - СправочникСсылка.Пользователи - Которому направлен документ.
// * Комментарий - Строка - Комментарий к перенаправлению.
// * Статус - Неопределено, ПеречислениеСсылка - Установленный статус документа
Функция ИзменяемыеСвойстваПротокола() Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	
	ВозвращаемоеЗначение.Вставить("Исполнитель", ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	ВозвращаемоеЗначение.Вставить("Комментарий", "");
	ВозвращаемоеЗначение.Вставить("Статус",      Неопределено);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти
