
Функция Ядро() Экспорт

	Возврат КонтурЛогистика_ИнтеграцияДиадокСервер.Ядро();
	
КонецФункции

Функция ПараметрыСервисаДиадок(boxID) Экспорт
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.ДанныеАутентификацииПоОрганизации(, boxID)
	
КонецФункции

Функция Токен(boxID) Экспорт

	Возврат КонтурЛогистика_ИнтеграцияДиадокСервер.Токен(boxID)	

КонецФункции

Функция ПодписыватьНаСервере(ОрганизацияДиадок, Пользователь1С, ДатаПодписи = Неопределено) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ПодписыватьНаСервере(ОрганизацияДиадок, Пользователь1С, ДатаПодписи);
	
КонецФункции

Функция ПодписыватьФайлНаСервере(Файл) Экспорт
	
	Возврат ПодписыватьНаСервере(Файл.Отправитель, Файл.ПользовательПодписант);
	
КонецФункции  

Функция ДанныеСертификатаДляПодписания(ОрганизацияДиадок, Пользователь1С, ДатаПодписи = Неопределено, ИспользоватьТолькоСерверные = Ложь, ДокументОбъектИлиСсылка = Неопределено, ДопПараметр = Неопределено) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ДанныеСертификатаДляПодписания(
		ОрганизацияДиадок, Пользователь1С, ДатаПодписи, ИспользоватьТолькоСерверные, ДокументОбъектИлиСсылка, ДопПараметр);
	
КонецФункции

Функция ДанныеСертификатаДляПодписанияФайла(Файл, ИспользоватьТолькоСерверные = Ложь) Экспорт
	
	Возврат ДанныеСертификатаДляПодписания(Файл.Отправитель, Файл.ПользовательПодписант,,
		ИспользоватьТолькоСерверные, Файл.СвязанныйДокумент, Файл.ПараметрНастроекПодписания);
	
КонецФункции

Функция ДанныеСертификатаДляСогласованияФайла(Файл, ИспользоватьТолькоСерверные = Ложь) Экспорт
	
	ДанныеПодписанта = КонтурЛогистика_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта_КонтурЛогистика(
		Файл.ГлавныйДокумент, "ПользовательПодписант, ПараметрНастроекПодписания");
	
	ДанныеСертификата = ДанныеСертификатаДляПодписания(Файл.Получатель, ДанныеПодписанта.ПользовательПодписант,,
		ИспользоватьТолькоСерверные, Файл.СвязанныйДокумент, ДанныеПодписанта.ПараметрНастроекПодписания);
	
	ДанныеСертификата.Вставить("ПользовательПодписант", ДанныеПодписанта.ПользовательПодписант);
	ДанныеСертификата.Вставить("ПараметрНастроекПодписания", ДанныеПодписанта.ПараметрНастроекПодписания);
	
	Возврат ДанныеСертификата;
	
КонецФункции

Функция ПолучитьПредставлениеСертификата(ДанныеСертификата) Экспорт
	
	Возврат РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ПолучитьПредставлениеСертификата(ДанныеСертификата);
	
КонецФункции
