&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборПоНаправлению = "Все";
	КонтурЛогистика_ОнбордингСервер.ПриСозданииФормы(ЭтаФорма);
	
	Если КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.РасширениеСДополнительнымиРеквизитамиУстановлено() 
		Или КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыОФПовтИсп.КонфигурацияСДополнительнымиРеквизитамиУстановлена() Тогда
		Элементы.ФормаОткрытьСправочникНастроекДополнительныхРеквизитов.Видимость = Истина;
		Элементы.ФормаЗаполнитьДополнительнымиРеквизитами.Видимость = Истина;
	Иначе
		Элементы.ФормаОткрытьСправочникНастроекДополнительныхРеквизитов.Видимость = Ложь;
		Элементы.ФормаЗаполнитьДополнительнымиРеквизитами.Видимость = Ложь;
	КонецЕсли;
		
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьНастройкиДополнительныхРеквизитов(, Истина);	
	
	ИспользуетсяПутевойЛист_5_02 = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист_5_02");
	Элементы.ФормаПеренестиНастройкиДляЭПЛВ502.Видимость = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНастройкиКонвертацииЭПЛФормата501()
		И ИспользуетсяПутевойЛист_5_02;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОткрытьОнбординг", 2, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОнбординг()
	
	КонтурЛогистика_ОнбордингКлиент.ПриОткрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовую(Команда)
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ФормаОбъекта",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоНаправлениюПриИзменении(Элемент)
	
	УстановитьОтборДинСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборДинСписка()
	
	Список.Отбор.Элементы.Очистить(); 
	
	Если  ОтборПоНаправлению <> "Все" Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
		ЭлементОтбора.ПравоеЗначение = Ложь;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));   
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НаправлениеКонвертации");
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		
		МассивЗначенийОтбора = Новый Массив;
		МассивЗначенийОтбора.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.ИсходящееВходящее"));
		
		Если ОтборПоНаправлению = "Исходящие" Тогда
			
			МассивЗначенийОтбора.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Исходящее"));
			
		ИначеЕсли ОтборПоНаправлению = "Входящие" Тогда
			
			МассивЗначенийОтбора.Добавить(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_НаправлениеКонвертации.Входящее"));
			
		КонецЕсли;
		
		ЭлементОтбора.ПравоеЗначение = МассивЗначенийОтбора;
		
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастроекДополнительныхРеквизитов(Команда)
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_НастройкиДополнительныхРеквизитов.Форма.ФормаСписка",,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительнымиРеквизитами(Команда)
	КонтурЛогистика_ОбщегоНазначенияСервер.ЗаполнитьНастройкиДополнительныхРеквизитов(Истина);		
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНастройкиДляЭПЛВ502(Команда)
	ПеренестиНастройкиДляЭПЛВ502НаСервере();		
КонецПроцедуры

&НаСервере
Процедура ПеренестиНастройкиДляЭПЛВ502НаСервере()
	Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПеренестиНастройкиКонвертацииДокументовДляЭПЛВФормат502(Ложь);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры
