#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьБанковскиеСчета();
	
КонецПроцедуры

&НаКлиенте 
Процедура ПриОткрытии(Отказ) 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры 

&НаСервере 
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьПоДатеПлатежа();
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 

// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 

&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 

&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.ФормаВыбора", ПараметрыПодбора, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыВБанк(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	СоздатьДокументыВБанкНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСчета(Команда)
	
	ОткрытьФорму("Справочник.БанковскиеСчетаОрганизаций.ФормаВыбора",, ЭтаФорма,,,, Новый ОписаниеОповещения("УказатьСчетаЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСчетаЗавершение(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		УстановитьБанковскийСчетВЗаявкахНаРасход(Значение);
		ОбновитьБанковскиеСчета();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ПлатежиЗаявкаНаРасходованиеДенежныхСредствПриИзменении(Элемент)
	
	ОбновитьБанковскиеСчета();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Процедура ЗаполнитьПоДатеПлатежа()
	
	Объект.Платежи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ПОМЕСТИТЬ ВТУжеВключенныеЗаявки
	|ИЗ
	|	Документ.АУ_РеестрПлатежей.Платежи КАК АУ_РеестрПлатежейПлатежи
	|ГДЕ
	|	АУ_РеестрПлатежейПлатежи.Ссылка <> &Ссылка
	|	И НЕ АУ_РеестрПлатежейПлатежи.Ссылка.ПометкаУдаления
	|	И НАЧАЛОПЕРИОДА(АУ_РеестрПлатежейПлатежи.Ссылка.Дата, ДЕНЬ) = &ДатаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредствДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредствДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ПО (СписаниеБезналичныхДенежныхСредств.ЗаявкаНаРасходованиеДенежныхСредств = ЗаявкаНаРасходованиеДенежныхСредствДокумент.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУжеВключенныеЗаявки КАК ВТУжеВключенныеЗаявки
	|		ПО ЗаявкаНаРасходованиеДенежныхСредствДокумент.Ссылка = ВТУжеВключенныеЗаявки.ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредствДокумент.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована)
	|	И НАЧАЛОПЕРИОДА(ЗаявкаНаРасходованиеДенежныхСредствДокумент.ДатаПлатежа, ДЕНЬ) = &ДатаПлатежа
	|	И ЗаявкаНаРасходованиеДенежныхСредствДокумент.Проведен
	|	И СписаниеБезналичныхДенежныхСредств.Ссылка ЕСТЬ NULL
	|	И ВТУжеВключенныеЗаявки.ЗаявкаНаРасходованиеДенежныхСредств ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаПлатежа", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Платежи.Добавить();
		НоваяСтрока.ЗаявкаНаРасходованиеДенежныхСредств = Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение <> Неопределено И ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		Для каждого стрЗаявка Из ВыбранноеЗначение Цикл
			
			Если Объект.Платежи.НайтиСтроки(Новый Структура("ЗаявкаНаРасходованиеДенежныхСредств", стрЗаявка)).Количество() = 0 Тогда
				
				НоваяСтрока = Объект.Платежи.Добавить();
				НоваяСтрока.ЗаявкаНаРасходованиеДенежныхСредств = стрЗаявка;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыВБанкНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ИЗ
	|	Документ.АУ_РеестрПлатежей.Платежи КАК АУ_РеестрПлатежейПлатежи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ПО АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств = СписаниеБезналичныхДенежныхСредств.ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	АУ_РеестрПлатежейПлатежи.Ссылка = &Ссылка
	|	И СписаниеБезналичныхДенежныхСредств.Ссылка ЕСТЬ NULL
	|	И АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Списание = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
		Списание.Заполнить(Выборка.ЗаявкаНаРасходованиеДенежныхСредств);
		Списание.Дата = ТекущаяДатаСеанса();
		Если Выборка.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам.Количество() > 0 Тогда
			Списание.БанковскийСчет = Выборка.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам[0].БанковскийСчетКасса;
		КонецЕсли;
		
		Попытка
			Списание.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("На основании %1 создано %2", Выборка.ЗаявкаНаРасходованиеДенежныхСредств, Списание.Ссылка), Списание.Ссылка);
		Исключение
			Ошибка = ОписаниеОшибки();
			Сообщить(СтрШаблон("Не удалось создать списание на основании %1 пр причине: %2", Выборка.ЗаявкаНаРасходованиеДенежныхСредств, Ошибка));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьБанковскиеСчета()
	
	Для каждого стрПлатеж Из Объект.Платежи Цикл
		
		Если стрПлатеж.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам.Количество() > 0 Тогда
			стрПлатеж.БанковскийСчет = стрПлатеж.ЗаявкаНаРасходованиеДенежныхСредств.РаспределениеПоСчетам[0].БанковскийСчетКасса;
		Иначе
			стрПлатеж.БанковскийСчет = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБанковскийСчетВЗаявкахНаРасход(Значение)
	
	Для каждого стрИдентификатор Из Элементы.Платежи.ВыделенныеСтроки Цикл
		
		стрПлатеж = Объект.Платежи.НайтиПоИдентификатору(стрИдентификатор);
		Если ЗначениеЗаполнено(стрПлатеж.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
			
			ЗаявкаОбъект = стрПлатеж.ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьОбъект();
			ЗаявкаОбъект.РаспределениеПоСчетам.Очистить();
			
			НоваяСтрока = ЗаявкаОбъект.РаспределениеПоСчетам.Добавить();
			НоваяСтрока.БанковскийСчетКасса = Значение;
			НоваяСтрока.Сумма = ЗаявкаОбъект.СуммаДокумента;
			НоваяСтрока.ДатаПлатежа = ЗаявкаОбъект.ДатаПлатежа;
			
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти