
// Получить описание опасного груза
//
// Параметры:
//  НомерООН			 - Строка	 - номер ООН
//  КлассификационныйКод - Строка	 - классификационный код
//  ГруппаУпаковки		 - Строка, ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки	 - группа упаковки
// 
// Возвращаемое значение:
//  СправочникСсылка.КонтурЛогистика_ОписанияОпасныхГрузов - описание груза
//
Функция ПолучитьОписаниеОпасногоГруза(НомерООН, КлассификационныйКод = Неопределено, ГруппаУпаковки = Неопределено) Экспорт
	
	Если ТипЗнч(ГруппаУпаковки) = Тип("ПеречислениеСсылка.КонтурЛогистика_ГруппыУпаковки") Тогда
		ГруппаУпаковкиЗначение = ГруппаУпаковки;
	Иначе
		// Пробуем сконвертировать
		Попытка
			ГруппаУпаковкиЗначение = Перечисления.КонтурЛогистика_ГруппыУпаковки[ГруппаУпаковки];
		Исключение
			ГруппаУпаковкиЗначение = ГруппаУпаковки;
		КонецПопытки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерООН", НомерООН);
	Запрос.УстановитьПараметр("ОтборПоКлассификационныйКод", ЗначениеЗаполнено(КлассификационныйКод));
	Запрос.УстановитьПараметр("КлассификационныйКод", КлассификационныйКод);
	Запрос.УстановитьПараметр("ОтборПоГруппаУпаковки", ЗначениеЗаполнено(ГруппаУпаковкиЗначение));
	Запрос.УстановитьПараметр("ГруппаУпаковки", ГруппаУпаковкиЗначение);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтурЛогистика_ОписанияОпасныхГрузов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОписанияОпасныхГрузов КАК КонтурЛогистика_ОписанияОпасныхГрузов
	|ГДЕ
	|	НЕ КонтурЛогистика_ОписанияОпасныхГрузов.ПометкаУдаления
	|	И КонтурЛогистика_ОписанияОпасныхГрузов.НомерООН = &НомерООН
	|	И (НЕ &ОтборПоКлассификационныйКод
	|			ИЛИ &ОтборПоКлассификационныйКод
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.КлассификационныйКод = &КлассификационныйКод)
	|	И (НЕ &ОтборПоГруппаУпаковки
	|			ИЛИ &ОтборПоГруппаУпаковки
	|				И КонтурЛогистика_ОписанияОпасныхГрузов.ГруппаУпаковки = &ГруппаУпаковки)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Берем первую
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции