#Область Интерфейс

Процедура ПриСозданииНаСервере_ФормаОбъекта(Форма, Отказ, Параметры = Неопределено) Экспорт
	
	// Документы
	Если Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ДокументЗаказПоставщикуФорма(Форма, Отказ, Параметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.АвансовыйОтчет.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ДокументАвансовыйОтчетФорма(Форма, Отказ, Параметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПриобретениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ДокументПриобретениеТоваровУслугФорма(Форма, Отказ, Параметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.РасходныйКассовыйОрдер.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ДокументРасходныйКассовыйОрдерФорма(Форма, Отказ, Параметры);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента" Тогда 
		ПриСозданииНаСервере_ДокументПриходныйКассовыйОрдерФорма(Форма, Отказ, Параметры);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаЭлемента" Тогда 
		ПриСозданииНаСервере_СправочникПартнерыФорма(Форма, Отказ, Параметры);
	КонецЕсли;
	           
КонецПроцедуры


#КонецОбласти

#Область НастройкаФорм

Процедура ПриСозданииНаСервере_СправочникПартнерыФорма(Форма, Отказ, Параметры)
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_СтатьяБюджета", Тип("ПолеФормы"),Форма.Элементы.ГруппаРодительБизнесРегион);
	НовыйЭлемент.Заголовок = "Статья бюджета";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АУ_СтатьяБюджета";
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ДокументЗаказПоставщикуФорма(Форма, Отказ, Параметры)
	
	//Форма.Элементы.ГруппаОснование.Группировка=ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НоваяКоманда = Форма.Команды.Добавить("АУ_СменитьЗаказКлиента");
	НоваяКоманда.Заголовок = "Сменить заказ";
	НоваяКоманда.Действие = "АУ_СменитьЗаказКлиента"; //указываем только имя процедуры
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_СменитьЗаказКлиента", Тип("КнопкаФормы"),Форма.Элементы.ГруппаСтатусПриоритет);
	НовыйЭлемент.Заголовок = "Сменить заказ";
	НовыйЭлемент.ИмяКоманды = "АУ_СменитьЗаказКлиента";
	НовыйЭлемент.Вид=ВидКнопкиФормы.Гиперссылка;
	
	НоваяКоманда = Форма.Команды.Добавить("АУ_ОтвязатьОтЗаказаКлиента");
	НоваяКоманда.Заголовок = "Отвязать от заказа";               
	НоваяКоманда.Действие = "АУ_ОтвязатьОтЗаказаКлиента"; //указываем только имя процедуры
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_ОтвязатьОтЗаказаКлиента", Тип("КнопкаФормы"),Форма.Элементы.ГруппаСтатусПриоритет);
	НовыйЭлемент.Заголовок = "Отвязать от заказа";
	НовыйЭлемент.ИмяКоманды = "АУ_ОтвязатьОтЗаказаКлиента";
	НовыйЭлемент.Вид=ВидКнопкиФормы.Гиперссылка;
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_ЗаказКлиента", Тип("ПолеФормы"),Форма.Элементы.Товары);
	НовыйЭлемент.Заголовок = "Заказ клиента";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.АУ_ЗаказКлиента";
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_КодСтроки", Тип("ПолеФормы"),Форма.Элементы.Товары);
	НовыйЭлемент.Заголовок = "ИД строки ЗК";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.АУ_КодСтроки";
	НовыйЭлемент.ТолькоПросмотр=Истина;
	
	Если НЕ ЗначениеЗаполнено(Форма.Объект.ДокументОснование) Тогда
		
		Форма.Элементы.АУ_СменитьЗаказКлиента.Заголовок="Установить заказ";
		
	КонецЕсли;
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_КоличествоДнейДоПоставки", Тип("ПолеФормы"),Форма.Элементы.ГруппаОплатаРасчеты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АУ_КоличествоДнейДоПоставки";
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ДокументАвансовыйОтчетФорма(Форма, Отказ, Параметры)
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_ЗаказКлиента", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	НовыйЭлемент.Заголовок = "Заказ клиента";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.АУ_ЗаказКлиента";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ПрочиеРасходыАУ_ЗаказКлиента", Тип("ПолеФормы"),Форма.Элементы.ПрочиеРасходы);
	НовыйЭлемент.Заголовок = "Заказ клиента";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ПрочиеРасходы.АУ_ЗаказКлиента";
	
	НовыйЭлемент = Форма.Элементы.Добавить("ОплатаПоставщикамАУ_ЗаказКлиента", Тип("ПолеФормы"),Форма.Элементы.ОплатаПоставщикам);
	НовыйЭлемент.Заголовок = "Заказ клиента";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ОплатаПоставщикам.АУ_ЗаказКлиента";
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ДокументПриобретениеТоваровУслугФорма(Форма, Отказ, Параметры)
	
	НоваяКоманда = Форма.Команды.Добавить("АУ_СменитьЗаказПоставщику");
	НоваяКоманда.Заголовок = "Сменить заказ";
	НоваяКоманда.Действие = "АУ_СменитьЗаказПоставщику"; //указываем только имя процедуры
	
	НовыйЭлемент = Форма.Элементы.Добавить("АУ_СменитьЗаказПоставщику", Тип("КнопкаФормы"),Форма.Элементы.ГруппаЗаказ);
	НовыйЭлемент.Заголовок = "Сменить заказ";
	НовыйЭлемент.ИмяКоманды = "АУ_СменитьЗаказПоставщику";
	НовыйЭлемент.Вид=ВидКнопкиФормы.Гиперссылка;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ДокументРасходныйКассовыйОрдерФорма(Форма, Отказ, Параметры)
	
	СтраницаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьСтраница(Форма,"АУ_СтраницаСтатьиБюджета",Форма.Элементы.ГруппаСтраницы,"Статьи бюджета",1);
	ТаблицаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(Форма,"АУ_СтатьиБюджета",СтраницаСтатьиБюджета,"Объект.АУ_СтатьиБюджета",Новый Структура("СтатьяБюджета,Сумма","Статья бюджета","Сумма"));
	
	Форма.Элементы.АУ_СтатьиБюджета.УстановитьДействие("ПриНачалеРедактирования","ПриНачалеРедактированияСтатейБюджета");
	
КонецПроцедуры

Процедура ПриСозданииНаСервере_ДокументПриходныйКассовыйОрдерФорма(Форма, Отказ, Параметры)
	
	СтраницаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьСтраница(Форма,"АУ_СтраницаСтатьиБюджета",Форма.Элементы.ГруппаСтраницы,"Статьи бюджета",1);
	ТаблицаСтатьиБюджета=АУ_СозданиеЭлементовФормы.СоздатьТаблицаФормы(Форма,"АУ_СтатьиБюджета",СтраницаСтатьиБюджета,"Объект.АУ_СтатьиБюджета",Новый Структура("СтатьяБюджета,Сумма","Статья бюджета","Сумма"));
	
	Форма.Элементы.АУ_СтатьиБюджета.УстановитьДействие("ПриНачалеРедактирования","ПриНачалеРедактированияСтатейБюджета");
	
КонецПроцедуры
	
#КонецОбласти