#Область Интерфейс

Процедура ПоместитьВБуфер(Данные) Экспорт
	
	ПараметрыСеанса.АУ_Буфер = ЗначениеВСтрокуВнутр(Данные);
	
КонецПроцедуры

Функция ПолучитьНазваниеФайлаРеестраПлатежей(Документ, Представление) Экспорт
	
	Массив = СтрРазделить(Представление, ".", Ложь);
	Расширение = Массив[Массив.Количество() - 1];
	
	Возврат СтрШаблон("%1-й реестр за %2.%3", СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Прав(Документ.Номер, 6)), Формат(Документ.Дата, "ДФ=dd.MM.yyyy"), Расширение)
	
КонецФункции

Функция РассчитатьКрайниеДатыПоставокПоЗаказам(Договор, КоличествоДней = Неопределено) Экспорт
	
	ДатаНачала = Договор.ДатаНачалаДействия;
	
	Если НЕ КоличествоДней = Неопределено Тогда
		
		ДатаОкончания = ДатаНачала + 86400 * КоличествоДней;
		ДатаОкончания = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьБлижайшуюРабочуюДату(ДатаОкончания);
		
		Возврат ДатаОкончания;
		
	ИначеЕсли Договор.АУ_ВариантУказанияСроковПоставки = Перечисления.АУ_ВариантыУказанияСроковПоставки.ВДоговоре И Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Договор = &Договор";
		
		Запрос.УстановитьПараметр("Договор", Договор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДатаОкончания = ДатаНачала + 86400 * Договор.АУ_КоличествоДнейНаПоставку;
		ДатаОкончания = АУ_ОбщиеПроцедурыИФункцииСервер.ПолучитьБлижайшуюРабочуюДату(ДатаОкончания);
		
		ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Истина);
		
		Пока Выборка.Следующий() Цикл
			
			ЗаказОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаказОбъект.АУ_КоличествоДнейНаПоставку = Договор.АУ_КоличествоДнейНаПоставку;
			ЗаказОбъект.АУ_КрайняяДатаПоставки = ДатаОкончания;
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЦикла;
		
		ДатыЗапретаИзменения.ОтключитьПроверкуДатЗапрета(Ложь);
		
	КонецЕсли;
	
КонецФункции

Функция ПеревестиНоменклатуруНаНовыйУчет(Номенклатура) Экспорт
	
	Если НЕ Номенклатура.ВидНоменклатуры.АУ_НеИспользуется Тогда
		Сообщить("Перевод номенклатуры на новый вид учета не требуется !");
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрНайти(Номенклатура.Наименование, "не использовать") > 0 Тогда
		Сообщить("Перевод номенклатуры на новый вид учета не требуется !");
		Возврат Неопределено;
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		ГруппаАрхив = ПолучитьАрхивнуюГруппуРекурсивно(Номенклатура.Родитель);
		
		ТекОбъект = Номенклатура.ПолучитьОбъект();
		НовыйОбъект = Номенклатура.Скопировать();
		НовыйОбъект.УстановитьНовыйКод();
		
		ТекОбъект.Наименование = "(не использовать)"+ТекОбъект.Наименование;
		ТекОбъект.Родитель = ГруппаАрхив;
		ТекОбъект.ОбменДанными.Загрузка = Истина;
		ТекОбъект.Записать();
		
		НовыйВид = ПолучитьВидНоменклатурыДляНовогоУчета(ТекОбъект.ВидНоменклатуры);
		
		НовыйОбъект.ВидНоменклатуры = НовыйВид;
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НовыйОбъект,
																	Ложь,
																	Ложь);
		НовыйОбъект.ОбменДанными.Загрузка = Истина;
		НовыйОбъект.Записать();
		
		//ставки НДС
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДСНоменклатуры.Период КАК Период,
		|	СтавкиНДСНоменклатуры.Номенклатура КАК Номенклатура,
		|	СтавкиНДСНоменклатуры.Страна КАК Страна,
		|	СтавкиНДСНоменклатуры.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	РегистрСведений.СтавкиНДСНоменклатуры КАК СтавкиНДСНоменклатуры
		|ГДЕ
		|	СтавкиНДСНоменклатуры.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			рег = РегистрыСведений.СтавкиНДСНоменклатуры.СоздатьМенеджерЗаписи();
			рег.Период = Выборка.Период;
			рег.Номенклатура = НовыйОбъект.Ссылка;
			рег.Страна = Выборка.Страна;
			рег.СтавкаНДС = Выборка.СтавкаНДС;
			рег.Записать(Истина);
			
		КонецЦикла;
		
		//штрихкоды
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			рег = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			рег.Штрихкод = Выборка.Штрихкод;
			рег.Номенклатура = НовыйОбъект.Ссылка;
			рег.Упаковка = Выборка.Упаковка;
			рег.Записать(Истина);
			
		КонецЦикла;
		
		//публичные идентфиикаторы
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("50e1e88f-c391-4c75-abe3-1ed5c94f29cc");
		
		рег = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьМенеджерЗаписи();
		рег.Идентификатор = Номенклатура.УникальныйИдентификатор();
		рег.Ссылка = Номенклатура;
		рег.УзелИнформационнойБазы = Узел;
		рег.Записать(Истина);
		
		рег = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьМенеджерЗаписи();
		рег.Идентификатор = Номенклатура.УникальныйИдентификатор();
		рег.Ссылка = НовыйОбъект.Ссылка;
		рег.УзелИнформационнойБазы = Узел;
		рег.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
		Сообщить("Номенклатура переведена на новый учет, старая помещена в архив !");
		
		Возврат НовыйОбъект.Ссылка;
		
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСписокОбъектовДляВыбора(Текст) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АУ_Объекты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.АУ_Объекты КАК АУ_Объекты
	|ГДЕ
	|	АУ_Объекты.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СтрШаблон("%%%1%%", Текст));
	
	Результат = Новый СписокЗначений;
	Результат.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование"));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОсновнуюОрганизацию() Экспорт
	
	Возврат АУ_ОбщиеПроцедурыИФункцииСерверПовтИсп.ПолучитьЗначениеНастройки("ОрганизацияАурум");
	
КонецФункции

Процедура ИзменитьБанковскийСчетВЗРДС(МассивДокументов, БанковскийСчет) Экспорт
	
	Для каждого стрДокумент Из МассивДокументов Цикл
		
		Если стрДокумент.Организация <> БанковскийСчет.Владелец Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОбъект = стрДокумент.ПолучитьОбъект();
		
		Сумма = ТекОбъект.СуммаДокумента;
		ДатаПлатежа = ТекОбъект.ДатаПлатежа;
		
		Для каждого стр Из ТекОбъект.РаспределениеПоСчетам Цикл
			ДатаПлатежа = Макс(стр.ДатаПлатежа, ДатаПлатежа);
		КонецЦикла;
		
		ТекОбъект.РаспределениеПоСчетам.Очистить();
		
		НоваяСтрока = ТекОбъект.РаспределениеПоСчетам.Добавить();
		НоваяСтрока.БанковскийСчетКасса = БанковскийСчет;
		НоваяСтрока.Сумма = Сумма;
		НоваяСтрока.ДатаПлатежа = ДатаПлатежа;
		
		Если ТекОбъект.Проведен Тогда
			ТекОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменен банковский счет в документе %1", стрДокумент), стрДокумент);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Служебные

Функция ПолучитьАрхивнуюГруппуРекурсивно(Группа)
	
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
		Возврат Справочники.Номенклатура.НайтиПоКоду("У1-00030767");
	КонецЕсли;
		
	ГруппаАрхив = ПолучитьАрхивнуюГруппуРекурсивно(Группа.Родитель);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование = &Наименование
	|	И Номенклатура.ЭтоГруппа
	|	И Номенклатура.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Наименование", Группа.Наименование);
	Запрос.УстановитьПараметр("Родитель", ГруппаАрхив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Ссылка <> NULL Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НоваяГруппа.Родитель = ГруппаАрхив;
	НоваяГруппа.Наименование = Группа.Наименование;
	НоваяГруппа.Записать();
	
	Возврат НоваяГруппа.Ссылка;
	
КонецФункции

Функция ПолучитьВидНоменклатурыДляНовогоУчета(ВидНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.ОсобенностьУчета = &ОсобенностьУчета
	|	И ВидыНоменклатуры.Ссылка В (&Список)";
	
	Запрос.УстановитьПараметр("ОсобенностьУчета", ВидНоменклатуры.ОсобенностьУчета);
	
	Массив = Новый Массив;
	Массив.Добавить(Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("310d1b43-7872-11f0-a7aa-9418826e6967")));
	Массив.Добавить(Справочники.ВидыНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("eb68805c-7871-11f0-a7aa-9418826e6967")));
	Запрос.УстановитьПараметр("Список", Массив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

#КонецОбласти