#Область ПрограммныйИнтерфейс

// Возвращает признак принадлежности переданного в параметре вида продукции к виду продукции ИС МП.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ,
//                               СправочникСсылка.ВидыПродукцииИС.
//  ВключаяТабачнуюПродукцию - Булево - Признак включения табачной продукции.
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ИСМП
Функция ЭтоПродукцияИСМП(ВидПродукцииТоварнаяГруппа, ВключаяТабачнуюПродукцию = Ложь) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ВидПродукцииТоварнаяГруппа, ВключаяТабачнуюПродукцию);
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к табачной продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ,
//                               СправочникСсылка.ВидыПродукцииИС.
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ИСМП
Функция ЭтоПродукцияМОТП(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияМОТП(ВидПродукцииТоварнаяГруппа);
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к ВетИС.
// 
// Параметры:
//  ВидПродукции - СправочникСсылка.КлючиВидовПродукцииИС,
//                 СправочникСсылка.ВидыПродукцииИС.
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ВетИС
Функция ЭтоПродукцияВЕТИС(ВидПродукции) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(ВидПродукции);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Определяет включено ли ведение учета продукции, подлежащей маркированию.
//
// Параметры:
// 	РасширеннаяВерсияГосИС - Булево
// Возвращаемое значение:
//  Булево - Истина, если учет ведется.
Функция ВедетсяУчетМаркируемойПродукции(РасширеннаяВерсияГосИС) Экспорт
	
	Если РасширеннаяВерсияГосИС Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИС");
		УчитываемыеВидыМаркируемойПродукции = Модуль.УчитываемыеВидыМаркируемойПродукции();
		
		Возврат УчитываемыеВидыМаркируемойПродукции.Количество() > 0;
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к алкогольной продукции.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ,
//                               СправочникСсылка.ВидыПродукцииИС.
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ЕГАИС
//
Функция ЭтоПродукцияЕГАИС(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияЕГАИС(ВидПродукцииТоварнаяГруппа);
	
КонецФункции

// Возвращает признак того, является ли переданный в параметре вид продукции ЕГАИС маркируемым
// 
// Параметры:
//  ВидПродукции - СправочникСсылка.ВидыПродукцииИС
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ЕГАИС
//
Функция ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции) Экспорт
	
	Возврат КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоМаркируемаяПродукцияЕГАИС(ВидПродукции);
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к изделиям из натурального меха.
// 
// Параметры:
//  ВидПродукцииТоварнаяГруппа - СправочникСсылка.ТоварныеГруппыГИСМТ,
//                               СправочникСсылка.ВидыПродукцииИС.
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции ИСМП
//
Функция ЭтоПродукцияМЕХ(ВидПродукцииТоварнаяГруппа) Экспорт
	
	Возврат КонструкторИСМПОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(ВидПродукцииТоварнаяГруппа);
	
КонецФункции

// Классифицирует текущий сеанс, как сеанс, запущенный в фоновом задании в клиент-серверном варианте, в остальных
// случаях, сеанс имеет ту же файловую систему на стороне сервера, что и основной сеанс.
//	
// Возвращаемое значение:
// 	Булево - Описание
Функция ЭтоФоновоеЗаданиеНаСервере() Экспорт
	Возврат ОбщегоНазначенияИСВызовСервера.ЭтоФоновоеЗаданиеНаСервере();
КонецФункции

Функция ТаблицаВидовПродукцииПеречислений() Экспорт
	
	ОписаниеТипаВидыПродукцииИС = Новый ОписаниеТипов("СправочникСсылка.ВидыПродукцииИС");
	ИменаПолейКлюча             = КонструкторИСОбщегоНазначенияКлиентСервер.ИменаПолейКлючаВидовПродукции();
	ТаблицаПоВидамПродукции     = Новый ТаблицаЗначений();
	СтрокаИменПолей             = СтрСоединить(ИменаПолейКлюча, ",");
	ТаблицаПоВидамПродукции.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	Для Каждого ИмяПоля Из ИменаПолейКлюча Цикл
		ТаблицаПоВидамПродукции.Колонки.Добавить(ИмяПоля, ОписаниеТипаВидыПродукцииИС);
	КонецЦикла;
	
	ТаблицаПоВидамПродукции.Индексы.Добавить(СтрокаИменПолей);
	
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыПродукцииИС Цикл
		
		ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииПоЗначениюПеречисления(
			ЗначениеПеречисления);
		
		Если Не ЗначениеЗаполнено(ВидыПродукции) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоляКлюча = Новый Структура();
		
		Для Каждого ИмяПоля Из ИменаПолейКлюча Цикл
			ПоляКлюча.Вставить(ИмяПоля, Новый Массив);
		КонецЦикла;
		
		Для Каждого ВидПродукции Из ВидыПродукции Цикл
			
			Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияВЕТИС(ВидПродукции) Тогда
				ПоляКлюча.ВидПродукцииВЕТИС.Добавить(ВидПродукции);
			ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции, Истина) Тогда
				ПоляКлюча.ВидПродукцииГИСМТ.Добавить(ВидПродукции);
			ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияЕГАИС(ВидПродукции) Тогда
				ПоляКлюча.ВидПродукцииЕГАИС.Добавить(ВидПродукции);
			ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияЗЕРНО(ВидПродукции) Тогда
				ПоляКлюча.ВидПродукцииЗЕРНО.Добавить(ВидПродукции);
			ИначеЕсли КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияСАТУРН(ВидПродукции) Тогда
				ПоляКлюча.ВидПродукцииСАТУРН.Добавить(ВидПродукции);
			ИначеЕсли ЗначениеПеречисления <> Перечисления.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов Тогда
				ВызватьИсключение СтрШаблон(
					НСтр("ru='Не определена подсистема для вида продукции %1. Обновите классификатор видов продукции.'"),
					ВидПродукции);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из ПоляКлюча Цикл
			Если КлючИЗначение.Значение.Количество() = 0 Тогда
				КлючИЗначение.Значение.Добавить(Справочники.ВидыПродукцииИС.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ВидПродукцииВЕТИС Из ПоляКлюча.ВидПродукцииВЕТИС Цикл
			Для Каждого ВидПродукцииГИСМТ Из ПоляКлюча.ВидПродукцииГИСМТ Цикл
				Для Каждого ВидПродукцииЕГАИС Из ПоляКлюча.ВидПродукцииЕГАИС Цикл
					Для Каждого ВидПродукцииЗЕРНО Из ПоляКлюча.ВидПродукцииЗЕРНО Цикл
						Для Каждого ВидПродукцииСАТУРН Из ПоляКлюча.ВидПродукцииСАТУРН Цикл
							НоваяСтрока = ТаблицаПоВидамПродукции.Добавить();
							НоваяСтрока.Ссылка             = ЗначениеПеречисления;
							НоваяСтрока.ВидПродукцииСАТУРН = ВидПродукцииСАТУРН;
							НоваяСтрока.ВидПродукцииЗЕРНО  = ВидПродукцииЗЕРНО;
							НоваяСтрока.ВидПродукцииЕГАИС  = ВидПродукцииЕГАИС;
							НоваяСтрока.ВидПродукцииГИСМТ  = ВидПродукцииГИСМТ;
							НоваяСтрока.ВидПродукцииВЕТИС  = ВидПродукцииВЕТИС;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаПоВидамПродукции;
	
КонецФункции

Функция ПредставленияВскрытыхПотребительскихУпаковок(ИмяПодсистемы) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ЗаголовокСписка", НСтр("ru='Вскрытые потребительские упаковки ИС МП'"));
	ВозвращаемоеЗначение.Вставить("ЗаголовокЗаписи", НСтр("ru='Вскрытие потребительской упаковки ИС МП'"));
	
	ВидыПродукции = ОбщегоНазначенияИСВызовСервера.ВидыПродукцииИспользующиеВскрытыеПотребительскихУпаковок(
		ИмяПодсистемы = "ИСМП", ИмяПодсистемы = "ЕГАИС");
	
	Если ИмяПодсистемы = "ИСМП" Тогда
		
		Если ВидыПродукции.Количество() = 1
			И КонструкторИСМПОбщегоНазначенияКлиентСервер.ПоддерживаетсяПодключениеКОборудованиюРозлива(ВидыПродукции[0]) Тогда
			
			ВозвращаемоеЗначение.ЗаголовокСписка = НСтр("ru='Кеги на оборудовании розлива ИС МП'");
			ВозвращаемоеЗначение.ЗаголовокЗаписи = НСтр("ru='Подключение кега к оборудованию розлива'");
			
		КонецЕсли;
		
	ИначеЕсли ИмяПодсистемы = "ЕГАИС" Тогда
		
		ВозвращаемоеЗначение.ЗаголовокСписка = НСтр("ru='Вскрытые бутылки ЕГАИС'");
		ВозвращаемоеЗначение.ЗаголовокЗаписи = НСтр("ru='Вскрытие бутылки ЕГАИС'");
		
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(ВозвращаемоеЗначение);
	
КонецФункции

// Возвращает объект ЗащищенноеСоединениеOpenSSL
// 
// Возвращаемое значение:
// 	ЗащищенноеСоединениеOpenSSL - Описание
Функция ЗащищенноеСоединение() Экспорт
	
	Возврат ОбщегоНазначенияИСКлиентСерверПовтИсп.ЗащищенноеСоединение();
	
КонецФункции

// Полное имя метаданных номенклатуры.
// 
// Возвращаемое значение:
//  Строка - полное имя справочника Номенклатура
Функция ПолноеИмяМетаданныхНоменклатуры() Экспорт
	ПустаяНоменклатура = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Номенклатура");
	Возврат ПустаяНоменклатура.Метаданные().ПолноеИмя();
КонецФункции

// см. ОбщегоНазначения.ОбщийМодуль
Функция ОбщийМодуль(Имя) Экспорт
	Возврат ОбщегоНазначения.ОбщийМодуль(Имя);
КонецФункции

// Получает цвет стиля по имени элемента стиля.
//
// Параметры:
//  ИмяЦветаСтиля - Строка
//
// Возвращаемое значение:
//  Цвет
//
Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
	
КонецФункции

#КонецОбласти