
#Область ПрограммныйИнтерфейс

#Область ПоискНаФормахПодборов

// Процедура выполняет обновление индекса полнотекстового поиска в привилегированном режиме.
//
Процедура ОбновитьИндексПолнотекстовогоПоиска() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПолнотекстовыйПоиск.ОбновитьИндекс();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция возвращает упаковку хранения номенклатуры, т.е. упаковку с коэффициентом 1 и
//  единицей хранения соответствующей единице хранения номенклатуры.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
// 
// Возвращаемое значение:
//  СправочникСсылка.УпаковкиЕдиницыИзмерения - упаковка хранения или единица измерения номенклатуры.
//
Функция ПолучитьУпаковкуХранения(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	ЕСТЬNULL(СпрУпаковки.Ссылка, НЕОПРЕДЕЛЕНО) КАК Упаковка,
	|	ПРЕДСТАВЛЕНИЕ(СпрУпаковки.Ссылка) КАК УпаковкаПредставление,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) КАК ЕдиницаИзмеренияУпаковки,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения.Представление, """") КАК ЕдиницаИзмеренияУпаковкиПредставление,
	|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) КАК Коэффициент
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО (СпрУпаковки.Владелец = ВЫБОР
	|			КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|				ТОГДА СпрНоменклатура.Ссылка
	|			КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|				ТОГДА СпрНоменклатура.НаборУпаковок
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|		И (НЕ СпрУпаковки.ПометкаУдаления)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|	И ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) = 1
	|	И ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) = СпрНоменклатура.ЕдиницаИзмерения
	|	И ЕСТЬNULL(СпрУпаковки.ТипУпаковки, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.ТипыУпаковокНоменклатуры.ТоварноеМесто)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Коэффициент,
	|	ЕдиницаИзмеренияУпаковкиПредставление";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"СпрУпаковки", Неопределено));
		
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Упаковка;
	
КонецФункции

// Возвращает структуру - информацию о цене продажи и остатках товара.
//
// Параметры:
// 	Параметры - см. ПодборТоваровКлиентСервер.НовыйПараметрыПолученияЦеныИОстатковТовара
//
// Возвращаемое значение:
// 	Структура:
// 		* ТекущиеОстатки - Массив Из Структура:
// 			** Склад - СправочникСсылка.Склады
// 			** ВНаличии - Число
// 			** Свободно - Число
// 		* ПланируемыеОстатки - Массив Из Структура:
// 			** Склад - СправочникСсылка.Склады
// 			** Период - Дата
// 			** Доступно - Число
// 		* Цена - Структура:
// 			** Цена - Число
// 			** Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
// 			** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
// 			** ВидЦены - СправочникСсылка.ВидыЦен
// 			** Описание - Строка
// 			** СрокПоставки - Дата
//
Функция ЦенаПродажиИОстаткиТовара(Параметры) Экспорт
	
	ТекущиеОстатки = Новый Массив();
	ПланируемыеОстатки = Новый Массив();
	
	ЦенаПродажи = Новый Структура();
	ЦенаПродажи.Вставить("ВидЦены", Справочники.ВидыЦен.ПустаяСсылка());
	ЦенаПродажи.Вставить("Цена", 0);
	ЦенаПродажи.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ЦенаПродажи.Вставить("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ЦенаПродажи.Вставить("Описание", "");
	ЦенаПродажи.Вставить("СрокПоставки", Дата(1, 1, 1));
	
	Если Параметры.ПолучитьОстатки
		Или Параметры.ПолучитьЦену Тогда
		
		СоставРазделовЗапроса = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Параметры.Характеристика);
		Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
		Запрос.УстановитьПараметр("Соглашение", Параметры.Соглашение);
		Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("ВидыЦен", Параметры.ВидыЦен);
		Запрос.УстановитьПараметр("Склады", Параметры.Склады);
		Запрос.УстановитьПараметр("КонтролируемаяПартия", Параметры.КонтролируемаяПартия);
		
		Коэффициент = 1;
		
		// цена продажи
		Если Параметры.ПолучитьЦену Тогда
			
			Запрос.Текст = ПодборТоваровСервер.ТекстЗапросаЦенаПродажиТовара(СоставРазделовЗапроса);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Коэффициент = Выборка.Коэффициент;
				ЗаполнитьЗначенияСвойств(ЦенаПродажи, Выборка);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// планируемые и текущие остатки
		Если Параметры.ПолучитьОстатки Тогда
			
			ТекущийСклад = Неопределено;
			
			Запрос.Текст = ОбеспечениеВДокументахСервер.ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(
				ЗначениеЗаполнено(Параметры.Характеристика),
				СоставРазделовЗапроса,
				Параметры.КонтролируемаяПартия);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Склад <> ТекущийСклад Тогда
					
					НоваяСтрока = Новый Структура("Склад,Запас,Свободно");
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.Свободно = ?(Выборка.Состояние = 0, Выборка.Свободно, 0) / Коэффициент;
					НоваяСтрока.Запас = ?(Выборка.Состояние = 0, Выборка.Запас, 0) / Коэффициент;
					ТекущиеОстатки.Добавить(НоваяСтрока);
					
					ТекущийСклад = Выборка.Склад;
					ДоступноКДате = 0;
					ЗапасКДате = 0;
					
				КонецЕсли;
				
				ДоступноКДате = ДоступноКДате + Выборка.Свободно;
				ЗапасКДате = ЗапасКДате + Выборка.Запас;
				
				Если Выборка.Состояние = 1 Тогда
					
					НоваяСтрока = Новый Структура;
					НоваяСтрока.Вставить("Склад");
					НоваяСтрока.Вставить("Период");
					НоваяСтрока.Вставить("Запас");
					НоваяСтрока.Вставить("Доступно");
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.Доступно = ДоступноКДате / Коэффициент;
					НоваяСтрока.Запас = ЗапасКДате / Коэффициент;
					ПланируемыеОстатки.Добавить(НоваяСтрока);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ТекущиеОстатки, ПланируемыеОстатки, Цена",
		ТекущиеОстатки,
		ПланируемыеОстатки,
		ЦенаПродажи);
	
КонецФункции

// Возвращает структуру - информацию о цене закупки и остатках товара.
//
// Параметры:
// 	Параметры - см. ПодборТоваровКлиентСервер.НовыйПараметрыПолученияЦеныИОстатковТовара
//
// Возвращаемое значение:
// 	Структура:
// 		* ТекущиеОстатки - Массив Из Структура:
// 			** Склад - СправочникСсылка.Склады
// 			** ВНаличии - Число
// 			** Свободно - Число
// 		* ПланируемыеОстатки - Массив Из Структура:
// 			** Склад - СправочникСсылка.Склады
// 			** Период - Дата
// 			** Доступно - Число
// 		* Цена - Структура:
// 			** Цена - Число
// 			** Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения
// 			** ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//
Функция ЦенаЗакупкиИОстаткиТовара(Параметры) Экспорт
	
	ТекущиеОстатки = Новый Массив();
	ПланируемыеОстатки = Новый Массив();
	
	ЦенаЗакупки = Новый Структура();
	ЦенаЗакупки.Вставить("Цена", 0);
	ЦенаЗакупки.Вставить("Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	ЦенаЗакупки.Вставить("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
	Если Параметры.ПолучитьОстатки
		Или Параметры.ПолучитьЦену Тогда
		
		СоставРазделовЗапроса = Неопределено;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Параметры.Характеристика);
		Запрос.УстановитьПараметр("Валюта", Параметры.Валюта);
		Запрос.УстановитьПараметр("Соглашение", Параметры.Соглашение);
		Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
		Запрос.УстановитьПараметр("Склады", Параметры.Склады);
		
		Коэффициент = 1;
		
		// цена закупки
		Если Параметры.ПолучитьЦену Тогда
			
			Запрос.Текст = ПодборТоваровСервер.ТекстЗапросаЦенаЗакупкиТовара(СоставРазделовЗапроса);
			
			Если ПодборТоваровСервер.ЕстьЗначенияЦенНоменклатурыПозжеДатыПодбора(ТекущаяДатаСеанса()) Тогда
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст,
					"&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату",
					"КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)");
				
			Иначе
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст,
					"&ЦеныНоменклатурыПоставщиковСрезПоследнихНаДату",
					"");
				
			КонецЕсли;
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Коэффициент = Выборка.Коэффициент;
				ЗаполнитьЗначенияСвойств(ЦенаЗакупки, Выборка);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// планируемые и текущие остатки
		Если Параметры.ПолучитьОстатки Тогда
			
			ТекущийСклад = Неопределено;
			
			Запрос.Текст = ОбеспечениеВДокументахСервер.ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(
				ЗначениеЗаполнено(Параметры.Характеристика),
				СоставРазделовЗапроса,
				Неопределено);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Склад <> ТекущийСклад Тогда
					
					НоваяСтрока = Новый Структура("Склад,Запас,Свободно");
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.Свободно = ?(Выборка.Состояние = 0, Выборка.Свободно, 0) / Коэффициент;
					НоваяСтрока.Запас = ?(Выборка.Состояние = 0, Выборка.Запас, 0) / Коэффициент;
					ТекущиеОстатки.Добавить(НоваяСтрока);
					
					ТекущийСклад = Выборка.Склад;
					ДоступноКДате = 0;
					ЗапасКДате = 0;
					
				КонецЕсли;
				
				ДоступноКДате = ДоступноКДате + Выборка.Свободно;
				ЗапасКДате = ЗапасКДате + Выборка.Запас;
				
				Если Выборка.Состояние = 1 Тогда
					
					НоваяСтрока = Новый Структура;
					НоваяСтрока.Вставить("Склад");
					НоваяСтрока.Вставить("Период");
					НоваяСтрока.Вставить("Запас");
					НоваяСтрока.Вставить("Доступно");
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.Доступно = ДоступноКДате / Коэффициент;
					НоваяСтрока.Запас = ЗапасКДате / Коэффициент;
					ПланируемыеОстатки.Добавить(НоваяСтрока);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("ТекущиеОстатки, ПланируемыеОстатки, Цена",
		ТекущиеОстатки,
		ПланируемыеОстатки,
		ЦенаЗакупки);
	
КонецФункции

#КонецОбласти

#Область ОтборыВспомогательные

// Функция возвращает список строковых значений реквизита номенклатуры или
//  доп.реквизитов номенклатуры. Используется при навигации по виду номенклатуры
//  и дереву свойств вида номенклатуры.
//
// Параметры:
//  ВидНоменклатуры		 - СправочникСсылка.ВидыНоменклатуры - вид номенклатуры,
//  ИмяРеквизита		 - Строка							 - имя реквизита,
//  ЭтоДопРеквизит		 - Булево		 					 - Истина - признак доп.реквизита,
//  ОтборПоНоменклатуре	 - Булево 							 - Истина - признак отбора по номенклатуре.
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка - Список строковых значений реквизита или доп.реквизита.
//
Функция СписокЗначенийРеквизита(ВидНоменклатуры, ИмяРеквизита, ЭтоДопРеквизит, ОтборПоНоменклатуре) Экспорт
	
	ЗначенияРеквизита = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	Если Не ЭтоДопРеквизит Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
		|	&ИмяРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
		|	И &ИмяРеквизита <> """"
		|	";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ИмяРеквизита",
			"Номенклатура." + ИмяРеквизита);
		
	ИначеЕсли ОтборПоНоменклатуре Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 50
		|	ДополнительныеРеквизиты.Значение КАК ЗначениеРеквизита
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|ГДЕ
		|	ДополнительныеРеквизиты.Свойство.Наименование = &Свойство
		|	И ДополнительныеРеквизиты.Ссылка.ВидНоменклатуры = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("Свойство", ИмяРеквизита);
		
	ИначеЕсли Не ОтборПоНоменклатуре Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХарактеристикиДополнительныеРеквизиты.Значение КАК ЗначениеРеквизита
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиДополнительныеРеквизиты
		|ГДЕ
		|	ХарактеристикиДополнительныеРеквизиты.Свойство.Наименование = &Свойство
		|	И ВЫБОР
		|			КОГДА ТИПЗНАЧЕНИЯ(ХарактеристикиДополнительныеРеквизиты.Ссылка.Владелец) = ТИП(Справочник.ВидыНоменклатуры)
		|				ТОГДА ХарактеристикиДополнительныеРеквизиты.Ссылка.Владелец = &ВидНоменклатуры
		|			ИНАЧЕ ХарактеристикиДополнительныеРеквизиты.Ссылка.Владелец.ВидНоменклатуры = &ВидНоменклатуры
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Свойство", ИмяРеквизита);
		
	КонецЕсли;

	МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗначениеРеквизита");
	ЗначенияРеквизита.ЗагрузитьЗначения(МассивЗначений);
	
	Возврат ЗначенияРеквизита;
	
КонецФункции

#КонецОбласти

#КонецОбласти
