// Сведения о версиях

Функция ТекущаяВерсияПодсистемыКонтурЛогистика() Экспорт
	
	Возврат "1.16.3";
	
КонецФункции

Функция ТекущаяВерсияДанныхПодсистемыКонтурЛогистика() Экспорт
	
	ТекВерсия = Справочники.Контурлогистика_Настройки.ЗначениеНастройки("ДанныеОбновленыДоВерсии");
	
	Возврат ?(Не ЗначениеЗаполнено(ТекВерсия), "0.0.0", ТекВерсия);
	
КонецФункции

Функция ТребуетсяВыполнитьПереходНаНовуюВерсию() Экспорт

	УстановленнаяВерсия = ТекущаяВерсияПодсистемыКонтурЛогистика();
	ВерсияДанных 		= ТекущаяВерсияДанныхПодсистемыКонтурЛогистика();
	
	Если ВерсияДанных = "0.0.0" Тогда // первый запуск подсистемы, обновление данных не требуется
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ДанныеОбновленыДоВерсии", УстановленнаяВерсия);
		Справочники.КонтурЛогистика_ГруппыДоступа.СоздатьГруппуДоступаСПолнымиПравами();
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.СоздатьПредопределенныеЭлементы();
		ВерсияДанных = УстановленнаяВерсия;
		ЗаполнитьПараметрыБлокировкиПриПервомЗапуске();
		СоздатьГруппыДоступаИПеренестиПользователей();
	КонецЕсли;
	
	РезультатСравнения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(УстановленнаяВерсия, ВерсияДанных) > 0;
	
	Если РезультатСравнения > 0 Тогда
		
		ЕстьОбновление = Истина;
		
	ИначеЕсли РезультатСравнения < 0 Тогда
		
		ЕстьОбновление = Ложь;
		Сообщить("Текущая запускаемая версия ниже, чем последняя использовавшаяся. Обратная совместимость не предусмотрена.
					|Вы можете продолжить работу, однако есть риск ошибок");
		
	Иначе // =0
		
		ЕстьОбновление = Ложь;
		
	КонецЕсли;
		
	Возврат ЕстьОбновление;

КонецФункции 

// Начальное заполнение и перенос из старой редакции

// TODO прикрутить к стартовому помощнику когда тот появится
Функция НачальноеЗаполнениеБазыДанных() Экспорт
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Успешно = Истина;
	
	Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию();
	СообщитьХодВыполнения(" - Основные настройки Контур.Логистика");
	
	Справочники.КонтурЛогистика_КлассификаторУпаковок.ЗаполнитьЗначениямиПоУмолчанию();
	СообщитьХодВыполнения(" - Заполнен классификатор упаковок");
	
	СообщитьХодВыполнения("Успешно завершил заполнение базовых справочников");
	Результат.Успешно = Истина;
	
	Возврат Результат;

КонецФункции 

Процедура ВыполнитьПереходНаНовуюВерсию_ФоновоеЗадание(ЗапускаемаяВерсия = Неопределено) Экспорт
	
	Попытка
		РезультатПерехода = ВыполнитьПереходНаНовуюВерсию(ЗапускаемаяВерсия);
	Исключение
		КонтурЛогистика_Метрика.ОбработатьОшибку("ВыполнитьПереходНаНовуюВерсию", ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Если РезультатПерехода.Успешно = Ложь Тогда
		
		Попытка
			ТекстОшибок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.МассивВСтроку(РезультатПерехода.МассивОшибок);
		Исключение
			ТекстОшибок = "Не удалось выполнить обновление";
		КонецПопытки;
		
		ВызватьИсключение "Не удалось выполнить обновление в фоне по причине: " + ТекстОшибок;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьХодВыполнения(Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "" + ТекущаяДатаСеанса() + " " + Текст;
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция ВыполнитьПереходНаНовуюВерсию(ДоКакойВерсииОбновить = Неопределено) Экспорт
	
	Если ДоКакойВерсииОбновить = Неопределено Тогда
		ДоКакойВерсииОбновить = ТекущаяВерсияПодсистемыКонтурЛогистика();
	КонецЕсли;
	
	СКакойВерсииОбновить = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеНастройки("ДанныеОбновленыДоВерсии");
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Успешно = Истина;
	
	Если СКакойВерсииОбновить = ДоКакойВерсииОбновить Тогда 
		Возврат Результат;
	КонецЕсли;
	
	// Всегда добавляем новые настройки и обновляем представления существующих
	СообщитьХодВыполнения("Инициализация новых общих настроек и обновление описания");
	Результат = ДобавитьНастройкиИОбновитьОписание();
	Если Не Результат.Успешно Тогда
		СообщитьРезультатыПерехода(ДоКакойВерсииОбновить, Результат);
		Возврат Результат;
	КонецЕсли;
	
	ОбработчикиОбновления = ПолучитьОбработчикиОбновления();
	
	Если ЗначениеЗаполнено(ОбработчикиОбновления) Тогда
		
		Для Каждого Обработчик Из ОбработчикиОбновления Цикл
			
			Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Обработчик.Версия, СКакойВерсииОбновить) <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Если версия обработчика больше текушей версии, то переходим на версию, до которой нужно обновить 
			Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Обработчик.Версия, ДоКакойВерсииОбновить) > 0 Тогда
				СообщитьРезультатыПерехода(ДоКакойВерсииОбновить, Результат);
				Прервать;
			КонецЕсли;
			
			Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Обработчик.Версия, СКакойВерсииОбновить) > 0 Тогда
				
				Результат = ВыполнитьСледующийШаг(Обработчик);
				СообщитьРезультатыПерехода(Обработчик.Версия, Результат);
				
				Если Не Результат.Успешно Тогда
					Прервать;
				КонецЕсли;
				
				СКакойВерсииОбновить = Обработчик.Версия;
				
			КонецЕсли;
			
			Если СКакойВерсииОбновить = ДоКакойВерсииОбновить Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ДоКакойВерсииОбновить, СКакойВерсииОбновить) >= 0 Тогда
			// На версию ДоКакойВерсииОбновить нет обработчика обновления - считаем что обновление выполнено
			Если Результат.Успешно Тогда
				СообщитьРезультатыПерехода(ДоКакойВерсииОбновить, Результат);
				Сообщить("Обновление данных на версию " + ДоКакойВерсииОбновить + " завершено");
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		СообщитьРезультатыПерехода(ДоКакойВерсииОбновить, Результат);
		
	КонецЕсли;
	
	Если Результат.Успешно = Ложь Тогда
		Попытка
			ТекстОшибок = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.МассивВСтроку(Результат.МассивОшибок);
		Исключение
			ТекстОшибок = "Не удалось выполнить обновление";
		КонецПопытки;
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ВыполнитьПереходНаНовуюВерсию", ТекстОшибок);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СообщитьРезультатыПерехода(Знач НоваяВерсия, Знач Результат)
	
	Сообщение = Новый СообщениеПользователю;
	
	Если Результат.Успешно Тогда
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ДанныеОбновленыДоВерсии", НоваяВерсия);
		Сообщение.Текст = "Выполнено обновление на релиз подсистемы " +  НоваяВерсия;
	Иначе
		Сообщение.Текст = "Не удалось выполнить обновление на релиз подсистемы " + НоваяВерсия + Символы.ПС
			+ "Ошибка: " + Результат.ОписаниеОшибки;
	КонецЕсли;
	
	Сообщение.Сообщить();
	
КонецПроцедуры

Функция ДобавитьНастройкиИОбновитьОписание()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ТолькоНеинициализированные = Истина;
		ОбновлятьОписание = Истина;
		
		Результат = Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(,
			ТолькоНеинициализированные,, ОбновлятьОписание);
		
		Если Не Результат.Успешно Тогда
				
			ОтменитьТранзакцию();
			Возврат Результат;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.Успешно = Ложь;
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Возврат Результат;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьСледующийШаг(Обработчик)
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	
	Выполнить(Обработчик.Процедура + "(Результат)");
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьОбработчикиОбновления()
	
	Обработчики = Новый ТаблицаЗначений;
	Обработчики.Колонки.Добавить("Версия", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(20));
	Обработчики.Колонки.Добавить("Процедура", КонтурЛогистика_ОбщегоНазначенияСервер.ОписаниеТипаСтрока(0));
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.6.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_6_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.9.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_9_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.11.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_11_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.12.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_12_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.13.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_13_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.16.0";
	Обработчик.Процедура = "ПереходНаВерсию_0_16_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1";
	Обработчик.Процедура = "ПереходНаВерсию_1_0_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.3";
	Обработчик.Процедура = "ПереходНаВерсию_1_0_3";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.4";
	Обработчик.Процедура = "ПереходНаВерсию_1_0_4";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.0";
	Обработчик.Процедура = "ПереходНаВерсию_1_1_0";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.1";
	Обработчик.Процедура = "ПереходНаВерсию_1_1_1";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.3";
	Обработчик.Процедура = "ПереходНаВерсию_1_1_3";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.1.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_1_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_2_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.3.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_3_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.4.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_4_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.4.2";
	Обработчик.Процедура = "ПереходНаВерсию_1_4_2";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.4.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_4_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.5.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_5_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.5.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_5_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.6.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_6_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.8.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_8_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.9.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_9_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.10.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_10_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.11.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_11_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.11.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_11_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.11.12";
	Обработчик.Процедура = "ПереходНаВерсию_1_11_12";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.12.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_12_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.12.11";
	Обработчик.Процедура = "ПереходНаВерсию_1_12_11";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.14.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_14_10";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.15.10";
	Обработчик.Процедура = "ПереходНаВерсию_1_15_10";
	
	Возврат Обработчики;
	
КонецФункции	

Процедура ПереходНаВерсию_0_6_0(Результат)

	СообщитьХодВыполнения("Начал обновление на 0.6.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// обновим состояния движения документооборота
		СообщитьХодВыполнения("Добавление правила конвертации ""Отправитель шаблона"" для настройки конвертации документов для Титула 1");
		ДобавитьОтправителяШаблоновВНастройкуКонвертации();
		
		СообщитьХодВыполнения("Обновление названий статусов в справочнике состояний");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию(Истина);
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.6.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_9_0(Результат)

	СообщитьХодВыполнения("Начал обновление на 0.9.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();	
	
	Попытка
		
		// инициализация новых настроек
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию(Ложь);
		
		СообщитьХодВыполнения("Инициализация нового формата настройки ТипПрокси");
		
		ЗначениеНастройкиТипПрокси = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимПрокси");
		Если ЗначениеНастройкиТипПрокси = "NoProxy" Тогда
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("РежимПрокси", Перечисления.КонтурЛогистика_ТипыПрокси.NoProxy);
		ИначеЕсли ЗначениеНастройкиТипПрокси = "UseProxy" Тогда 
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("РежимПрокси", Перечисления.КонтурЛогистика_ТипыПрокси.UseProxy);
		ИначеЕсли ЗначениеНастройкиТипПрокси = "UseDefaultProxy" Тогда 
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("РежимПрокси", Перечисления.КонтурЛогистика_ТипыПрокси.UseDefaultProxy);
		КонецЕсли;
		
		НастройкаСсылка = Справочники.КонтурЛогистика_Настройки.НайтиПоРеквизиту("ИмяПредопределенногоДляРасширения", "РежимПрокси");
		Если ЗначениеЗаполнено(НастройкаСсылка) Тогда 
			НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
			НастройкаОбъект.ТипЗначения = "ПеречислениеСсылка.КонтурЛогистика_ТипыПрокси";
			НастройкаОбъект.Описание = "Режим прокси, указывается из перечисления.";
			НастройкаОбъект.Записать();
		КонецЕсли;
		
		СообщитьХодВыполнения("Инициализация нового формата настройки ТипПрокси завершена");
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.9.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_11_0(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 0.11.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Перезапишем тип значения у настройки ПодключаемыйМодульПуть
		СообщитьХодВыполнения("Обновление настроек подключаемого модуля");
		
		ПМТип = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного("ПодключаемыйМодульТип");
		ПМТипОбъект = ПМТип.ПолучитьОбъект();
		ПМТипОбъект.Записать();
		
		//
		
		// Перезаполняем представление адреса в справочнике организации Диадок
		СообщитьХодВыполнения("Обновление представления адреса организации Диадок");
		
		Выборка = Справочники.КонтурЛогистика_ОрганизацииДиадок.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекущийОбъект = Выборка.ПолучитьОбъект();
			ТекущийОбъект.Записать();
		КонецЦикла;
		
		//
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.11.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_12_0(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 0.12.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Добавление водителя 2 в настройки");
		ПроставитьМаппингВодитель2();
		
		СообщитьХодВыполнения("Обработка настроек конвертации документов");
		УдалитьУстаревшиеСтрокиМаппингаТитулов();
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.12.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_13_0(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 0.13.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Перенос данных из настроек подписания в справочник сертификаты");
		
		// Заполним справочник КонтурЛогистика_СертификатыЭлектроннойПодписи по регистру сведений КонтурЛогистика_НастройкиПодписания
		ПереносДанныхИзНастроекПодписанияВСправочникСертификаты();
		
		ДобавлениеОсновныхНастроекДляМЧД();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.13.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_13_1(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 0.13.1");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Обновим описание настройки: АвтоматическоеПолучениеИОтправкаQRКодов
		Справочники.КонтурЛогистика_Настройки.ОбновитьНастройку("АвтоматическоеПолучениеИОтправкаQRКодов");
		
		//
		
		// Установить ключ API Телеграм бота
		Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("ПарольAPIТелеграм", КонтурЛогистика_РаботаСТелеграм.КлючAPI());
		
		//
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.14.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_0_16_0(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 0.16.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Инициализация новых настроек
		СообщитьХодВыполнения("Разделение по группам в справочнике Состояния движения документооборота");
		ОбновитьСостоянияДвиженияДО();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 0.16.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_0_1(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.0.1");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.0.1");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_0_3(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.0.3");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию();
		
		ПроставитьФлажокФильтроватьПоПВвНКД_1_0_3();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.0.3");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_0_4(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.0.4");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Обновляем наименование регламентных заданий");
		ОбновитьНаименованиеРеглментногоЗаданияЗапускРоботов();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.0.4");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_1_0(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.1.0");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Инициализация новых настроек
		СообщитьХодВыполнения("Заполнение направления конвертации в НКД");
		ЗаполнитьНаправленияКонвертацииНКД();
		
		//
		
		// Замена регламентного задания КонтурЛогистика_АвтоматическиеСозданиеИОтправкаДокументов на КонтурЛогистика_ЗапускРоботов
		СообщитьХодВыполнения("Замена регламентного задания ""Запуск роботов""");
		КонтурЛогистика_РежимРасширенияСервер.ОбработкаЗапускаРегламентныхЗаданий_ЗаменитьРЗ(
			"КонтурЛогистика_АвтоматическиеСозданиеИОтправкаДокументов", "КонтурЛогистика_ЗапускРоботов");
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.1.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_1_1(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.1.1");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Установка признака ""Проверять полномочия"" у МЧД");
		УстановитьПризнакПроверятьПолномочияМЧД();
		
		СообщитьХодВыполнения("Инициализация новых общих настроек");
		Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(, Истина);
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.1.1");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_1_3(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.1.3");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация новых общих настроек");
		Справочники.КонтурЛогистика_Настройки.ЗаполнитьВсеНастройкиЗначениямиПоУмолчанию(, Истина);
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.1.3");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_1_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.1.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Инициализация новых настроек
		СообщитьХодВыполнения("Замена статуса ДО ""Смена завершена"" с группы на элемент");
		ЗаменитьСтатусДОСменаЗавершена();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.1.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_2_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.2.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.2.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_3_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.3.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Заполнение признака автоприглашения в организациях ДД");
		ЗаполнитьНастройкиПолученияДокументовВДиадок();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.3.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_4_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.4.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Первичная настройка параметров блокировки работы с внешними ресурсами");
		ЗаполнитьПараметрыБлокировкиПриПервомЗапуске();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.4.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_4_2(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.4.2");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Перенесем РазрешитьТехосмотрДоМедОсмотра в каталог ПутевойЛист
		ПробоватьСоздаватьПриОтсутствии = Ложь;
		КаталогПутевойЛист = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"ПутевойЛист", ПробоватьСоздаватьПриОтсутствии);
		Если ЗначениеЗаполнено(КаталогПутевойЛист) Тогда
			РазрешитьТехосмотрДоМедОсмотра = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
				"РазрешитьТехосмотрДоМедОсмотра", ПробоватьСоздаватьПриОтсутствии);
			
			РазрешитьТехосмотрДоМедОсмотраОбъект = РазрешитьТехосмотрДоМедОсмотра.ПолучитьОбъект();
			РазрешитьТехосмотрДоМедОсмотраОбъект.Родитель = КаталогПутевойЛист;
			РазрешитьТехосмотрДоМедОсмотраОбъект.Записать();
		КонецЕсли;
		
		//
		
		// Удалим каталог ПутевоЛист
		КаталогПутевоЛист = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"ПутевоЛист", ПробоватьСоздаватьПриОтсутствии);
		Если ЗначениеЗаполнено(КаталогПутевоЛист) Тогда
			ПутевоЛистОбъект = КаталогПутевоЛист.ПолучитьОбъект();
			ПутевоЛистОбъект.Удалить();
		КонецЕсли;
		
		//
		
		СообщитьХодВыполнения("Синхронизировать все организации из АПИ Логистики");
		СинхронизироватьВсеОрганизацииИзАПИЛогистики();
		
		//
		
		СообщитьХодВыполнения("Перенос доп колонок в табличную часть");
		ПереносДопКолонокВТабличнуюЧастьНКД();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.4.2");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_4_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.4.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Создание группы доступа с полными правами");
		Справочники.КонтурЛогистика_ГруппыДоступа.СоздатьГруппуДоступаСПолнымиПравами();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.4.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_5_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.5.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		// Перенесем РазрешитьТехосмотрДоМедОсмотра в каталог ПутевойЛист
		СообщитьХодВыполнения("Перенос настроек УИД в каталог");
		ПробоватьСоздаватьПриОтсутствии = Ложь;
		КаталогНастройкиУИД = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"НастройкиУИД", ПробоватьСоздаватьПриОтсутствии);
		Если ЗначениеЗаполнено(КаталогНастройкиУИД) Тогда
			БратьУИДИзПулаДляТРН = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
				"БратьУИДИзПулаДляТРН", ПробоватьСоздаватьПриОтсутствии);
			
			БратьУИДИзПулаДляТРНОбъект = БратьУИДИзПулаДляТРН.ПолучитьОбъект();
			БратьУИДИзПулаДляТРНОбъект.Родитель = КаталогНастройкиУИД;
			БратьУИДИзПулаДляТРНОбъект.Записать();
			
			БратьУИДИзПулаДляЗН = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
				"БратьУИДИзПулаДляЗН", ПробоватьСоздаватьПриОтсутствии);
			
			БратьУИДИзПулаДляЗНОбъект = БратьУИДИзПулаДляЗН.ПолучитьОбъект();
			БратьУИДИзПулаДляЗНОбъект.Родитель = КаталогНастройкиУИД;
			БратьУИДИзПулаДляЗНОбъект.Записать();
		КонецЕсли;
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.5.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_5_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.5.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Установка значений брать УИД из пула");
		РежимАвторизации = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("РежимАвторизации");
		Если РежимАвторизации <> Перечисления.КонтурЛогистика_РежимыАвторизации.ЛогинИПароль Тогда
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("БратьУИДИзПулаДляТРН", Истина);
			Справочники.КонтурЛогистика_Настройки.УстановитьНастройку("БратьУИДИзПулаДляЗН", Истина);
		КонецЕсли;
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.5.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_6_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.6.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Создание групп доступа и перенос пользователй");
		СоздатьГруппыДоступаИПеренестиПользователей();
		
		СообщитьХодВыполнения("Заполнить тип сертификата");
		ЗаполнитьТипСертификатов();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.6.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_7_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.7.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Заполнение способа маппинга для откаха добавления строки в НКД");
		ЗаполнениеСпособаМаппингаДляОтказаДобавленияСтрокиВНКД();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.7.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_8_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.8.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Заменить требуемое действие Т5 для статусов завершен");
		ЗаменитьТребуемоеДействиеТ5СтатусаДОЗавершен();
		
		//
		
		СообщитьХодВыполнения("Установим признак ФильтрПоИнфоПолямЗагружатьБезКлючей для наших организаций");
		УстановитьПризнакФильтрПоИнфоПолямЗагружатьБезКлючей();
		
		//
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		СостояниеСсылка = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.Состояние1СПоКодуСостояниюСервиса(
			"pd-wait-carrier-readdress-sign");
		Если ЗначениеЗаполнено(СостояниеСсылка) Тогда
			СостояниеОбъект = СостояниеСсылка.ПолучитьОбъект();
			СостояниеОбъект.НаименованиеСостоянияАнгл = "PartialDeliveryWaitCarrierReaddressSign";
			СостояниеОбъект.Записать();
		КонецЕсли;
		
		//
		
		СообщитьХодВыполнения("Включить настройку чтения ленты Диадок и Логистики в организациях Диадок");
		ВключитьНастройкуЧтенияЛентыВОрганизацияхДиадок();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.8.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_9_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.9.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Создаем настроку ручного ввода ПЛ Т1");
		СоздатьНКДРучногоВводаПЛТ1();
		
		//
		
		СообщитьХодВыполнения("Создание новых регламентных заданий");
		КонтурЛогистика_РежимРасширенияСервер.ОбработкаЗапускаРегламентныхЗаданий_ДобавитьНовые();
		
		//
		
		СообщитьХодВыполнения("Обновить ТЧ ""РазрешенияРаботыСДокументами"" карточки сотрудников");
		ОбновитьТЧРазрешенияРаботыСДокументамиСотрудников();
		
		//
		
		СообщитьХодВыполнения("Заполнить сценарий в настройках конвертации документов");
		ЗаполнитьСценарийВНКД();
		
		//
		
		СообщитьХодВыполнения("Создание настроек конвертаций документов спец. сценариев");
		СоздатьНастройкиКонвертацииДокументовСпецСценариев();
		
		//
		
		СообщитьХодВыполнения("Правим опечатку в КонтурЛогистика_СпецСценрарииЗадач");
		КонтурЛогистика_ОбщегоНазначенияСервер.ЗаменитьПодстрокуВВыраженияхВычисления(
			"КонтурЛогистика_СпецСценрарииЗадач", "КонтурЛогистика_СпецСценарииЗадач");
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.9.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_10_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.10.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Перенос группы настроек: Соответствия товаров");
		ПеренестиГруппуНастроекСоответствияТоваров();
		//
		
		СообщитьХодВыполнения("Заполнить признак роуминговой в наших организациях");
		ЗаполнитьПризнакРоуминговойВНашихОрганизациях();
		
		//
		
		СообщитьХодВыполнения("Заполнение дополнительных колонок в НКД");
		ЗаполнитьДополнительныеКолонкиНКД();
		
		//
		
		СообщитьХодВыполнения("Заполнение реквизита ДействиеПриОтказеВалидации в НКД");
		ЗаполнитьРеквизитДействиеПриОтказеВалидацииНКД();
		
		//
		
		СообщитьХодВыполнения("Заполнение типа подписи в сертификате");
		ЗаполнитьТипПодписиВСертификате();
		
		СообщитьХодВыполнения("Заполнение directoryId в организациях");
		ЗаполнитьDirectoryIdВОрганизациях();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.10.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_11_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.11.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Добавление нового статуса титула ""Подписан""");
		
		УстановитьСтатусТитулаПодписанДляВсехПодписанныхФайловОбмена();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.7.0");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_11_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.11.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация новых статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.11.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_11_12(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.11.12");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Инициализация комментариев статусов документооборота КонтурЛогистика_СостоянияДвиженияДокументооборота");
		Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию(Истина);
		
		КодыУдаляемыхСтатусовДО = Новый Массив();
		КодыУдаляемыхСтатусовДО.Добавить("ret-carrier-signed");
		КодыУдаляемыхСтатусовДО.Добавить("ret-wait-driver-approve");
		КодыУдаляемыхСтатусовДО.Добавить("ret-wait-carrier-sign");
		Для Каждого КодСтатуса Из КодыУдаляемыхСтатусовДО Цикл
			УдаляемыйСтатус = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиПоКоду(КодСтатуса);
			Если ЗначениеЗаполнено(УдаляемыйСтатус) Тогда
				УдаляемыйСтатусОбъект = УдаляемыйСтатус.ПолучитьОбъект();
				УдаляемыйСтатусОбъект.Удалить();
			КонецЕсли;
		КонецЦикла;
		
		//
		
		СообщитьХодВыполнения("Заполнияем тип ПФ ПЛ в транспортных средствах");
		ЗаполнитьТипПечатнойФормыПутыхЛистовВТранспортныеСредства();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.11.12");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_12_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.12.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Создание новых настроек");
		Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного("КонтрольЕстьАктивныйПЛ", Истина);
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.12.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_12_11(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.12.11");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Создаем предопределенные элементы");
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.СоздатьПредопределенныеЭлементы();
		
		//
		
		СообщитьХодВыполнения("Обновим настройки организации из сервиса");
		ОбновитьНастройкиОрганизацииИзСервиса();
		
		//
		
		СообщитьХодВыполнения("Загрузим водителей из сервиса");
		ЗагрузитьВодителейИзСервиса();
		
		//
		
		СообщитьХодВыполнения("Добавить настройки конвертации регистра сведений");
		ДобавитьНастройкиКонвертацииРегистраСведений();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.12.11");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_14_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.14.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Заполнить часовой пояс в пунктах маршрута");
		ЗаполнитьЧасовойПоясВПунктахМаршрута();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	СообщитьХодВыполнения("Завершил обновление на 1.14.10");
	
КонецПроцедуры

Процедура ПереходНаВерсию_1_15_10(Результат)
	
	СообщитьХодВыполнения("Начал обновление на 1.15.10");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		СообщитьХодВыполнения("Выполняем переход на новый формат ЭПЛ 5.02");
		ВыполнитьПереходЭПЛНаФормат502();
		
		Результат.Успешно = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
		
	СообщитьХодВыполнения("Завершил обновление на 1.15.10");
	
КонецПроцедуры

// ОбработчикиОбновления

Процедура ЗаполнитьДополнительныеКолонкиНКД()
	
	ВыборкаНКД = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.Выбрать();
	Пока ВыборкаНКД.Следующий() Цикл
		
		Если ВыборкаНКД.ДополнительныеКолонки.Количество() > 0 Тогда
			
			НКДОб = ВыборкаНКД.ПолучитьОбъект();
			Для каждого ДопКолонка Из НКДОб.ДополнительныеКолонки Цикл
				
				Если НКДОб.Сценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПЛТитул1ПослеСменыВодителя Тогда
					Если Найти(ДопКолонка.ПутьКДанным, "ПодзапросТекущийТ1СоСменами.ДокументОснование.") = 0 Тогда
						ДопКолонка.ПутьКДанным = "ПодзапросТекущийТ1СоСменами.ДокументОснование." + ДопКолонка.ПутьКДанным;
					КонецЕсли;
				ИначеЕсли НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1
					Или НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул8
					Или НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1
					Или НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗЗ_Титул1
					Или НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1
					Или НКДОб.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭкспедиторскаяРасписка Тогда					
					ДопКолонка.ДобавленИзКонструктораЗапроса = Истина;
				Иначе
					Если Найти(ДопКолонка.ПутьКДанным, "ПодзапросТекущийТитул.ДокументОснование.") = 0 Тогда
						ДопКолонка.ПутьКДанным =  "ПодзапросТекущийТитул.ДокументОснование." + ДопКолонка.ПутьКДанным;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			НКДОб.ОбменДанными.Загрузка = Истина;
			НКДОб.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТипСертификатов()
	
	Выборка = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СертификатОб = Выборка.Ссылка.ПолучитьОбъект();
		СертификатОб.СертификатВыдан = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ТипВладельцаСертификата(Выборка.Ссылка);
		СертификатОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СинхронизироватьВсеОрганизацииИзАПИЛогистики()

	// если введен апикей, проставить признаки сервиса Лог в Оргах
	ТочноеСовпадение = Ложь;
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
	Если ПараметрыСервиса.АвторизацияВыполнена Тогда
		
		СообщитьХодВыполнения("Проставляю организациям признаки из Сервиса Логистики");
		
		// сформировать список орг ДД
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
		               |ГДЕ
		               |	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
		               |	И НЕ КонтурЛогистика_ОрганизацииДиадок.ЕстьВСервисеЛогистика
		               |	И КонтурЛогистика_ОрганизацииДиадок.ИНН <> """"";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Попытка
			
				ОрганизацияДиадокОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ОрганизацияДиадокОбъект.СинхронизироватьИзСервисаЛогистика();

			Исключение
				ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				СообщитьХодВыполнения(ТекстОшибки);
			КонецПопытки;
		
		КонецЦикла;
		
		СообщитьХодВыполнения("Завершил проставление признаков из сервиса Логистика");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПризнакПроверятьПолномочияМЧД()
	
	Выборка = Справочники.КонтурЛогистика_МЧД.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МЧДОб = Выборка.Ссылка.ПолучитьОбъект();
		МЧДОб.ПроверятьПолномочия = Истина;
		МЧДОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаправленияКонвертацииНКД()
	
	Выборка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НКДОб = Выборка.ПолучитьОбъект();
		
		НКДОб.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
		
		Если Не ЗначениеЗаполнено(НКДОб.Сценарий) Тогда 
			НКДОб.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НКДОб.СценарийПоУмолчанию) Тогда 
			Если НКДОб.Сценарий_ОтправлятьПодписанный Тогда 
				НКДОб.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
			Иначе
				НКДОб.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.НеПодписыватьОтправитьВСеансе;
			КонецЕсли;
		КонецЕсли;
				
		НКДОб.ОбменДанными.Загрузка = Истина;
		НКДОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроставитьФлажокФильтроватьПоПВвНКД_1_0_3()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НКДОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НКДОбъект.ПутьПеревозчикФильтроватьПоУстановленнымСоответствиям = Истина;
		НКДОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСостоянияДвиженияДО()
	
	Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию(Истина);
	
КонецПроцедуры

Процедура ПроставитьМаппингВодитель2()
	
	Перем Выборка, Запрос, НайденнаяНастройкаВодитель2, НастройкаОбъект, НоваяСтрокаВодитель2;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК НастройкаКонвертации
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	|ГДЕ
	|	(КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1)
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1))";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденнаяНастройкаВодитель2 = Выборка.НастройкаКонвертации.ПравилаКонвертацииТитулаРеквизиты.Найти("Водитель2" ,"РеквизитТитула");
		Если Не ЗначениеЗаполнено(НайденнаяНастройкаВодитель2) Тогда 
			НастройкаОбъект = Выборка.НастройкаКонвертации.Получитьобъект();
			НоваяСтрокаВодитель2 = НастройкаОбъект.ПравилаКонвертацииТитулаРеквизиты.добавить();
			НоваяСтрокаВодитель2.РеквизитТитула = "Водитель2";
			НоваяСтрокаВодитель2.РеквизитТитулаТипЗначения = "Сотрудники и физические лица (Контур.Логистика)";
			НоваяСтрокаВодитель2.РеквизитТитулаКомментарий = "Второй водитель, если едет в ТС";
			НоваяСтрокаВодитель2.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
			НоваяСтрокаВодитель2.Картинка = 3;
			НоваяСтрокаВодитель2.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВСотрудника;
			НастройкаОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПереносДанныхИзНастроекПодписанияВСправочникСертификаты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПодписания КАК КонтурЛогистика_НастройкиПодписания
		|ГДЕ
		|	КонтурЛогистика_НастройкиПодписания.УдалитьСрокДействия >= &УдалитьСрокДействия";
	
	Запрос.УстановитьПараметр("УдалитьСрокДействия", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОтпечатокСертификата = ВыборкаДетальныеЗаписи.УдалитьОтпечатокСертификата;
		
		Если Не ЗначениеЗаполнено(ОтпечатокСертификата) Тогда
			Продолжить;
		КонецЕсли;
		
		НайдСертификат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ПолучитьСертификатПоОтпечатку(ОтпечатокСертификата, ВыборкаДетальныеЗаписи.СертификатНаСервере);
		Если НайдСертификат.Пустая() Тогда
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УдалитьОГРНИП) Тогда
				ЭтоИП = Истина;
				ЭтоФЛ = Ложь;
			Иначе
				ЭтоИП = Ложь;
				ЭтоФЛ = Истина;
			КонецЕсли;
			
			Сертификат = Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.СоздатьЭлемент();
			
			Если Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПодписания.Ресурсы.Найти("Фамилия") <> Неопределено Тогда
				Сертификат.Фамилия = ВыборкаДетальныеЗаписи.Фамилия;
			Иначе
				Сертификат.Фамилия = ВыборкаДетальныеЗаписи.УдалитьФамилия;
			КонецЕсли;
			Если Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПодписания.Ресурсы.Найти("Имя") <> Неопределено Тогда
				Сертификат.Имя = ВыборкаДетальныеЗаписи.Имя;
			Иначе
				Сертификат.Имя = ВыборкаДетальныеЗаписи.УдалитьИмя;
			КонецЕсли;
			Если Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПодписания.Ресурсы.Найти("Отчество") <> Неопределено Тогда
				Сертификат.Отчество = ВыборкаДетальныеЗаписи.Отчество;
			Иначе
				Сертификат.Отчество = ВыборкаДетальныеЗаписи.УдалитьОтчество;
			КонецЕсли;
			Если Метаданные.РегистрыСведений.КонтурЛогистика_НастройкиПодписания.Ресурсы.Найти("Должность") <> Неопределено Тогда
				Сертификат.Должность = ВыборкаДетальныеЗаписи.Должность;
			Иначе
				Сертификат.Должность = ВыборкаДетальныеЗаписи.УдалитьДолжность;
			КонецЕсли;
			
			ДанныеСертификата = Новый Структура;
			ДанныеСертификата.Вставить("ЭтоЮЛ", Ложь);
			ДанныеСертификата.Вставить("ЭтоИП", ЭтоИП);
			ДанныеСертификата.Вставить("ЭтоФЛ", ЭтоФЛ);
			ДанныеСертификата.Вставить("Фамилия", Сертификат.Фамилия);
			ДанныеСертификата.Вставить("Имя", Сертификат.Имя);
			ДанныеСертификата.Вставить("Отчество", Сертификат.Отчество);
			ДанныеСертификата.Вставить("СрокДействия", ВыборкаДетальныеЗаписи.УдалитьСрокДействия);
			Сертификат.Наименование = СформироватьНаименованиеСертификата(ДанныеСертификата);
						
			Сертификат.ОтпечатокСертификата = ОтпечатокСертификата;									
			Сертификат.ДатаВыдачи = ВыборкаДетальныеЗаписи.УдалитьДатаВыдачи;
			Сертификат.СрокДействия = ВыборкаДетальныеЗаписи.УдалитьСрокДействия;
			Сертификат.Организация = ВыборкаДетальныеЗаписи.УдалитьОрганизация;
			Сертификат.Издатель = ВыборкаДетальныеЗаписи.УдалитьИздатель;
			Сертификат.ИНН = ВыборкаДетальныеЗаписи.УдалитьИНН;
			Сертификат.ОГРНИП = ВыборкаДетальныеЗаписи.УдалитьОГРНИП;
			Сертификат.ТипМодуляКриптографии = ВыборкаДетальныеЗаписи.УдалитьТипМодуляКриптографии;
			Сертификат.ИмяМодуляКриптографии = ВыборкаДетальныеЗаписи.УдалитьИмяМодуляКриптографии;
			Сертификат.ВводитьПарольВПрограммеЭлектроннойПодписи = ВыборкаДетальныеЗаписи.УдалитьВводитьПарольВПрограммеЭлектроннойПодписи;
			Сертификат.СертификатНаСервере = ВыборкаДетальныеЗаписи.СертификатНаСервере;
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УдалитьТипМодуляКриптографии) И Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УдалитьИмяМодуляКриптографии) Тогда
				ТипПрограммыЭППоУмолчанию = КонтурЛогистика_КриптографияСервер.ПолучитьТипыМодуляКриптографии()[0];
				ТипПрограммыЭП = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
				Сертификат.ТипМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ТипМодуляКриптографии;
				Сертификат.ИмяМодуляКриптографии = ТипПрограммыЭППоУмолчанию.ИмяМодуляКриптографии;
			Иначе
				Сертификат.ТипМодуляКриптографии = ВыборкаДетальныеЗаписи.УдалитьТипМодуляКриптографии;
				Сертификат.ИмяМодуляКриптографии = ВыборкаДетальныеЗаписи.УдалитьИмяМодуляКриптографии;	
			КонецЕсли;
										
			Сертификат.Записать();
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПЗК) Тогда
				КонтурЛогистика_ОбщегоНазначенияВызовСервера.ЗаписатьПароль(
					Сертификат.Ссылка, ВыборкаДетальныеЗаписи.ПЗК, "ПЗК");
			КонецЕсли;
			
			Запись = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.СоздатьМенеджерЗаписи();
			Запись.Период = ВыборкаДетальныеЗаписи.Период;
			Запись.ОрганизацияДиадок = ВыборкаДетальныеЗаписи.ОрганизацияДиадок;
			Запись.Пользователь1С = ВыборкаДетальныеЗаписи.Пользователь1С;
			Запись.СертификатНаСервере = ВыборкаДетальныеЗаписи.СертификатНаСервере;
			Запись.ДопПараметр = ВыборкаДетальныеЗаписи.ДопПараметр;
	        Запись.Прочитать();
	        
	        Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.Сертификат = Сертификат.Ссылка;
				Запись.Записать();
			КонецЕсли;
			
		Иначе
			
			Запись = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.СоздатьМенеджерЗаписи();
			Запись.Период = ВыборкаДетальныеЗаписи.Период;
			Запись.ОрганизацияДиадок = ВыборкаДетальныеЗаписи.ОрганизацияДиадок;
			Запись.Пользователь1С = ВыборкаДетальныеЗаписи.Пользователь1С;
			Запись.СертификатНаСервере = ВыборкаДетальныеЗаписи.СертификатНаСервере;
			Запись.ДопПараметр = ВыборкаДетальныеЗаписи.ДопПараметр;
	        Запись.Прочитать();
	        
	        Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.Сертификат = НайдСертификат;
				Запись.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

Функция СформироватьНаименованиеСертификата(ДанныеСертификата)

	ФИО = ДанныеСертификата.Фамилия + " " + ДанныеСертификата.Имя + " " + ДанныеСертификата.Отчество;
										
	Если ДанныеСертификата.ЭтоЮЛ Тогда					
		ОформленНа = "";					
	ИначеЕсли ДанныеСертификата.ЭтоИП Тогда					
		ОформленНа = "ИП";					
	ИначеЕсли ДанныеСертификата.ЭтоФЛ Тогда					
		ОформленНа = "Физическое лицо";
	Иначе
	    ОформленНа = "";
	КонецЕсли;
	
	Возврат ФИО + ", " 
			+ Формат(ДанныеСертификата.СрокДействия, "ДФ='""по ""dd.MM.yyyy'")  
			+ ?(ЗначениеЗаполнено(ОформленНа), ", " + ОформленНа, "");
				
КонецФункции

Процедура ДобавлениеОсновныхНастроекДляМЧД()
	
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ДоставкаМЧДФайлом");
	КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("СпособПередачиМЧД");
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПолученияДокументовВДиадок()
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Для каждого Орг Из НашиОрганизации Цикл
		Справочники.КонтурЛогистика_ОрганизацииДиадок.СинхронизироватьНастройкиОрганизации(Орг);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКолвоСопоставленийВОргДиадок()
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Для каждого Орг Из НашиОрганизации Цикл
		ОргОб = Орг.ПолучитьОбъект();
		ОргОб.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьСтатусДОСменаЗавершена()
	
	// Проверим что статус СменаЗавершена есть группа
	СостояниеДОТекущее = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-changeover");
	Если Не ЗначениеЗаполнено(СостояниеДОТекущее) Тогда
		Возврат;
	ИначеЕсли Не СостояниеДОТекущее.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим старый статус
	СостояниеДОТекущееОбъект = СостояниеДОТекущее.ПолучитьОбъект();
	СостояниеДОТекущееОбъект.Удалить();
	
	// Создадим новый
	ОбновитьОписанияИНаименования = Ложь;
	Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ЗаполнитьЗначениямиПоУмолчанию(ОбновитьОписанияИНаименования);
	
КонецПроцедуры

Процедура ОбновитьНаименованиеРеглментногоЗаданияЗапускРоботов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Ключ", "КонтурЛогистика_АвтоматическиеСозданиеИОтправкаДокументов");
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	Если РегЗадания = Неопределено Или РегЗадания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденноеРегламентноеЗадание = РегЗадания[0];
	
	НайденноеРегламентноеЗадание.Наименование = "Запуск роботов (Контур.Логистика)";
	НайденноеРегламентноеЗадание.Ключ = "КонтурЛогистика_ЗапускРоботов";
	НайденноеРегламентноеЗадание.Записать();
	
КонецПроцедуры

Процедура УдалитьУстаревшиеСтрокиМаппингаТитулов()
	
	// в 0.12.0 в модулях менеджера титулов появились манифесты реквизитов, которые не нужно настраивать в конвертации документов
	// но в старых релизах они уже добавились - выпилим их из настроек конвертации
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	               |ГДЕ
	               |	НЕ КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТРН(Выборка.Ссылка.ТипДокументаЛогистика) 
			Или Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоПЛ(Выборка.Ссылка.ТипДокументаЛогистика) Тогда 
			
			НКДОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ИмяДокументаСокр = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПолучитьИмяСсылки(НКДОбъект.ТипДокументаЛогистика);
			УдаляемыеИмена = Документы["КонтурЛогистика_" + ИмяДокументаСокр].КлючевыеРеквизитыСАвтоматическимЗаполнением();
			
			ТЧНастроек = НКДОбъект.ПравилаКонвертацииТитулаРеквизиты;
			ВсегоСтрок = ТЧНастроек.Количество();
			
			Для й = 1 По ВсегоСтрок Цикл 
				
				ТекНастройка = ТЧНастроек[ВсегоСтрок - й];
				
				Если УдаляемыеИмена.Найти(ТекНастройка.РеквизитТитула) <> Неопределено Тогда 
					ТЧНастроек.Удалить(ТекНастройка);
				КонецЕсли;
				
			КонецЦикла;
			
			// Для ТРН Т1 надо очистить еще в главном документе
			Если Выборка.Ссылка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1 Тогда
				
				УдаляемыеИмена = Документы.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная.КлючевыеРеквизитыСАвтоматическимЗаполнением();
				ТЧНастроек = НКДОбъект.ПравилаКонвертацииГлавногоДокумента;
				ВсегоСтрок = ТЧНастроек.Количество();
				
				Для й = 1 По ВсегоСтрок Цикл 
					
					ТекНастройка = ТЧНастроек[ВсегоСтрок - й];
					
					Если УдаляемыеИмена.Найти(ТекНастройка.РеквизитТитула) <> Неопределено Тогда 
						ТЧНастроек.Удалить(ТекНастройка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			НКДОбъект.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтатусыСостоянийДокументооборота()
	
	ЭталоннаяТаблица = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.ПолучитьТаблицуПредопределенных();	
	
	Для Каждого СтрокаТаблицы Из ЭталоннаяТаблица Цикл 
		
		Попытка
			СостояниеДО = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(СтрокаТаблицы.Код);
		Исключение
			СостояниеДО = Неопределено;
		КонецПопытки;
		
		Если СостояниеДО <> Неопределено Тогда
			
			СостояниеДООбъект = СостояниеДО.ПолучитьОбъект();
			
			Если СостояниеДООбъект.ЭтоГруппа Тогда
				Продолжить;
			КонецЕсли;
			
			СостояниеДООбъект.ТребуемоеДействиеТ5 = СтрокаТаблицы.ТребуемоеДействиеТ5;
			СостояниеДООбъект.ТребуемоеДействиеТ6 = СтрокаТаблицы.ТребуемоеДействиеТ6;
			
			Попытка
				СостояниеДООбъект.Записать();
			Исключение
				// Ничего
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ДобавитьОтправителяШаблоновВНастройкуКонвертации()
	
	НастройкиКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.МассивНастроекКонвертацииПоТипуЛогистики(
								Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
		
	Для Каждого Настройка Из НастройкиКонвертации Цикл 
		
		Правило = Настройка.ПравилаКонвертацииТитулаРеквизиты.Найти("ОтправительШаблона" , "РеквизитТитула");
		
		Если Правило = Неопределено Тогда 
			
			НастройкаОбъект = Настройка.ПолучитьОбъект();
			
			НовоеПравило = НастройкаОбъект.ПравилаКонвертацииТитулаРеквизиты.Добавить();
			
			НовоеПравило.РеквизитТитула = "ОтправительШаблона";
			НовоеПравило.РеквизитТитулаТипЗначения = "Организации Диадок (Контур.Логистика)";
			НовоеПравило.РеквизитТитулаКомментарий = "Указывается организация, которая готовит Титул 1 в качестве шаблона и передает его Грузоотправителю. Грузоотправитель создает из шаблона Титул 1, подписывает и отправляет Перевозчику.";
			НовоеПравило.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
			НовоеПравило.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.КонвертироватьВОрганизациюДиадок;
			
			НастройкаОбъект.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;	
		
КонецПроцедуры	

Процедура ЗаполнитьПараметрыБлокировкиПриПервомЗапуске()
	
	// Сохраним блокировку, если она есть
	РаботаСВнешнимиРесурсамиЗаблокирована = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"ПараметрыБлокировки_РаботаСВнешнимиРесурсамиЗаблокирована");
	
	Результат = КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.ТекущиеПараметрыБлокировки();
	
	КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.СохранитьПараметрыБлокировки(Результат);
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.КонтурЛогистика_КакаяБаза() = "Файловая" Тогда
		КонтурЛогистика_БлокировкаРаботыСВнешнимиРесурсами.ЗаписатьИдентификаторФайловойБазыВФайлПроверки(Результат.ИдентификаторБазы);
	КонецЕсли;
	
	// Вернем прежнее значение
	Справочники.КонтурЛогистика_Настройки.УстановитьНастройку(
		"ПараметрыБлокировки_РаботаСВнешнимиРесурсамиЗаблокирована", РаботаСВнешнимиРесурсамиЗаблокирована);
	
КонецПроцедуры

Процедура ПереносДопКолонокВТабличнуюЧастьНКД()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПутьДоп1 КАК ПутьДоп1,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПутьДоп2 КАК ПутьДоп2
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ПутьДоп1 <> """"
	|	ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументов.ПутьДоп2 <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НКДОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НКДОбъект.ДополнительныеКолонки.Очистить();
		
		Если ЗначениеЗаполнено(Выборка.ПутьДоп1) Тогда
			НоваяСтрока = НКДОбъект.ДополнительныеКолонки.Добавить();
			НоваяСтрока.Заголовок = "Доп1";
			НоваяСтрока.ПутьКДанным = Выборка.ПутьДоп1;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПутьДоп2) Тогда
			НоваяСтрока = НКДОбъект.ДополнительныеКолонки.Добавить();
			НоваяСтрока.Заголовок = "Доп2";
			НоваяСтрока.ПутьКДанным = Выборка.ПутьДоп2;
		КонецЕсли;
		
		НКДОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатусТитулаПодписанДляВсехПодписанныхФайловОбмена()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(&Дата) КАК КонтурЛогистика_СтатусыТитуловСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
		|		ПО КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ = КонтурЛогистика_ФайлыОбмена.СвязанныйДокумент
		|ГДЕ
		|	НЕ КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ.ПометкаУдаления
		|	И КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена)
		|	И КонтурЛогистика_ФайлыОбмена.ПодписьВерна = ИСТИНА";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(ВыборкаДетальныеЗаписи.Документ, 
																			Перечисления.КонтурЛогистика_СтатусыТитулов.Подписан);
																			
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьГруппыДоступаИПеренестиПользователей()
	
	// Не можем перенести бля БСП ниже 2.3.1.88
	Если Не КонтурЛогистика_ОбщегоНазначенияСервер.ВерсияСтандартнойПодсистемыВыше("2.3.1.88") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСправочникаГруппыДоступа = "Справочники.ГруппыДоступа";
	Если Не КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЕстьНеобходимыеМетаданные(ИмяСправочникаГруппыДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим группы и профили доступа
	ГруппаДоступаСсылка = КонтурЛогистика_ОбщегоНазначенияСервер.СоздатьГруппыДоступа();
	
	Если Не ЗначениеЗаполнено(ГруппаДоступаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Перенесем пользователей в новые группы
	ПользователиСРолью = ПользователиСРолью("Роль.КонтурЛогистика_УдалитьАдминистратор");
	ДобавитьПользователейВГруппуДоступа("Администраторы (Контур.Логистика)", ПользователиСРолью);
	
	ПользователиСРолью = ПользователиСРолью("Роль.КонтурЛогистика_УдалитьПродвинутыйПользователь");
	ДобавитьПользователейВГруппуДоступа("Продвинутые пользователи (Контур.Логистика)", ПользователиСРолью);
	
	ПользователиСРолью = ПользователиСРолью("Роль.КонтурЛогистика_УдалитьПользователь");
	ДобавитьПользователейВГруппуДоступа("Пользователи (Контур.Логистика)", ПользователиСРолью);
	
КонецПроцедуры

Функция ПользователиСРолью(ИмяРоли)
	
	ИдентификаторОбъектаРоли = ИдентификаторОбъектаРоли(ИмяРоли);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторОбъектаРоли", ИдентификаторОбъектаРоли);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
	|			ПО ГруппыДоступа.Профиль = ПрофилиГруппДоступаРоли.Ссылка
	|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
	|ГДЕ
	|	ПрофилиГруппДоступаРоли.Роль = &ИдентификаторОбъектаРоли
	|
	|СГРУППИРОВАТЬ ПО
	|	ГруппыДоступаПользователи.Пользователь";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

Функция ИдентификаторОбъектаРоли(ПолноеИмя)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовРасширений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовРасширений КАК ИдентификаторыОбъектовРасширений
	|ГДЕ
	|	НЕ ИдентификаторыОбъектовРасширений.ПометкаУдаления
	|	И ИдентификаторыОбъектовРасширений.ПолноеИмя = &ПолноеИмя";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьПользователейВГруппуДоступа(ИмяГруппы, ПользователиСРолью)
	
	ГруппаДоступа = Справочники["ГруппыДоступа"].НайтиПоНаименованию(ИмяГруппы, Истина);
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	
	Для Каждого ПользовательСРолью Из ПользователиСРолью Цикл
		ПользовательУжеЕсть = Ложь;
		Для Каждого ТекущийПользователь Из ГруппаДоступаОбъект.Пользователи Цикл
			Если ТекущийПользователь.Пользователь = ПользовательСРолью Тогда
				ПользовательУжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ПользовательУжеЕсть Тогда
			НоваяСтрока = ГруппаДоступаОбъект.Пользователи.Добавить();
			НоваяСтрока.Пользователь = ПользовательСРолью;
		КонецЕсли;
	КонецЦикла;
	
	ГруппаДоступаОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьТипПодписиВСертификате()
	
	Запрос = Новый Запрос;
	Запрос.Текст =			
		"ВЫБРАТЬ
		|	КонтурЛогистика_СертификатыЭлектроннойПодписи.Ссылка КАК Сертификат
		|ИЗ
		|	Справочник.КонтурЛогистика_СертификатыЭлектроннойПодписи КАК КонтурЛогистика_СертификатыЭлектроннойПодписи
		|ГДЕ
		|	НЕ КонтурЛогистика_СертификатыЭлектроннойПодписи.ПометкаУдаления
		|	И КонтурЛогистика_СертификатыЭлектроннойПодписи.СрокДействия > &ТекущаяДата";	
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Сертификаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");
	
	Для каждого Сертификат Из Сертификаты Цикл
		
		СертификатОбъект = Сертификат.ПолучитьОбъект();
		
		Если Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ЭтоТестовыйСертификат(Сертификат.Издатель) Тогда
			СертификатОбъект.ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.Тестовая;
		Иначе
			СертификатОбъект.ТипПодписи = Перечисления.КонтурЛогистика_ТипыПодписи.УКЭП;
		КонецЕсли;
		
		СертификатОбъект.Записать();
						
	КонецЦикла;
	
	ПараметрыФоновогоЗадания = Новый Структура("Сертификаты", Сертификаты);
	КонтурЛогистика_ДлительныеОперацииСервер.ВыполнитьВФоне("КонтурЛогистика_ДлительныеОперацииСервер.ОбновитьТипПодписиЧерезДиадок",
					ПараметрыФоновогоЗадания,
					"КлючФЗ_ОбновитьТипПодписиЧерезДиадок",
					"Обноление типа подписи через Диадок");
		
КонецПроцедуры

Процедура ЗаполнитьРеквизитДействиеПриОтказеВалидацииНКД()
	
	ЗначениеПоУмолчанию = Перечисления.КонтурЛогистика_ДействияПриОтказеВалидации.ЗапретПодписания;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПроизвольныеВалидации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПроизвольныеВалидации КАК КонтурЛогистика_НастройкиКонвертацииДокументовПроизвольныеВалидации
	|ГДЕ
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПроизвольныеВалидации.ДействиеПриОтказеВалидации = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ДействияПриОтказеВалидации.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_НастройкиКонвертацииДокументовПроизвольныеВалидации.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НКДОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого ТекущаяСтрока Из НКДОбъект.ПроизвольныеВалидации Цикл
			Если ЗначениеЗаполнено(ТекущаяСтрока.ДействиеПриОтказеВалидации) Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущаяСтрока.ДействиеПриОтказеВалидации = ЗначениеПоУмолчанию;
		КонецЦикла;
		
		НКДОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеСпособаМаппингаДляОтказаДобавленияСтрокиВНКД()
	
	Выборка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НКД = Выборка.Ссылка;
		
		Если НКД.ПравилаКонвертацииТитулаТабЧастьПроизвольная.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НКДОб = НКД.ПолучитьОбъект();
		Для каждого ПравилоКонвертации Из НКДОб.ПравилаКонвертацииТитулаТабЧастьПроизвольная Цикл
			ПравилоКонвертации.СпособМаппингаДобавлятьСтроку = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;	
		КонецЦикла;
		НКДОб.ОбменДанными.Загрузка = Истина;
		НКДОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьТЧРазрешенияРаботыСДокументамиСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_Сотрудники.Ссылка КАК Ссылка,
	|	МАКСИМУМ(КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_Сотрудники.РазрешенияРаботыСДокументами КАК КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами
	|		ПО КонтурЛогистика_СотрудникиРазрешенияРаботыСДокументами.Ссылка = КонтурЛогистика_Сотрудники.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_Сотрудники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.НомерСтроки ЕСТЬ NULL";
	
	Результат = Запрос.ВыполнитьПакет();
	
	НашиОрганизации = Результат[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВыборкаСотрудники = Результат[2].Выбрать();
	
	Пока ВыборкаСотрудники.Следующий() Цикл
		
		СотрудникОбъект = ВыборкаСотрудники.Ссылка.ПолучитьОбъект();
		СотрудникОбъект.ОбменДанными.Загрузка = Истина;
		
		// Добавим разрешения в разрезе организаций
		Для Каждого ТекущаяОрганизация Из НашиОрганизации Цикл
			НоваяСтрока = СотрудникОбъект.РазрешенияРаботыСДокументами.Добавить();
			НоваяСтрока.Организация = ТекущаяОрганизация;
			НоваяСтрока.МожетПодписывать = Истина;
			НоваяСтрока.МожетПередаватьНаПодпись = Ложь;
		КонецЦикла;
		
		СотрудникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСценарийВНКД()
	
	Попытка
		Т1СценарийПодписания = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("Т1СценарийПодписания");
	Исключение
		// Значит ее уже удалили
		Возврат;
	КонецПопытки;
	
	Если Т1СценарийПодписания = Перечисления.КонтурЛогистика_СценарииПодписанияТитулов.НеподписанныйВодительПодпись Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТипДокументаЛогистика", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул1);
		Запрос.УстановитьПараметр("Сценарий", Перечисления.КонтурЛогистика_Сценарии.Отправка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка КАК Ссылка,
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика КАК ТипДокументаЛогистика
		|ИЗ
		|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
		|ГДЕ
		|	КонтурЛогистика_НастройкиКонвертацииДокументов.Сценарий = &Сценарий
		|	И КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика = &ТипДокументаЛогистика";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НКДОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НКДОбъект.ОбменДанными.Загрузка = Истина;
			НКДОбъект.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного;
			НКДОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
	// Удалим настройку Т1СценарийПодписания
	Попытка
		ПробоватьСоздаватьПриОтсутствии = Ложь;
		НастройкаТ1СценарийПодписания = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"Т1СценарийПодписания", ПробоватьСоздаватьПриОтсутствии);
		Если ЗначениеЗаполнено(НастройкаТ1СценарийПодписания) Тогда
			НастройкаТ1СценарийПодписанияОбъект = НастройкаТ1СценарийПодписания.ПолучитьОбъект();
			НастройкаТ1СценарийПодписанияОбъект.Удалить();
		КонецЕсли;
	Исключение
		// Значит ее уже удалили
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьНастройкиКонвертацииДокументовСпецСценариев()
	
	ТипДокументаЛогистика = Новый Массив;
	ТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1);
	ТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3);
	ТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4);
	ТипДокументаЛогистика.Добавить(Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокументаЛогистика", ТипДокументаЛогистика);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(КонтурЛогистика_НастройкиКонвертацииДокументов.Ссылка) КАК Ссылка,
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика КАК ТипДокументаЛогистика
	|ИЗ
	|	Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов КАК КонтурЛогистика_НастройкиКонвертацииДокументов
	|ГДЕ
	|	НЕ КонтурЛогистика_НастройкиКонвертацииДокументов.ПометкаУдаления
	|	И (КонтурЛогистика_НастройкиКонвертацииДокументов.НаправлениеКонвертации = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НаправлениеКонвертации.Исходящее)
	|			ИЛИ КонтурЛогистика_НастройкиКонвертацииДокументов.НаправлениеКонвертации = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_НаправлениеКонвертации.ИсходящееВходящее))
	|	И КонтурЛогистика_НастройкиКонвертацииДокументов.Родитель = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_НастройкиКонвертацииДокументов.ПустаяСсылка)
	|	И КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика В(&ТипДокументаЛогистика)
	|	И КонтурЛогистика_НастройкиКонвертацииДокументов.СпецСценарий = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СпецСценарииЗадач.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_НастройкиКонвертацииДокументов.ТипДокументаЛогистика";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ПЛТитул1ПослеСменыВодителя;
		ИначеЕсли Выборка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул3 Тогда
			СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул3ПослеТитула7;
		ИначеЕсли Выборка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4 Тогда
			СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул4ПоВозврату;
		ИначеЕсли Выборка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7 Тогда
			СпецСценарий = Перечисления.КонтурЛогистика_СпецСценарииЗадач.ТрнТитул7ПослеТитула4;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
			Выборка.ТипДокументаЛогистика,, СпецСценарий);
		
		Если НастройкаКонвертации <> Неопределено Тогда
			// Уже есть настройка под спец. сценарий
			Продолжить;
		КонецЕсли;
		
		// Создадим настройки со спец. сценариями
		НКДИсточникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НовыйНКД = НКДИсточникОбъект.Скопировать();
		НовыйНКД.СпецСценарий = СпецСценарий;
		НовыйНКД.Наименование = "" + НовыйНКД.ТипДокументаЛогистика + " по предыдущему титулу" + ", " + НРег(СпецСценарий);
		
		Если Выборка.ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1 Тогда
			// Особенности для ПЛ Т1, так как при смене водителя основание другое
			НовыйНКД.ТипДокумента1С = Неопределено;
			
			Для Каждого ТекущаяСтрока Из НовыйНКД.ПравилаКонвертацииТитулаРеквизиты Цикл
				ТекущаяСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.НеЗаполнять;
			КонецЦикла;
		КонецЕсли;
		
		НовыйНКД.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаменитьТребуемоеДействиеТ5СтатусаДОЗавершен()
	
	СтатусыКОбработке = Новый Массив;
	СтатусыКОбработке.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(
		"completed"));
	СтатусыКОбработке.Добавить(Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду(
		"pd-wait-carrier-readdress-sign"));
	
	Для Каждого ТекущийСтатус Из СтатусыКОбработке Цикл
		
		Если Не ЗначениеЗаполнено(ТекущийСтатус) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийСтатусОбъект = ТекущийСтатус.ПолучитьОбъект();
		ТекущийСтатусОбъект.ТребуемоеДействиеТ5 = Перечисления.КонтурЛогистика_ТребуемыеДействия.РаботаЗавершена;
		ТекущийСтатусОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПризнакФильтрПоИнфоПолямЗагружатьБезКлючей()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И НЕ КонтурЛогистика_ОрганизацииДиадок.ФильтрПоИнфоПолямЗагружатьБезКлючей";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОрганизацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОрганизацияОбъект.ФильтрПоИнфоПолямЗагружатьБезКлючей = Истина;
		Попытка
			ОрганизацияОбъект.Записать();
		Исключение
			НичегоНеДелаем = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВключитьНастройкуЧтенияЛентыВОрганизацияхДиадок()
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Для каждого Организация Из НашиОрганизации Цикл
		
		Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
			Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуДиадок, Истина);
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			Справочники.КонтурЛогистика_ОрганизацииДиадок.УстановитьНастройку(
				Организация, Перечисления.КонтурЛогистика_НастройкиОрганизацийДиадок.ЧитатьЛентуЛогистики, Истина);
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПризнакРоуминговойВНашихОрганизациях()

	Выборка = Справочники.КонтурЛогистика_ОрганизацииДиадок.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ИдентификаторУчастникаЭДО) Тогда
			Продолжить;
		КонецЕсли;
		
		ОргОб = Выборка.ПолучитьОбъект();
		Провайдер = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ОпределитьПровайдераПоИдентификатору(ОргОб.ИдентификаторУчастникаЭДО);
	    ОргОб.Роуминговая = Провайдер <> "Контур";
		ОргОб.ОбменДанными.Загрузка = Истина;
		ОргОб.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНКДРучногоВводаПЛТ1()
	
	ИспользуютсяПутевыеЛисты = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользуетсяПутевойЛист");
	Если Не ИспользуютсяПутевыеЛисты Тогда
		Возврат;
	КонецЕсли;
	
	ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1;
	Если ЗначениеЗаполнено(КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьНастройкуКонвертацииТ1РучногоВвода(ТипЛогистика)) Тогда
		Возврат;
	КонецЕсли;
	
	НКДОбъект = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.СоздатьЭлемент();
	НКДОбъект.Наименование = "ПЛ1 - Путевой лист (начало) ввод вручную";
	НКДОбъект.ТипДокументаЛогистика = ТипЛогистика;
	НКДОбъект.Сценарий_ОтправлятьПодписанный = Истина;
	НКДОбъект.Сценарий_ОтправлятьВФоне = Истина;
	НКДОбъект.Сценарий_ОтправлятьВСеансе = Истина;
	НКДОбъект.СценарийПоУмолчанию = Перечисления.КонтурЛогистика_СценарииОтправкиТитулов.ПодписыватьОтправитьВСеансе;
	НКДОбъект.НаправлениеКонвертации = Перечисления.КонтурЛогистика_НаправлениеКонвертации.Исходящее;
	НКДОбъект.Сценарий = Перечисления.КонтурЛогистика_Сценарии.Отправка;
	
	Попытка
		НКДОбъект.Записать();
	Исключение
		НичегоНеДелаем = Истина;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиГруппуНастроекСоответствияТоваров()
	
	ПробоватьСоздаватьПриОтсутствии = Истина;
	КаталогНастройкиСоответствияНоменклатуры = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
		"НастройкиСоответствияНоменклатуры", ПробоватьСоздаватьПриОтсутствии);
	КаталогНастройкиКонвертации = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
		"НастройкиКонвертации", ПробоватьСоздаватьПриОтсутствии);
	Если ЗначениеЗаполнено(КаталогНастройкиСоответствияНоменклатуры)
		И ЗначениеЗаполнено(КаталогНастройкиКонвертации) Тогда
		
		КаталогНастройкиСоответствияНоменклатурыОбъект = КаталогНастройкиСоответствияНоменклатуры.ПолучитьОбъект();
		КаталогНастройкиСоответствияНоменклатурыОбъект.Родитель = КаталогНастройкиКонвертации;
		КаталогНастройкиСоответствияНоменклатурыОбъект.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КаталогНастройкиСоответствияНоменклатуры) Тогда
		ИспользоватьИПрименятьБазовыеСоответствия = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"ИспользоватьИПрименятьБазовыеСоответствия", ПробоватьСоздаватьПриОтсутствии);
		
		ИспользоватьИПрименятьБазовыеСоответствияОбъект = ИспользоватьИПрименятьБазовыеСоответствия.ПолучитьОбъект();
		ИспользоватьИПрименятьБазовыеСоответствияОбъект.Родитель = КаталогНастройкиСоответствияНоменклатуры;
		ИспользоватьИПрименятьБазовыеСоответствияОбъект.Записать();
		
		ТребоватьНаличиеБазовыхСоответствий = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(
			"ТребоватьНаличиеБазовыхСоответствий", ПробоватьСоздаватьПриОтсутствии);
		
		ТребоватьНаличиеБазовыхСоответствийОбъект = ТребоватьНаличиеБазовыхСоответствий.ПолучитьОбъект();
		ТребоватьНаличиеБазовыхСоответствийОбъект.Родитель = КаталогНастройкиСоответствияНоменклатуры;
		ТребоватьНаличиеБазовыхСоответствийОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьDirectoryIdВОрганизациях()
	
	НашиОрганизации = Справочники.КонтурЛогистика_ОрганизацииДиадок.ВсеНашиОрганизации();
	
	Для Каждого Организация Из НашиОрганизации Цикл 
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ДанныеОрганизации = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаСервер.ПолучитьСведенияОСобственнойОрганизации(Организация);
			
			Если ДанныеОрганизации = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ТекущаяСтрока Из ДанныеОрганизации Цикл
				Если ТекущаяСтрока.Получить("diadocBoxId") <> Организация.ID Тогда
					Продолжить;
				КонецЕсли;
				
				ОрганизацияОб = Организация.ПолучитьОбъект();
				ОрганизацияОб.DirectoryId = ТекущаяСтрока.Получить("personsDirectoryId");
				ОрганизацияОб.ОбменДанными.Загрузка = Истина;
				ОрганизацияОб.Записать();
			КонецЦикла;
			
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьНастройкиОрганизацииИзСервиса()
	
	// Не важно под какой организацией получаем данные
	ТочноеСовпадение = Ложь;
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(,, ТочноеСовпадение);
	Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ОрганизацииДиадок.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ОрганизацииДиадок.ИНН КАК ИНН
	|ИЗ
	|	Справочник.КонтурЛогистика_ОрганизацииДиадок КАК КонтурЛогистика_ОрганизацииДиадок
	|ГДЕ
	|	НЕ КонтурЛогистика_ОрганизацииДиадок.ПометкаУдаления
	|	И КонтурЛогистика_ОрганизацииДиадок.Наш";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ИНН) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийОбъект = Выборка.Ссылка.Получитьобъект();
		ТекущийОбъект.СинхронизироватьИзСервисаЛогистика();
		ТекущийОбъект = Неопределено;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьВодителейИзСервиса()
	
	Организации = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступныеОрганизацииДляСервисаФизЛиц();
	Для Каждого Организация Из Организации Цикл
		Попытка
			КонтурЛогистика_СервисФизическихЛицСервер.ЗагрузитьДанныеСотрудниковИзСервиса(Организация);
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			СообщитьХодВыполнения(ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройкиКонвертацииРегистраСведений()
	
	Справочники.КонтурЛогистика_НастройкиКонвертацииРегистровСведений.ЗаполнитьАвтоматическиДляТекущейКонфигурации();
	
	ТипДокументаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5;
	ТипДокумента1С_СтрокаИлиСсылкаНаДокумент = "уатПутевойЛист";
	ТекущаяНастройка = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
		ТипДокументаЛогистика, ТипДокумента1С_СтрокаИлиСсылкаНаДокумент);
	Если ЗначениеЗаполнено(ТекущаяНастройка) Тогда
		ТекущаяНастройкаОбъект = ТекущаяНастройка.ПолучитьОбъект();
		
		ЕстьПеременная = Ложь;
		Для Каждого ТекущаяСтрока Из ТекущаяНастройкаОбъект.Переменные Цикл
			Если ТекущаяСтрока.Имя = "ПоказанияГСМСформированы" Тогда
				ЕстьПеременная = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьПеременная Тогда
			НоваяСтрока = ТекущаяНастройкаОбъект.Переменные.Добавить();
			НоваяСтрока.Имя = "ПоказанияГСМСформированы";
			НоваяСтрока.СпособМаппинга = Перечисления.КонтурЛогистика_СпособыМаппингаПоля.ВычислитьВыражение;
			НоваяСтрока.ВыражениеВычисленияСтрокаНеогр =
				"ИмяКонфигурации1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(""ИмяКонфигурации1С"");
				|Если ИмяКонфигурации1С = ""УАТ""
				|	Или ИмяКонфигурации1С = ""ТЛЭ""
				|	Или ИмяКонфигурации1С = ""УАТ_ПРОФ""
				|	Или ИмяКонфигурации1С = ""ERP_УАТ"" Тогда
				|	
				|	КонтурЛогистика_КонвертацияСервер.КонвертироватьПриТриггереУникальноеИмяПрограммногоВызова(""ПриФормированииПЛТ5"", Основание, Объект.Титул1);
				|КонецЕсли;
				|
				|РезультатВычисления = Истина;";
			НоваяСтрока.СпособКонвертацииЗначения = Перечисления.КонтурЛогистика_СпособыКонвертации.БезДопОбработки;
			
			ТекущаяНастройкаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТипПечатнойФормыПутыхЛистовВТранспортныеСредства()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ТранспортныеСредства.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ТранспортныеСредства.ТипТС КАК ТипТС
	|ИЗ
	|	Справочник.КонтурЛогистика_ТранспортныеСредства КАК КонтурЛогистика_ТранспортныеСредства
	|ГДЕ
	|	КонтурЛогистика_ТранспортныеСредства.ТипПечатнойФормыПутыхЛистов = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыПечатныхФормПутыхЛистов.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТСОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТСОбъект.ОбменДанными.Загрузка = Истина;
		ТСОбъект.ТипПечатнойФормыПутыхЛистов = Справочники.КонтурЛогистика_ТранспортныеСредства.ТипПечатнойФормыПоТипуТранспортногоСредства(
			Выборка.ТипТС);
		ТСОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЧасовойПоясВПунктахМаршрута()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПунктыМаршрута.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ПунктыМаршрута.АдресКодРегион КАК АдресКодРегион
	|ИЗ
	|	Справочник.КонтурЛогистика_ПунктыМаршрута КАК КонтурЛогистика_ПунктыМаршрута
	|ГДЕ
	|	НЕ КонтурЛогистика_ПунктыМаршрута.ПометкаУдаления
	|	И КонтурЛогистика_ПунктыМаршрута.АдресКодРегион <> """"
	|	И КонтурЛогистика_ПунктыМаршрута.ЧасовойПояс = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПунктМаршрутаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПунктМаршрутаОбъект.ОбменДанными.Загрузка = Истина;
		ПунктМаршрутаОбъект.ЧасовойПояс = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЧасовойПоясПоКодуРегиона(Выборка.АдресКодРегион);
		ПунктМаршрутаОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПереходЭПЛНаФормат502(ТихийРежим = Истина) Экспорт

	Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПеренестиНастройкиКонвертацииДокументовДляЭПЛВФормат502();
	Справочники.КонтурЛогистика_СценарииАвтоматическойРаботы.ПеренестиСценарииАвтоотправкиДляЭПЛВФормат502();
	
	Попытка
		
		Справочники.КонтурЛогистика_ТранспортныеСредства.ЗаполнитьТипТСПоКлассификатору(ТихийРежим);
		
	Исключение
		
		ТекстОшибки = "Ошибка при заполнение типа ТС по классификатору при переходе ЭПЛ на формат 5.02. Ошибка: " + ОписаниеОшибки();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Если Не ТихийРежим Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;
				
	КонецПопытки;
	
	Попытка
		
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.ЗаполнитьЕдИзмГСМПоКлассификатору(ТихийРежим);
		
	Исключение
		
		ТекстОшибки = "Ошибка при заполнение ед. изм. ГСМ по классификатору при переходе ЭПЛ на формат 5.02. Ошибка: " + ОписаниеОшибки();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Если Не ТихийРежим Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;
				
	КонецПопытки;
	
	Попытка
		
		Справочники.КонтурЛогистика_Сотрудники.ЗаполнитьСНИЛСВФормате502(ТихийРежим);
		
	Исключение
		
		ТекстОшибки = "Ошибка при заполнение СНИЛС при переходе ЭПЛ на формат 5.02. Ошибка: " + ОписаниеОшибки();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Если Не ТихийРежим Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;
				
	КонецПопытки;
	
	Попытка
		
		Справочники.КонтурЛогистика_СертификатыЭлектроннойПодписи.ЗаполнитьДолжностьИзДанныхСертификата();
		
	Исключение
		
		ТекстОшибки = "Ошибка при должности из сертификата при переходе ЭПЛ на формат 5.02. Ошибка: " + ОписаниеОшибки();
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Если Не ТихийРежим Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;
				
	КонецПопытки;
		
КонецПроцедуры

// Конец ОбработчикиОбновления