#Область ПрограммныйИнтерфейс

// Определяет ведение учета алкогольной продукции
//
// Возвращаемое значение:
//  Булево - ведется учет алкогольной продукции
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат ОбщегоНазначенияЕГАИСВызовСервера.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

// Учитываемые виды маркируемой продукции.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из СправочникСсылка.ВидыПродукцииИС - Учитываемые виды маркируемой продукции
Функция УчитываемыеВидыМаркируемойПродукции() Экспорт

	Возврат ОбщегоНазначенияЕГАИСВызовСервера.УчитываемыеВидыМаркируемойПродукции();

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРасширеннаяВерсияГосИС() Экспорт
	
	Возврат ОбщегоНазначенияЕГАИСВызовСервера.ЭтоРасширеннаяВерсияГосИС();
	
КонецФункции

#КонецОбласти