#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройки, используемые для встраивания интерфейса кеша штрихкодов упаковок в форму документа ЕГАИС.
// 
// Возвращаемое значение:
//  См. ПроверкаИПодборПродукцииИС.НастройкиИсточникаКешаШтрихкодовУпаковок
Функция НастройкиИсточникаКешаШтрихкодовУпаковок() Экспорт
	
	Результат = ПроверкаИПодборПродукцииИС.НастройкиИсточникаКешаШтрихкодовУпаковок();
	Результат.Штрихкоды        = "АкцизныеМарки";
	Результат.ШтрихкодУпаковки = "АкцизнаяМарка";
	Результат.ИспользоватьОСУ  = Ложь;
	
	Возврат Результат;
	
КонецФункции

#Область ПараметрыИнтеграцииФормыПроверкиИПодбора

// Заполняет специфику интеграции формы проверки и подбора в конкретную форму.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для которой настраиваются параметры интеграции:
//  *Объект - ДокументОбъект
//  ПараметрыИнтеграции - (См. ПроверкаИПодборПродукцииИС.ПараметрыИнтеграцииФормПроверкиИПодбора).
//
Процедура ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(Форма, ПараметрыИнтеграции) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктПостановкиНаБалансЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииЕГАИС(Форма));
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.АктСписанияЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииЕГАИС(Форма));
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииЕГАИС(Форма));
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекЕГАИСВозврат") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииЕГАИС(Форма));
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНВходящаяЕГАИС") Тогда
		
		ЭлементНастроек = ПараметрыИнтеграцииЕГАИС(Форма);
		ЭлементНастроек.ЭтоДокументПриобретения = Истина;
		ПараметрыИнтеграции.Добавить(ЭлементНастроек);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ТТНИсходящаяЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииЕГАИС(Форма));
		
		ЭлементАктаРасхождений = ПараметрыИнтеграцииЕГАИС(Форма);
		ЭлементАктаРасхождений.Сценарий = 1;
		ПараметрыИнтеграции.Добавить(ЭлементНастроек);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОбИмпортеЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииКодыМаркировки(Форма));
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПроизводствеЕГАИС") Тогда
		
		ПараметрыИнтеграции.Добавить(ПараметрыИнтеграцииКодыМаркировки(Форма));
		
		ЭлементСырье = ПараметрыИнтеграцииЕГАИС(Форма);
		ЭлементСырье.ИмяТабличнойЧастиТовары = "Сырье";
		ЭлементСырье.РазмещатьЭлементыИнтерфейса = Ложь;
		ЭлементСырье.Сценарий = 1;
		ПараметрыИнтеграции.Добавить(ЭлементСырье);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаИПодборПродукцииИС

// Настройка и проверка параметров формы проверки и подбора
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - См. Обработка.ПроверкаИПодборПродукцииИС.Форма.ПроверкаИПодбор
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  Отказ - Булево - Отказ от открытия формы проверки
Процедура НастроитьФормуПроверки(Форма, ПараметрыСканирования, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.ОрганизацияЕГАИС)
		И Форма.Параметры.БезУчетаОрганизацииЕГАИС = Ложь Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указана организация ЕГАИС.'"),,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ПодобраннаяМаркируемаяПродукцияАлкогольнаяПродукция.Видимость =
		Форма.ПараметрыСканирования.ЗапрашиватьАлкогольнуюПродукцию;
	Форма.Элементы.ПодобраннаяМаркируемаяПродукцияСправка2.Видимость =
		Форма.ПараметрыСканирования.ЗапрашиватьСправку2;
	
КонецПроцедуры

Функция ПараметрыИнтеграцииЕГАИС(Форма)
	
	ПараметрыИнтеграции = ПроверкаИПодборПродукцииИС.ПараметрыИнтеграцииФормПроверкиИПодбора();
	ПараметрыИнтеграции.РазмещатьЭлементыИнтерфейса         = Истина;
	ПараметрыИнтеграции.ИспользоватьБезМаркируемойПродукции = Истина;
	ПараметрыИнтеграции.ИмяТабличнойЧастиСерии              = Неопределено;
	ПараметрыИнтеграции.ЕстьПравоИзменение                  = ПравоДоступа("Изменение", Форма.Объект.Ссылка.Метаданные())
		И Не Форма.РедактированиеФормыНедоступно;
	ПараметрыИнтеграции.ИмяТабличнойЧастиШтрихкодыУпаковок  = "АкцизныеМарки";
	ПараметрыИнтеграции.ИмяКолонкиШтрихкодУпаковки          = "АкцизнаяМарка";
	Возврат ПараметрыИнтеграции;
	
КонецФункции

Функция ПараметрыИнтеграцииКодыМаркировки(Форма)
	
	ПараметрыИнтеграции = ПроверкаИПодборПродукцииИС.ПараметрыИнтеграцииФормПроверкиИПодбора();
	ПараметрыИнтеграции.ИмяТабличнойЧастиСерии              = Неопределено;
	ПараметрыИнтеграции.ЕстьПравоИзменение                  = ПравоДоступа("Изменение", Форма.Объект.Ссылка.Метаданные())
		И Не Форма.РедактированиеФормыНедоступно;
	Возврат ПараметрыИнтеграции;
	
КонецФункции

#КонецОбласти

#КонецОбласти