
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументЭТрН = ПараметрКоманды;
	Если Не ЭтоНашПеревозчик(ДокументЭТрН) Тогда
		
		ВызватьИсключение "В документе ЭТРН у организации-перевозчика не стоит один из флагов ""Наш"" или ""Перевозчик""";
		
	КонецЕсли;	
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	
	ДокументЛогистика = Неопределено;
	
	Если Форма.ИмяФормы = "ОбщаяФорма.КонтурЛогистика_Задачи" Тогда 
		
		ТекДанные = Форма.Элементы.ЗадачиДинамическийСписок.ТекущиеДанные;
		
		Если Не ТекДанные = Неопределено Тогда 
			
			ДокументЛогистика = ТекДанные.ДокументЛогистика;
			
		КонецЕсли;	
		
	ИначеЕсли Форма.ИмяФормы = "Документ.КонтурЛогистика_ТрН_Титул2.Форма.ФормаДокумента" 
		Или Форма.ИмяФормы = "Документ.КонтурЛогистика_ТрН_Титул4.Форма.ФормаДокумента" Тогда 
		
		ДокументЛогистика = Форма.Объект.Ссылка;
		
	Иначе
		
		НайденныйТ4 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул4"), ДокументЭТрН);
		Если ЗначениеЗаполнено(НайденныйТ4) Тогда 
			ДокументЛогистика = НайденныйТ4;
		Иначе
			НайденныйТ2 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиТитул(ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2"), ДокументЭТрН);
			Если ЗначениеЗаполнено(НайденныйТ2) Тогда 
				ДокументЛогистика = НайденныйТ2;
			Иначе
				ВызватьИсключение "Сначала надо ввести/получить титул 2 (начать перевозку) ";
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если Не ДокументЛогистика = Неопределено Тогда 
		
		Если ТипЗнч(ДокументЛогистика) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул2") 
			Или ТипЗнч(ДокументЛогистика) = Тип("ДокументСсылка.КонтурЛогистика_ТрН_Титул4") Тогда 
			
			Если НельзяСоздаватьТитул(ДокументЛогистика) Тогда 
				
				ВызватьИсключение "Создавать Титул 7(перевозчик, переадресация) можно только из состояния документооборота ""В пути"" или ""Завершен""";
				
			Иначе
				
				ДанныеЗаполнения = Новый Структура("ПредыдущийТитул, ТипЛогистика", ДокументЛогистика, ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул7"));
				
			КонецЕсли;
		
		Иначе	
			
			ВызватьИсключение "Команда не может быть выполнена для указанного объекта";
			
		КонецЕсли;
	
	Иначе
		
		ВызватьИсключение "Нет основания для создания Титула 7";
		
	КонецЕсли;	
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Документ.КонтурЛогистика_ТрН_Титул7.ФормаОбъекта",
		Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения));
	
КонецПроцедуры

&НаСервере
Функция НельзяСоздаватьТитул(ТитулСсылка)
	
	ТекСтатус = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(ТитулСсылка.ДокументЭТРН, Истина);
	
	Если ТекСтатус = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("on-the-way")
		Или ТекСтатус = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("completed")
		Или ТекСтатус = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pd-on-the-way")
		Или ТекСтатус = Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pd-wait-carrier-readdress-sign") Тогда
		
		МожноСоздавать = Истина;
		
	Иначе
		
		МожноСоздавать = Ложь;
		
	КонецЕсли;
	
	Возврат Не МожноСоздавать;
	
КонецФункции

&НаСервере
Функция ЭтоНашПеревозчик(ДокументЭТрН)
	
	Возврат ДокументЭТрН.Перевозчик.Перевозчик И ДокументЭТрН.Перевозчик.Наш;
	
КонецФункции

