Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаЗН(Данные, Представление, СтандартнаяОбработка, "2");

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Обязательные манифесты:

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("СотрудникПринЗН");
	МассивОбязательных.Добавить("ДолжПринЗН");
	МассивОбязательных.Добавить("ДатаПринЗН");
	МассивОбязательных.Добавить("Водитель");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	МассивОбязательных.Добавить("ПутевойЛистНомер");
	МассивОбязательных.Добавить("ПутевойЛистСрокДействия");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

// какие поля могут быть высчитаны из базовых
Функция МассивБазовыхСоответствийРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеВодители",
		"Дополнительные водители",
		"Указываются дополнительные водители",
		"МассивСтруктур(см. таблицу ДополнительныеВодители)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ЗН");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("ДокументЗН");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфФщ");
	МассивКлючевых.Добавить("ВрИнфФщ");
	
	МассивКлючевых.Добавить("ДатФайлИнфФт");
	МассивКлючевых.Добавить("ВрФайлИнфФт");
	МассивКлючевых.Добавить("ИдФайлИнфФт");
	МассивКлючевых.Добавить("ЭПФт");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

// Конец Обязательные манифесты

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ГлавныйДокумент = Объект.ДокументЗН;
	
	Если НЕ ЗначениеЗаполнено(ГлавныйДокумент)  Тогда
		
		ТекстОшибки = "Титул не привязан к Документу Заказ-Наряд";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументЗН", КатегорияОшибка, ТекстОшибки, "Указать");
		
	Иначе    
		
		МассивОрганзаций = Новый Массив;
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтователь);
		МассивОрганзаций.Добавить(ГлавныйДокумент.Фрахтовщик);
		
		ОбязательныеРеквизитыГлавного = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.МассивОбязательныхРеквизитов();
		
		Для Каждого ОбязательныйРевизит Из ОбязательныеРеквизитыГлавного Цикл
			Если НЕ ЗначениеЗаполнено(ГлавныйДокумент[ОбязательныйРевизит])  Тогда
				
				ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.СинонимРеквизита(ОбязательныйРевизит);
				ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним + " в Документе электронной транспортной накладной";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ГлавныйДокумент." + ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
		КонецЦикла;
		
		Документы.КонтурЛогистика_ЭлектронныйЗаказНаряд.ПроверитьКлючевыеРеквизиты(ГлавныйДокумент, ТаблицаОшибок);

	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ЗН_Титул2.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.СвПрочУсл.Количество() = 0 Тогда
		
		ТекстОшибки = "Укажите хотя бы одну строку условий";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"СвПрочУсл", КатегорияОшибка, ТекстОшибки, "Указать");
	Иначе
		
		Для Каждого СтрокаСвПрочУсл Из Объект.СвПрочУсл Цикл 
			
			Если СокрЛП(СтрокаСвПрочУсл.РежТрОтд) = "" Тогда 
				
				ТекстОшибки = "Укажите Режим труда и отдыха водителя";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СвПрочУсл", СтрокаСвПрочУсл.НомерСтроки, 
					"СвПрочУсл", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаСвПрочУсл.ИдСР) Тогда 
				
				Если Не ЗначениеЗаполнено(СтрокаСвПрочУсл.НомСР)
					 ИЛИ Не ЗначениеЗаполнено(СтрокаСвПрочУсл.ДатаСР)
					 ИЛИ Не ЗначениеЗаполнено(СтрокаСвПрочУсл.СрокСР)
					Тогда
					
					ТекстОшибки = "Заполните реквизиты спец разрешения или его идентификатор";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СвПрочУсл", СтрокаСвПрочУсл.НомерСтроки, 
						"СвПрочУсл", КатегорияОшибка, ТекстОшибки, "Указать");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция ПроверитьСвязанныеОпасныеГрузы(Знач Объект, Знач СтрокаТовара, ТаблицаОшибок)
	
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	ТекущийНомерСтроки = СтрокаТовара.НомерСтроки;
	ИмяТЧ = "Товары"; // ошибки будем складывать к товарам

	СвязанныеСтрокиОГ = Объект.ОпасныеГрузы.НайтиСтроки(Новый Структура("ИдентификаторСтрокиТоваров", СтрокаТовара.ИдентификаторСтроки));
	Для Каждого СтрокаОГ Из СвязанныеСтрокиОГ Цикл 
		
		Если ЗначениеЗаполнено(СтрокаОГ.ОписаниеОпасногоГруза) Тогда 
			Источник = СтрокаОГ.ОписаниеОпасногоГруза;
		Иначе
			Источник = СтрокаОГ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НомерООН) Тогда
			ТекстОшибки = "Укажите Номер ООН опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.НадлежащееОтгрузочноеНаименование) Тогда
			ТекстОшибки = "Укажите Надлежащее отгрузочное наименование опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.Класс) Тогда
			ТекстОшибки = "Укажите Класс опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КлассификационныйКод) Тогда
			ТекстОшибки = "Укажите Классификационный код опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ГруппаУпаковки) Тогда
			ТекстОшибки = "Укажите Группу упаковки опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ЗнакОпасности) Тогда
			ТекстОшибки = "Укажите Знак опасности опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.КодОграниченияТуннели) Тогда
			ТекстОшибки = "Укажите Код ограничения проезда через туннели опасного груза";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
			"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
		КонецЕсли;
		
		Если Источник.Класс = Перечисления.КонтурЛогистика_КлассыОпасностиГрузов.Класс1 Тогда
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСод) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для каждого вещества или изделия, имеющего отдельный номер ООН (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Источник.ОбМасНетВзрСодВсех) Тогда
				ТекстОшибки = "Укажите Общая масса нетто взрывчатого содержимого в килограммах для всех веществ и изделий, которых касается сопроводительная ведомость (т.к. класс = 1)";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, ТекущийНомерСтроки, 
				"ОтгрузочноеНаименование", КатегорияОшибка, ТекстОшибки, "Заполнить",,, "Указать");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ЗН_Титул2.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецЕсли
