#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ЗН_Титул2_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		ЗаполнитьПоДокОснованию(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;

		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);

	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ЗН_Титул2_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из док Основания

Процедура ЗаполнитьПоДокОснованию(Знач ДанныеЗаполнения)
	
	Перем ГлавныйДокументОбъект, НайденныйЗН, НастройкаКонвертации;
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
								ДанныеЗаполнения.ТипЛогистика, 
								ДанныеЗаполнения.ДокументОснование);
	
	// ДокументЭТрН потребуется создать(найти) и записать в базу.
	
	НайденныйЗН = КонтурЛогистика_ОбработкаДокументовСервер.НайтиЗН(ДокументОснование, НастройкаКонвертации);
	Если ЗначениеЗаполнено(НайденныйЗН) Тогда 
		ГлавныйДокумент = НайденныйЗН;
		
		// перезаполним ЭТРН если взведен флаг
		Если ДанныеЗаполнения.Свойство("ПерезаполнитьГлавныйДокументЕслиСуществует") И ДанныеЗаполнения.ПерезаполнитьГлавныйДокументЕслиСуществует Тогда 
			
			ГлавныйДокументОбъект = ГлавныйДокумент.ПолучитьОбъект();
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ГлавныйДокументОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
			ГлавныйДокументОбъект.Записать();
			
		КонецЕсли;
		
	Иначе
		
		ИмяГлавногоДокумента = "КонтурЛогистика_" + Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ИмяГлавногоДокументаКонтурЛогистика(ДанныеЗаполнения.ТипЛогистика);
		ГлавныйДокументОбъект = Документы[ИмяГлавногоДокумента].СоздатьДокумент();
		
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(ГлавныйДокументОбъект, ДанныеЗаполнения.ДокументОснование, НастройкаКонвертации);
		ГлавныйДокументОбъект.Записать();
		ДокументЗН = ГлавныйДокументОбъект.Ссылка;
		
	КонецЕсли;
	
	//Заполнить ЭтотТитул
	КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ДокументЗН.Фрахтовщик,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		// TODO дефолты, зависящие от Пользователя
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из пришедшего файла XML

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйГлавный = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлу(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйГлавный) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти главный Документ, создание не выполнено");
		
	Иначе
		
		ЭтотОбъект.ДокументЗН = НайденныйГлавный;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		СодЗНИнфФщ = XDTO.Документ.СодЗНИнфФщ;
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO, СодЗНИнфФщ);
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO, СодЗНИнфФщ)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ 		= КС.XDTO_Вычислить(XDTO, "Документ");
	
	УИД_ЗН 			= КС.XDTO_Вычислить(СодЗНИнфФщ, "УИД_ЗН");
	
	ДатИнфФщ 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфФщ"));
	ВрИнфФщ 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфФщ"));
	
	ДатФайлИнфФт 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфФт.ДатФайлИнфФт"));
	ВрФайлИнфФт 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфФт.ВрФайлИнфФт"));
	ИдФайлИнфФт 	= КС.XDTO_Вычислить(Документ, "ИдИнфФт.ИдФайлИнфФт");
	
	ЭПФт = КС.XDTO_Вычислить(Документ, "ИдИнфФт.ЭП");
	
	ДатаПринЗН		= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвПринЗНИсп.ДатаПринЗН"));
	ДолжПринЗН		= КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвПринЗНИсп.ДолжПринЗН");
	СотрудникПринЗН	= КС.Конвертировать_ФИОТип_вСотрудникаЛогистика(КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвПринЗНИсп.ФИО"));
	
	ТранспортноеСредство = КС.Конвертировать_СвТС_вТранспортноеСредствоЛогистика(КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвТС"), Ложь);
	
	// Водитель, Путевой лист и доп. водители
	ДополнительныеВодители.Очистить();
	Массив_XDTO_СвВодит = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвТС.СвВодит"));
	Водитель 			= КС.Конвертировать_СвВодит_вВодителяЛогистика(Массив_XDTO_СвВодит[0]);     
	ПутевойЛистНомер    = КС.XDTO_Вычислить(Массив_XDTO_СвВодит[0],	"ПутевойЛист.НомерПЛ");
	ПутевойЛистДата     = КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Массив_XDTO_СвВодит[0],	"ПутевойЛист.ДатаВыпПЛ"));
	ПутевойЛистСрокДействия = КС.XDTO_Вычислить(Массив_XDTO_СвВодит[0],	"ПутевойЛист.СвСрокПЛ");
	// доп водители
	Если Массив_XDTO_СвВодит.Количество() > 1 Тогда 
		Для й = 2 по Массив_XDTO_СвВодит.Количество() Цикл 
			СтрокаДопВодителя = ДополнительныеВодители.Добавить();
			СтрокаДопВодителя.Водитель 			= КС.Конвертировать_СвВодит_вВодителяЛогистика(Массив_XDTO_СвВодит[й-1]);
			СтрокаДопВодителя.ПутевойЛистНомер 	= КС.XDTO_Вычислить(Массив_XDTO_СвВодит[й-1],	"ПутевойЛист.НомерПЛ");
			СтрокаДопВодителя.ПутевойЛистДата  	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Массив_XDTO_СвВодит[й-1],	"ПутевойЛист.ДатаВыпПЛ"));
			СтрокаДопВодителя.ПутевойЛистСрокДействия = КС.XDTO_Вычислить(Массив_XDTO_СвВодит[й-1],	"ПутевойЛист.СвСрокПЛ");
		КонецЦикла;
	КонецЕсли;
	
	// стоимости
	ПлатСтУсл           = КС.XDTO_ВычислитьЧисло(СодЗНИнфФщ,	"СвРазПлатТС.СтУсл");
	ПлатРасхПлатДор     = КС.XDTO_ВычислитьЧисло(СодЗНИнфФщ,	"СвРазПлатТС.РасхПлатДор");
	ПлатРасхТамПош      = КС.XDTO_ВычислитьЧисло(СодЗНИнфФщ,	"СвРазПлатТС.РасхТамПош");
	ПлатРасхПром        = КС.XDTO_ВычислитьЧисло(СодЗНИнфФщ,	"СвРазПлатТС.РасхПром");
	ПлатРасчет          = КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвРазПлатТС.Расчет");
	ПлатРазмерПлат      = КС.XDTO_ВычислитьЧисло(СодЗНИнфФщ,	"СвРазПлатТС.РазмерПлат");
	
	// прочее и акты
	СвПрочУсл.Очистить();
	Акты.Очистить();
	Массив_XDTO_СвПрочУсл = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(СодЗНИнфФщ,	"СвПрочУсл"));
	Для Каждого XDTO_СвПрочУсл Из Массив_XDTO_СвПрочУсл Цикл 
		
		НоваяСтрокаУсловия = СвПрочУсл.Добавить();
		НоваяСтрокаУсловия.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		НоваяСтрокаУсловия.НомСР 	= КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"НомСР");
		НоваяСтрокаУсловия.ДатаСР 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"ДатаСР"));
		НоваяСтрокаУсловия.СрокСР 	= КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"СрокСР");
		НоваяСтрокаУсловия.ИдСР 	= КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"ИдСР");
		НоваяСтрокаУсловия.РежТрОтд = КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"РежТрОтд");
		НоваяСтрокаУсловия.Маршрут 	= КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"СведМрш.МршТекст");
		НоваяСтрокаУсловия.МаршрутМашиночитаемый = КС.XDTO_Вычислить(XDTO_СвПрочУсл, "СведМрш.МршМашЧит");
		
		// акты
		Массив_XDTO_СвАкт = КС.XDTO_ВычислитьМассивXDTO(КС.XDTO_Вычислить(XDTO_СвПрочУсл,	"СвАкт"));
		Для Каждого XDTO_СвАкт Из Массив_XDTO_СвАкт Цикл 
			
			НоваяСтркоаАкта = Акты.Добавить();
			НоваяСтркоаАкта.ИдентификаторСтрокиСвПрочУсл = НоваяСтрокаУсловия.ИдентификаторСтроки;
			НоваяСтркоаАкта.АктНомер 		= КС.XDTO_Вычислить(XDTO_СвАкт, "НомерДок");
			НоваяСтркоаАкта.АктДата 		= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(XDTO_СвАкт, "ДатаДок"));
			НоваяСтркоаАкта.АктНаименование = КС.XDTO_Вычислить(XDTO_СвАкт, "НаимДок");
			НоваяСтркоаАкта.АктИдДок 		= КС.XDTO_Вычислить(XDTO_СвАкт, "ИдДок");
			НоваяСтркоаАкта.АктДопСведДок 	= КС.XDTO_Вычислить(XDTO_СвАкт, "ДопСведДок");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Из предыдущего титула

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	НастройкаКонвертации = Справочники.КонтурЛогистика_НастройкиКонвертацииДокументов.ПолучитьНастройкуКонвертации(
							ДанныеЗаполнения.ТипЛогистика);
							
	УИД_ЗН 		= ПредыдущийТитул.УИД_ЗН;
	Если Не ЗначениеЗаполнено(УИД_ЗН) Тогда 
		УИД_ЗН = "Отсутствует";
	КонецЕсли;
	ДокументЗН 	= ПредыдущийТитул.ДокументЗН;
	
	ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
		
	// Ищем титул1 - оттуда нужны товары и некоторые итоговые реквизиты
	
	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		
		ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации);

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1;
	
	ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ПредыдущийТитул);
	
	ЭтотОбъект.ДатФайлИнфФт 	= ПредыдущийТитул.ДатИнфФт;
	ЭтотОбъект.ВрФайлИнфФт  	= ПредыдущийТитул.ВрИнфФт;
	ЭтотОбъект.ИдФайлИнфФт 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	
	ДвоичныеДанныеПодписи = ФайлТитула1.Подпись.Получить();
	ЭПФт 				= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(НастройкаКонвертации)

	Если ЗначениеЗаполнено(НастройкаКонвертации) Тогда 
		//Заполнить ЭтотТитул
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(ЭтотОбъект, НастройкаКонвертации);
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////
// Генерация xml

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ЗН_Титул2.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ЭтотОбъект.ДатИнфФщ = ТекущаяДатаСеанса();
	ЭтотОбъект.ВрИнфФщ = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ЭтотОбъект.ДатИнфФщ, ЭтотОбъект.ВрИнфФщ);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул2,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфГО и ВрИнфГО
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	ТипДокументооборота = "__zakazNarTitle";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(2, , ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаЗН(2, 
												ДокументЗН.Фрахтователь,
												ДокументЗН.Фрахтовщик,
												GUID); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
	
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ДокументЗН.Фрахтовщик, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	XDTO_Подписант 		= КС.XDTO_Подписант(2, ТипДокументооборота, , ПодписантСтруктура, неопределено); // TODO МЧД
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(2, ТипДокументооборота, , XDTO_Подписант, ДатаФормирования, ВремяФормирования);

	XDTO_СодЗНИнфФщ = КС.XDTO_СодЗНИнфФщ_Т2(2, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодЗНИнфФщ", XDTO_СодЗНИнфФщ);
	
	XDTO_ИдИнфФт 		= КС.XDTO_ИдИнфФт(2, , Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфФт", XDTO_ИдИнфФт);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
